{
  "url": "https://www.onlinegames.io/a-small-world-cup/",
  "title": "A Small World Cup",
  "category": "/t/arcade/",
  "thumbnail": "https://www.onlinegames.io/media/posts/909/a-small-world-cp.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/909/a-small-world-cp.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/909/responsive/a-small-world-cp-xs.jpg 384w, https://www.onlinegames.io/media/posts/909/responsive/a-small-world-cp-sm.jpg 600w, https://www.onlinegames.io/media/posts/909/responsive/a-small-world-cp-md.jpg 768w, https://www.onlinegames.io/media/posts/909/responsive/a-small-world-cp-lg.jpg 1200w",
    "alt": "A Small World Cup Play Online",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://cloud.onlinegames.io/games/2024/more2/a-small-world-cup/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "How to Play A Small World Cup"
      },
      {
        "type": "h3",
        "text": "When the Match Starts"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "More World Cup Games"
      }
    ],
    "controls": [
      "For Computers:",
      "Hold LMB to aim, release to send",
      "For Mobiles:",
      "Tap and hold to aim release to send"
    ],
    "howToPlay": "Pick from 8 glorious tournaments: World Cup Classic, World Cup 2022, Euro Cup 2024, America Cup, or dive into club territory with options like Euro Clubs, Italian Clubs, English Clubs, and Other Clubs.Pick your mode: normal or golden goal.Normal Mode: Classic 45-second matches to prove you're the best—or bump it to 90 seconds if you like dragging out your victories.Golden Goal Mode: One goal wins it all. Quick, brutal, and perfect for those who live on the edge.Choose from a range of countries, and don't worry—your choice just changes the shirt color, not your skill level. The game then kindly assigns you a random opponent who is equally as clueless.",
    "tips": "",
    "developer": "RujoGames created A Small World Cup.",
    "similarGames": []
  },
  "fullContent": "Home› World CupA Small World CupBy OnlineGames.ioMake Game Full ScreenForget all those other soccer games where players throw the ball toward the goalposts. This time, we're throwing the players at the ball and crossing our fingers it somehow turns into a goal!A Small World Cup is a funny 2 player soccer game with pixelated visuals where the players (yes, the ragdoll ones) do all the heavy lifting... or slamming. Instead of carefully lining up a shot, you'll aim your ragdoll footballer, pull back, and release for a full-speed dive at the ball. It's chaotic, it's funny, and it's as unpredictable as it sounds!Prepare to laugh, strategize (kind of), and accidentally score on yourself—because in this game, anything can happen!You can pick your national team and compete in 1v1 matches to win cups like the Euro Cup 2024, World Cup, America Cup and more.ControlsFor Computers:Hold LMB to aim, release to sendFor Mobiles:Tap and hold to aim release to sendHow to Play A Small World CupPick from 8 glorious tournaments: World Cup Classic, World Cup 2022, Euro Cup 2024, America Cup, or dive into club territory with options like Euro Clubs, Italian Clubs, English Clubs, and Other Clubs.Pick your mode: normal or golden goal.Normal Mode: Classic 45-second matches to prove you're the best—or bump it to 90 seconds if you like dragging out your victories.Golden Goal Mode: One goal wins it all. Quick, brutal, and perfect for those who live on the edge.Choose from a range of countries, and don't worry—your choice just changes the shirt color, not your skill level. The game then kindly assigns you a random opponent who is equally as clueless.When the Match StartsHit the start and let the madness begin! It's a 1v1 showdown where YOU are the offense and the defense.Aim your ragdoll footballer by dragging your mouse (or tapping if you're on mobile).Release and watch as your player launches at the ball with all the grace of a flying potato.Go easy on the power, or you might score an own goal. Your opponent will thank you.Outscore your opponent, move through the rounds, and lift the trophy like the ragdoll legend you are!DeveloperRujoGames created A Small World Cup.More World Cup GamesThe roar of the crowd, cheers, vuvuzelas, and whistles.. If you like the spirit of soccer, you're invited to explore other online World Cup games on OnlineGames.io. This article was updated on January 2, 20252 Player2DArcadeArenaBallCo-OpCrazyFreeFunFunnyPixelSoccerSportsWorld Cup",
  "extractedAt": "2025-06-10T05:13:55.948Z",
  "localThumbnail": "A Small World Cup_1749532435948.jpg"
}