{
  "url": "https://www.onlinegames.io/agar-io/",
  "title": "Agar.io",
  "category": "/t/io-games/",
  "thumbnail": "https://www.onlinegames.io/media/posts/409/Agar.io-2.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/409/Agar.io-2.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/409/responsive/Agar.io-2-xs.jpg 384w, https://www.onlinegames.io/media/posts/409/responsive/Agar.io-2-sm.jpg 600w, https://www.onlinegames.io/media/posts/409/responsive/Agar.io-2-md.jpg 768w, https://www.onlinegames.io/media/posts/409/responsive/Agar.io-2-lg.jpg 1200w",
    "alt": "Agar.io Play Online",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://html5.gamedistribution.com/78d6bf3679a7471c9731acbd651fc730/?gd_sdk_referrer_url=https://www.onlinegames.io/agar-io/",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "How to play Agar.io?"
      },
      {
        "type": "h2",
        "text": "What is Agar.io?"
      },
      {
        "type": "h2",
        "text": "Tips and Tricks"
      },
      {
        "type": "h2",
        "text": "Game Modes"
      },
      {
        "type": "h2",
        "text": "More Games Like This"
      }
    ],
    "controls": [],
    "howToPlay": "It is very straightforward to play Agar.io. You can control your cell with your mouse and press the Space key to split your cell into pieces. And use the W key to eject mass from your cell. Before starting the game, determine your nickname and create your skin.",
    "tips": "Creating your own technique and strategy while playing this game is essential. And there are many ways to do it.\n\nYou can split your own cell in half while trying to attack a cell smaller than you. This will help you surround the opponent and catch them easily. It may take some time to get used to it and use it to the best of your ability.You can lessen your body and spray a particular part of the cell to move faster. Use the W key and your cell's mass is thrown out toward the cursor. This is a great way to raise your speed in the game.You cannot eat a cell that is the same size as you. You can only attack those who are smaller than you. Make your attack when you are sure you are big enough to attack someone.",
    "developer": "",
    "similarGames": []
  },
  "fullContent": "Home› io GamesAgar.ioBy OnlineGames.ioMake Game Full ScreenAre you ready to expand your cell among dozens of players? Agar.io is an online multiplayer game where you are born as a cell. The goal of Agar.io is to grow yourself by eating blobs without getting in contact with any other player in the game. You lose if you run into a bigger player and they catch you.How to play Agar.io?It is very straightforward to play Agar.io. You can control your cell with your mouse and press the Space key to split your cell into pieces. And use the W key to eject mass from your cell. Before starting the game, determine your nickname and create your skin.What is Agar.io?Agar.io is a trendy IO game you can play on OnlineGames.io freely. You are competing against other players in this game. There is a leaderboard; the only way to be at the top is to get bigger by eating as many cells and blobs as possible. But remember, as you grow, you lose your movement speed.Tips and TricksCreating your own technique and strategy while playing this game is essential. And there are many ways to do it.You can split your own cell in half while trying to attack a cell smaller than you. This will help you surround the opponent and catch them easily. It may take some time to get used to it and use it to the best of your ability.You can lessen your body and spray a particular part of the cell to move faster. Use the W key and your cell's mass is thrown out toward the cursor. This is a great way to raise your speed in the game.You cannot eat a cell that is the same size as you. You can only attack those who are smaller than you. Make your attack when you are sure you are big enough to attack someone.Game ModesAgar.io provides five different game modes to its players. You can add a difference to your gaming experience by trying other modes.FFA (Free For All): You are on your all against other players in the game.Battle Royale: The area will be narrowed at certain intervals in this mode. If you stay out, you lose.Teams: There are blue, green and red teams in this mode. You and your team can work together to control the map by beating the other two teams.Experimental: It was built to allow the original developer to test new features. In this mode, players may experience some new mechanics.Party: This mode is for you to play with your friends. Create a room or join the one that your friend created.More Games Like ThisIf you enjoy playing Agar.io, check on io Games tag or go directly to Paper io 2 and Void City io on OnlineGames.io.This article was updated on October 21, 20232DActionArenaAvoidFreeio GamesMultiplayer",
  "extractedAt": "2025-06-10T05:33:07.391Z",
  "localThumbnail": "Agar.io_1749533587392.jpg"
}