{
  "url": "https://www.onlinegames.io/american-touchdown/",
  "title": "American Touchdown",
  "category": "/t/2-player/",
  "thumbnail": "https://www.onlinegames.io/media/posts/545/American-Touchdown-Game.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/545/American-Touchdown-Game.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/545/responsive/American-Touchdown-Game-xs.jpg 384w, https://www.onlinegames.io/media/posts/545/responsive/American-Touchdown-Game-sm.jpg 600w, https://www.onlinegames.io/media/posts/545/responsive/American-Touchdown-Game-md.jpg 768w, https://www.onlinegames.io/media/posts/545/responsive/American-Touchdown-Game-lg.jpg 1200w",
    "alt": "American Touchdown Free Online Game",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2021/unity3/american-touchdown/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "How to Play American Touchdown"
      },
      {
        "type": "h3",
        "text": "Gameplay of American Touchdown"
      },
      {
        "type": "h3",
        "text": "Can I play American Touchdown with a friend?"
      },
      {
        "type": "h3",
        "text": "How can I take the ball away from my opponent in the most effective way?"
      },
      {
        "type": "h3",
        "text": "What does touchdown mean in football?"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Similar Ball Games"
      }
    ],
    "controls": [
      "1 Player",
      "Use the A, D and W keys to move the character.",
      "2 Player",
      "Use the left, right and upper arrow keys to move the second character."
    ],
    "howToPlay": "Take the ball in your hand and move towards the other side's goal. Your character's arms will be moving automatically. Therefore, when it is in your opponent's hands, in order to receive it, approach the ball carefully and make sure your arms are in a suitable position. Skillfully maneuver your character's automatic moves and get the scores!",
    "tips": "",
    "developer": "",
    "similarGames": [
      {
        "title": "Tap Tap Shots",
        "url": "https://www.onlinegames.io/tap-tap-shots/"
      },
      {
        "title": "Football Legends",
        "url": "https://www.onlinegames.io/football-legends/"
      }
    ]
  },
  "fullContent": "Home› SportsAmerican TouchdownBy OnlineGames.ioMake Game Full ScreenAmerican Touchdown is a 2 player ball game where you try to carry the ball to the opponent's side. If the ball is in your opponent's hand, you need to carefully approach him and take it from his hand. Of course, your hands must be in a suitable position to receive the ball. This match will be fascinating!How to Play American TouchdownTake the ball in your hand and move towards the other side's goal. Your character's arms will be moving automatically. Therefore, when it is in your opponent's hands, in order to receive it, approach the ball carefully and make sure your arms are in a suitable position. Skillfully maneuver your character's automatic moves and get the scores!Gameplay of American TouchdownThe game starts with a countdown. Afterward, you are now face-to-face with your opponent on the field. Your character's arms move automatically, and the character jumps on its own. The game is all about controlling these movements. Master how to take possession of the ball and win matches.Can I play American Touchdown with a friend?If you want, you can play American Touchdown with a friend. It has a two-player mode. Select \"2 Players\" from the main menu and play the game for two. Take your friend against you and have a head-to-head match!How can I take the ball away from my opponent in the most effective way?Both characters have automatic moves. Both of their arms move automatically, and they jump automatically while moving. In order to receive the ball, you must approach your opponent carefully, and the direction of your arms must be precisely in line with the ball.What does touchdown mean in football?In American football, if a player manages to reach the opponent's end zone with the ball, this is called a touchdown.Controls1 PlayerUse the A, D and W keys to move the character.2 PlayerUse the left, right and upper arrow keys to move the second character.Similar Ball GamesIf you love playing American Touchdown, we have other options for you. You may try Tap Tap Shots, where you try to send the balls to the basket. It is a one-button basketball game that you can enjoy playing. Or, you may give a chance to Football Legends. It offers you prominent football clubs and famous footballers to play with. You may also view the ball games tag on OnlineGames.io.Embed URL:https://www.onlinegames.io/games/2021/unity3/american-touchdown/index.htmlThis article was updated on December 27, 20232 Player2DArenaBallEmbeddableFreePixelSportsUnity",
  "extractedAt": "2025-06-10T05:36:32.731Z",
  "localThumbnail": "American Touchdown_1749533792732.jpg"
}