{
  "url": "https://www.onlinegames.io/among-impostor/",
  "title": "Among Impostor",
  "category": "/new-games/",
  "thumbnail": "https://www.onlinegames.io/media/posts/472/Among-Impostor.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/472/Among-Impostor.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/472/responsive/Among-Impostor-xs.jpg 384w, https://www.onlinegames.io/media/posts/472/responsive/Among-Impostor-sm.jpg 600w, https://www.onlinegames.io/media/posts/472/responsive/Among-Impostor-md.jpg 768w, https://www.onlinegames.io/media/posts/472/responsive/Among-Impostor-lg.jpg 1200w",
    "alt": "Among Impostor Play Online",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2023/construct/234/among-impostor/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "How to Play Among Impostor?"
      },
      {
        "type": "h2",
        "text": "Tips for the Impostor"
      },
      {
        "type": "h2",
        "text": "Among Impostor Elements"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Similar Games"
      }
    ],
    "controls": [
      "WASD or the Arrow keys: to move your characterSpacebar: to attack a crewmateYou can also use your cursor to move and left-click to attack"
    ],
    "howToPlay": "The crewmates mind their business and try to complete missions.Your aim is to prevent the crew from performing tasks. But no one knows that you are there to raise the devil.Act friendly and attempt to isolate crewmates in separate rooms. Keep an eye out to see if anyone is approaching. When you see an open window, make your move.To attack a crewmate, click on the sword icon.You can only see the sword icon when you draw near them.After the initial attack, eliminate all evidence.To clear the evidence, hit the shovel icon. Sweep all the evidence and clean up the room before anyone sees it. Repeat the process until bot a single crewmate is left.",
    "tips": "Watch the progress bar above crewmates on duty. You should stop them before they complete the mission.You should make your moves when anyone is not watching you. In this fictional setting, it is much easier to catch the victim alone in the room to keep the crime undercover. It might not be possible since the crowd will increase as you level up. If you are going to attack a crewmate when you are not alone with them, you should ensure that everybody turns their back on you and cannot see what happens in the room.If anyone sees you attacking, you will be reported and fail the level.The crew will report you if they see a dead body, as well. So, erase all the traces.If you cannot find a perfect time to attack in a crowded room, you may build walls by hitting the red button. It will be visible in later levels.",
    "developer": "",
    "similarGames": [
      {
        "title": "Mini Nova Shooters",
        "url": "https://www.onlinegames.io/mini-nova-shooters/"
      },
      {
        "title": "Bob the Robber",
        "url": "https://www.onlinegames.io/bob-the-robber/"
      }
    ]
  },
  "fullContent": "Home› ActionAmong ImpostorBy OnlineGames.ioMake Game Full Screen Among Impostor is an exciting web browser game inspired by the popular multiplayer deception game Among Us. In this thrilling experience, you will be part of a crew. All the crewmates are busy diligently completing their tasks. But here is the twist: someone is there to kick it up a notch. You are among them to sabotage their efforts. The aim is to eliminate the crewmates without leaving any evidence. Only the victims should know what you did. But no one else should witness it. You will be an impostor in this game. You must act stealthily. Hit the button, and let's see how far you can go without any of the mates noticing that you are faking.How to Play Among Impostor?The crewmates mind their business and try to complete missions.Your aim is to prevent the crew from performing tasks. But no one knows that you are there to raise the devil.Act friendly and attempt to isolate crewmates in separate rooms. Keep an eye out to see if anyone is approaching. When you see an open window, make your move.To attack a crewmate, click on the sword icon.You can only see the sword icon when you draw near them.After the initial attack, eliminate all evidence.To clear the evidence, hit the shovel icon. Sweep all the evidence and clean up the room before anyone sees it. Repeat the process until bot a single crewmate is left.Tips for the ImpostorWatch the progress bar above crewmates on duty. You should stop them before they complete the mission.You should make your moves when anyone is not watching you. In this fictional setting, it is much easier to catch the victim alone in the room to keep the crime undercover. It might not be possible since the crowd will increase as you level up. If you are going to attack a crewmate when you are not alone with them, you should ensure that everybody turns their back on you and cannot see what happens in the room.If anyone sees you attacking, you will be reported and fail the level.The crew will report you if they see a dead body, as well. So, erase all the traces.If you cannot find a perfect time to attack in a crowded room, you may build walls by hitting the red button. It will be visible in later levels.Among Impostor ElementsSword: A sword icon will only pop up when you are close enough to a crewmate. Click on the icon to take out him. Shovel: The Impostor should clear the crime scene to prevent other crewmates from seeing it. Click on the shovel icon after attacking.  Grid: Grids are a great way to pass from one room to another immediately. Go near the grid and click on it.Red Button: If you need to be alone with a crewmate in a room, pushing a red button will create walls around you. Outfit: Hit the outfit button at the bottom right of the screen to wear crazy hats. You can buy it with the cash you earned after each elimination.Weapon: Your sword may lose its sharpness or become dull after a point. Press the weapon icon on the bottom left to buy new weapons. You can even buy a lightsaber.ControlsWASD or the Arrow keys: to move your characterSpacebar: to attack a crewmateYou can also use your cursor to move and left-click to attackSimilar GamesDon't miss Mini Nova Shooters, an online shooting game allowing mini shooters to destroy each other on a larger map. Protect your home and be the Ultimate Nova Shooter. This game is perfect for fans of Among Us. If you like shady operations and being on tiptoe, try being a sneaky thief in Bob the Robber.For further options, browse our free action games on OnlineGames.io by following the link.We'd love to hear your thoughts on \"Among Impostor.\" Please share your feedback in the comments section below.Embed URL:https://www.onlinegames.io/games/2023/construct/234/among-impostor/index.htmlThis article was updated on February 6, 20243DActionAvoidCrazyEmbeddableFreeMobileMouse",
  "extractedAt": "2025-06-10T06:21:03.037Z",
  "localThumbnail": "Among Impostor_1749536463038.jpg"
}