{
  "url": "https://www.onlinegames.io/apocalypse-truck/",
  "title": "Apocalypse Truck",
  "category": "/t/car/",
  "thumbnail": "https://www.onlinegames.io/media/posts/1015/apocalypse-truck.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/1015/apocalypse-truck.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/1015/responsive/apocalypse-truck-xs.jpg 384w, https://www.onlinegames.io/media/posts/1015/responsive/apocalypse-truck-sm.jpg 600w, https://www.onlinegames.io/media/posts/1015/responsive/apocalypse-truck-md.jpg 768w, https://www.onlinegames.io/media/posts/1015/responsive/apocalypse-truck-lg.jpg 1200w",
    "alt": "Apocalypse Truck Online Game",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://cloud.onlinegames.io/games/2021/1/apocalypse-truck/index-og.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "How to Play Apocalypse Truck"
      },
      {
        "type": "h2",
        "text": "Features"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "Other Zombie Games Online You’ll Enjoy"
      }
    ],
    "controls": [
      "Arrow keys / WASD: Drive and balance your truckMouse: Tap through menus or select levelsMobile players can use touch buttons to control the truck."
    ],
    "howToPlay": "Start by selecting the first level on the locked map. Levels unlock as you progress.Your goal is to reach the finish line without losing all your health.Use the arrow keys to accelerate and balance your truck on rough terrain. Jump the car using the up arrow or W key.Zombies will be in your way; run them over for fun and coin rewards.Perform front or back flips during big jumps to earn 3 bonus coins for each one.If your truck lands upside down and stays flipped, your health bar drains fast. Don’t panic; press the up arrow and maneuver to flip back quickly!Gather coins on the road. These coins let you unlock cooler and stronger trucks from the garage.Replay levels to collect more coins and master your flips.",
    "tips": "",
    "developer": "Apocalypse Truck is developed by FreezeNova. They’re known for making fast and fun games that play great in your browser.",
    "similarGames": []
  },
  "fullContent": "Home› TruckApocalypse TruckBy OnlineGames.ioMake Game Full ScreenWhen the virus hit, cities crumbled, people vanished. The world went silent except for the groans of the undead. You’re one of the few survivors of zombie apocalypse. Your only hope is a beat-up monster truck, with some spikes, plates, and just enough horsepower to push through the zombie chaos. This is your last chance to escape the city ruins. Fuel up, slam the pedal, and drive through waves of the undead in this thrilling side-scrolling zombie survival game!Apocalypse Truck is a 2D driving game where you roam in a post apocalypse town, run over zombies and race to the finish line. Besides surviving the zombie apocalypse with wheels, spikes you will also launch off wrecked cars, perform mid air flips and and grab coins as you go. Are you into monster truck flips? Destruction? Flattening some zombies? Ok, don't wait! Start playing this fun game on our browser.ControlsArrow keys / WASD: Drive and balance your truckMouse: Tap through menus or select levelsMobile players can use touch buttons to control the truck.How to Play Apocalypse TruckStart by selecting the first level on the locked map. Levels unlock as you progress.Your goal is to reach the finish line without losing all your health.Use the arrow keys to accelerate and balance your truck on rough terrain. Jump the car using the up arrow or W key.Zombies will be in your way; run them over for fun and coin rewards.Perform front or back flips during big jumps to earn 3 bonus coins for each one.If your truck lands upside down and stays flipped, your health bar drains fast. Don’t panic; press the up arrow and maneuver to flip back quickly!Gather coins on the road. These coins let you unlock cooler and stronger trucks from the garage.Replay levels to collect more coins and master your flips.FeaturesPost-apocalyptic side-scrolling actionWaves of zombies to crush under your tires30+ levels5 brutal trucks in garageFlip bonus mechanicTruck health bar systemDeveloperApocalypse Truck is developed by FreezeNova. They’re known for making fast and fun games that play great in your browser.Other Zombie Games Online You’ll EnjoyIf you loved running over zombies in Apocalypse Truck, it’s time to switch gears and try a slower but deadlier style. Try Zombie Sniper. In this 2D shooting game, you take your position on a rooftop with a sniper rifle and aim for zombie heads. Each shot needs to be perfect. With 30 levels of zombie action, it’s a different kind of zombie game online!Embed URL:https://cloud.onlinegames.io/games/2021/1/apocalypse-truck/index-og.htmlThis article was updated on May 29, 20251 Player2DCarCrazyDrivingEmbeddableFreeRacingTruckZombie",
  "extractedAt": "2025-06-10T05:19:59.246Z",
  "localThumbnail": "Apocalypse Truck_1749532799246.jpg"
}