{
  "url": "https://www.onlinegames.io/archery-master/",
  "title": "Archery Master",
  "category": "/new-games/",
  "thumbnail": "https://www.onlinegames.io/media/posts/422/Archery-Master.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/422/Archery-Master.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/422/responsive/Archery-Master-xs.jpg 384w, https://www.onlinegames.io/media/posts/422/responsive/Archery-Master-sm.jpg 600w, https://www.onlinegames.io/media/posts/422/responsive/Archery-Master-md.jpg 768w, https://www.onlinegames.io/media/posts/422/responsive/Archery-Master-lg.jpg 1200w",
    "alt": "Archery Master Play Online",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://html5.gamedistribution.com/af1abb0e560b4023befb6d3e5d47a1d2/?gd_sdk_referrer_url=https://www.onlinegames.io/archery-master",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "How to play Archery Master?"
      },
      {
        "type": "h2",
        "text": "Game Modes"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Similar Games"
      }
    ],
    "controls": [
      "Playing Archery Master is very simple and fun. All you have to do is tension your bow's arrow with your mouse and send it to the target when it reaches a certain point. To do this, hold down the left mouse button to shoot the pointer, and when the time comes, release it."
    ],
    "howToPlay": "Archery Master has three different game modes of varying difficulty. But they all have the same logic. All you have to do is take the arrow out of the bow to hit the target in the middle as much as possible. Or, at best, to shoot the circles closest to the midpoint. The closer you send your arrow to the middle point, the yellow zone, the higher your score will be. As you send arrows, you will get closer or further away from the target board with each shot. This is one of the challenges of the game. Your distance to the target will keep changing.\n\nFrom the upper right corner of the screen, you can closely see where you sent your arrow and how many points the place you sent the arrow brought you.You can see the number of arrows in the screen's upper left corner.The game only gives you five arrows at the beginning. When you run out of darts, your game is over. If you can not hit the arrow on the target, you will lose one of your arrows. If the dart you shoot lands anywhere outside the yellow area, you neither win nor lose an arrow.For every 10 points you earn, you earn 2 pointers; for every 9 points you get, you get one dart. This means you only deserve extra arrows when you send arrows to the yellow areas.",
    "tips": "",
    "developer": "",
    "similarGames": [
      {
        "title": "Archery Apple Shooter",
        "url": "https://www.onlinegames.io/archery-apple-shooter/"
      }
    ]
  },
  "fullContent": "Home› ArcheryArchery MasterBy OnlineGames.ioMake Game Full ScreenReady your arrows and string your bow! Archery Master is a dart-like sports game where you try to score best by hitting the bull's-eye. Rules are basic. The closer you can shoot the arrow to the center point, the more points you get. What you will need most in this game will be your ability to focus and aim. Enjoy the game!How to play Archery Master?Archery Master has three different game modes of varying difficulty. But they all have the same logic. All you have to do is take the arrow out of the bow to hit the target in the middle as much as possible. Or, at best, to shoot the circles closest to the midpoint. The closer you send your arrow to the middle point, the yellow zone, the higher your score will be. As you send arrows, you will get closer or further away from the target board with each shot. This is one of the challenges of the game. Your distance to the target will keep changing. From the upper right corner of the screen, you can closely see where you sent your arrow and how many points the place you sent the arrow brought you.You can see the number of arrows in the screen's upper left corner.The game only gives you five arrows at the beginning. When you run out of darts, your game is over. If you can not hit the arrow on the target, you will lose one of your arrows. If the dart you shoot lands anywhere outside the yellow area, you neither win nor lose an arrow.For every 10 points you earn, you earn 2 pointers; for every 9 points you get, you get one dart. This means you only deserve extra arrows when you send arrows to the yellow areas.Game Modes​​This game offers three different game modes to diversify your gaming experience.Arcade Mode: This is the simplest mode of the game. All you have to do is get as high a score as possible before running out of arrows.Distance Mode: With each shot you make, your next attempt will be fired from farther in the distance mode. You have seven lives count here. If you miss the shot, you lose a life. In addition to all these, the target board constantly moves from top to bottom, making it harder to hit. A real challenge, right?Time Mode: In this mode, you are given a limited time and collect as many points as possible during this time. Every shot you make gives you extra time. You can see your time bar at the top left of the screen. As in distance mode, the target board also moves from top to bottom.ControlsPlaying Archery Master is very simple and fun. All you have to do is tension your bow's arrow with your mouse and send it to the target when it reaches a certain point. To do this, hold down the left mouse button to shoot the pointer, and when the time comes, release it.Similar GamesArchery Apple Shooter, in which you attempt to shoot the apple on a guy's head with arrows, may appeal to you if you enjoy Archery Master. For more game alternatives, visit Shooting Games tags on OnlineGames.io.This article was updated on December 8, 20231 Player3DArcheryFreePhysicsShooting",
  "extractedAt": "2025-06-10T06:23:50.293Z",
  "localThumbnail": "Archery Master_1749536630294.jpg"
}