{
  "url": "https://www.onlinegames.io/awesome-pirates/",
  "title": "Awesome Pirates",
  "category": "/t/shooting/",
  "thumbnail": "https://www.onlinegames.io/media/posts/678/Awesome-Pirates.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/678/Awesome-Pirates.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/678/responsive/Awesome-Pirates-xs.jpg 384w, https://www.onlinegames.io/media/posts/678/responsive/Awesome-Pirates-sm.jpg 600w, https://www.onlinegames.io/media/posts/678/responsive/Awesome-Pirates-md.jpg 768w, https://www.onlinegames.io/media/posts/678/responsive/Awesome-Pirates-lg.jpg 1200w",
    "alt": "Awesome Pirates Online Game",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2024/flash/awesome-pirates/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "How to Play Awesome Pirates"
      },
      {
        "type": "h3",
        "text": "Face off The Pirates"
      },
      {
        "type": "h3",
        "text": "Enforce Your Fort and Cannon"
      },
      {
        "type": "h3",
        "text": "Sniper Rifle or Angry Cannon"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "More Games"
      }
    ],
    "controls": [
      "Mouse: AimLeft-click: Shoot"
    ],
    "howToPlay": "While you were sitting on the red sand, sipping your drink with pleasure, you saw the awesome pirates in your binoculars. They are coming after you and your treasure. By using their cannonballs, they will try to destroy your fort. You can’t let it happen. As this castle and the treasure are from your grandparents! These are the only memories left of them. Aim at the approaching ships and shoot on them. Send them off to the darkness of the sea in this pirate game!",
    "tips": "",
    "developer": "Awesome Pirates was developed by Alexander Gette.",
    "similarGames": []
  },
  "fullContent": "Home› PirateAwesome PiratesBy OnlineGames.ioMake Game Full ScreenPirates are coming for your fortress! You have to keep it standing tall. Awesome Pirates is a 2D defense game where you must protect your castle and its valuable treasure from vulturous men. They will attack you with their cannons. You will attack them with yours. It is your duty to throw them into the sea in this action game.How to Play Awesome PiratesWhile you were sitting on the red sand, sipping your drink with pleasure, you saw the awesome pirates in your binoculars. They are coming after you and your treasure. By using their cannonballs, they will try to destroy your fort. You can’t let it happen. As this castle and the treasure are from your grandparents! These are the only memories left of them. Aim at the approaching ships and shoot on them. Send them off to the darkness of the sea in this pirate game!Face off The PiratesYou will see that the bad guys are approaching you slowly. You will fire each other in turns with your cannons. The one whose health bar drops to zero is the loser. Try to aim precisely and fire your cannonballs in the most accurate direction. The quicker you send them to the sea, the more coins you earn. Pro tips! You can aim at their cannons. As they will try to fix the cannon, they cannot shoot you in that turn.Enforce Your Fort and CannonUse your in-game currency to get more potent forts and upgrades for your cannon in this action game. In later levels, you will encounter many more pirates. They will outnumber you. So, your belongings must be powerful enough to beat them. Get new cannons, purchase advanced castles and upgrade your weapons from the menu. The seller will even give you a discount.Sniper Rifle or Angry CannonThe seller has many cannon options for you. There are 7 weapons costing from 350 to 4400 coins. The names of the weapons are Shotgun, Basic, Chain-shot, Sniper Rifle, Angry, Explosive, and Controlled Explosion. Each has unique features. For example, the Sniper Rifle will allow you to shoot with precision. On the other hand, Angry Cannon will fire furious cannonballs, causing great damage.ControlsMouse: AimLeft-click: ShootDeveloperAwesome Pirates was developed by Alexander Gette.More GamesIf you enjoy playing Awesome Pirates, you may also try Pirate Adventure. Your mission is to solve the Blackbeard’s riddles in the game. This way, you will find Cristopher’s lost treasure.For more options, you may look up other online pirate games on OnlineGames.io. You can access them whenever you want without requiring any registration. In addition, we want to hear from you! Please share your gaming experiences with us in the comment section below.This article was updated on July 8, 20241 Player2DActionBattleBoatCrazyDestroyFlashFreeMobileMousePirateShootingWarWeapon",
  "extractedAt": "2025-06-10T05:42:37.944Z",
  "localThumbnail": "Awesome Pirates_1749534157945.jpg"
}