{
  "url": "https://www.onlinegames.io/backrooms-shooter/",
  "title": "Backrooms Shooter",
  "category": "/t/shooting/",
  "thumbnail": "https://www.onlinegames.io/media/posts/796/Backrooms-Shooter.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/796/Backrooms-Shooter.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/796/responsive/Backrooms-Shooter-xs.jpg 384w, https://www.onlinegames.io/media/posts/796/responsive/Backrooms-Shooter-sm.jpg 600w, https://www.onlinegames.io/media/posts/796/responsive/Backrooms-Shooter-md.jpg 768w, https://www.onlinegames.io/media/posts/796/responsive/Backrooms-Shooter-lg.jpg 1200w",
    "alt": "Backrooms Shooter Play Online",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2024/gm/games5/backrooms-shooter/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "How to Play Backrooms Shooter"
      },
      {
        "type": "h3",
        "text": "Exit Signs"
      },
      {
        "type": "h3",
        "text": "Shoot the Barrels"
      },
      {
        "type": "h2",
        "text": "Change Weapons"
      },
      {
        "type": "h2",
        "text": "Other Games Like Backrooms Shooter"
      }
    ],
    "controls": [
      "WASD or Arrow Keys: MoveLeft-Click: ShootRight-Click: AimSpace Key: JumpLeft-Shift Key: RunT Key: Slow MotionR Key: ReloadG Key: GrenadeV Key: MeleeTab Key: PauseMouse Scroll: Switch Weapons"
    ],
    "howToPlay": "Trapped in backrooms, find your way through the exit. Dozens of skibidis are attacking you. Shoot 'em all coming along your way. Check all the rooms to find the exit.Every time you find an exit, you'll level up, unlock new weapons and face with new challenges. Happy flushing!",
    "tips": "",
    "developer": "Backrooms Shooter was developed by G55.",
    "similarGames": []
  },
  "fullContent": "Home› Skibidi ToiletBackrooms ShooterBy OnlineGames.ioMake Game Full ScreenWake up and find yourself in the backrooms of an abandoned hotel. You hear your own breath in the mask and that bloody weird song again. As you regain your senses, you remember everything: After Skibidi toilets go crazy and take over the hotel, you entered with your squad to save this place from toilet heads. With a kick to your head from a skibidi, you must have passed out. And now, your team has left, probably thinking you are already dead. You are the only one left in this scary place except for all the Skibidis running around. Get up; you must find the exit and escape this hell!Backrooms Shooter is 3D third person shooter game where players escape from a maze-like setting and shoot skibidis coming along the way.ControlsWASD or Arrow Keys: MoveLeft-Click: ShootRight-Click: AimSpace Key: JumpLeft-Shift Key: RunT Key: Slow MotionR Key: ReloadG Key: GrenadeV Key: MeleeTab Key: PauseMouse Scroll: Switch WeaponsDeveloperBackrooms Shooter was developed by G55.How to Play Backrooms ShooterTrapped in backrooms, find your way through the exit. Dozens of skibidis are attacking you. Shoot 'em all coming along your way. Check all the rooms to find the exit.Every time you find an exit, you'll level up, unlock new weapons and face with new challenges. Happy flushing!Exit SignsYou will encounter green exit indicators as you navigate through rooms. While you feel completely lost in backrooms, locating the exit door will help you out. Follow the signs to find the exit.Shoot the BarrelsYou'll see barrels in scattered around. They are filled with explosives. Aim for the barrels to eliminate multiple skibidis at once!Change WeaponsUse the mouse scroll to change between weapons. Choose your favorite: shotgun, rifle or melees. As you complete levels, new weapons will be unlocked.Other Games Like Backrooms ShooterIf you like playing these crazy toilet games, take a look at all the Skibidi Toilet games online. Keep the dom dom yes yes spirit alive on OnlineGames.io!Please share your experience with us in the comments section below. Tips, tricks, and suggestions about the best weapons are very appreciated by other gamers!This article was updated on July 9, 20241 Player3DActionBattleCrazyFreeFunGunHorrorShootingSkibidi ToiletUnityWeapon",
  "extractedAt": "2025-06-10T05:41:56.363Z",
  "localThumbnail": "Backrooms Shooter_1749534116362.jpg"
}