{
  "url": "https://www.onlinegames.io/basketball-io/",
  "title": "Basketball io",
  "category": "/t/arcade/",
  "thumbnail": "https://www.onlinegames.io/media/posts/302/Basketball-io-2.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/302/Basketball-io-2.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/302/responsive/Basketball-io-2-xs.jpg 384w, https://www.onlinegames.io/media/posts/302/responsive/Basketball-io-2-sm.jpg 600w, https://www.onlinegames.io/media/posts/302/responsive/Basketball-io-2-md.jpg 768w, https://www.onlinegames.io/media/posts/302/responsive/Basketball-io-2-lg.jpg 1200w",
    "alt": "Play Basketball io for free",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2022/unity3/basketball-io/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Team Players"
      },
      {
        "type": "h2",
        "text": "Balls"
      },
      {
        "type": "h2",
        "text": "Fields"
      },
      {
        "type": "h2",
        "text": "How to Play Basketball io?"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "More Games Like This"
      }
    ],
    "controls": [
      "WASD or arrow keys to move across the fieldUse your cursor to switch between menusEsc to pause the game"
    ],
    "howToPlay": "Hit the start button to begin the match immediately.Use arrow keys to move around in the field.Go over the player with the ball to steal it.Run beyond the free throw line to slam dunk.Customize the players, balls, and courts in the shop section.",
    "tips": "",
    "developer": "",
    "similarGames": []
  },
  "fullContent": "Home› BasketballBasketball ioBy OnlineGames.ioMake Game Full Screen Want to play a Basketball Game but tired of complicated controls? Basketball io is an exciting online basketball game with simple controls but awesome 3D visuals. You will be fascinated by the slam dunks of players. Customize your team according to your style. Choose a field you like: a classic basketball field with a grandstand, an outdoor street basketball court, or play on the beach next to the palms.You will receive stars and diamonds based on your playing style if you win five matches. Achieving a high rank will also allow you to purchase items from the shop section.Team PlayersYou'll be surprised by the range of players you can play. Open the shop to select the style of your team. You can have a team of NBA players, cheerleader girls, skeletons, monsters, and even bears. If you are wondering how it would look if bears could play basketball, you should try bearball. BallsYou can buy 10 different types of balls with diamonds you earned. You can also obtain them by completing some tasks in the game. For example, you must steal the ball from your opponent 50 times to get the rainbow ball. You can even play with a fireball if you'd like. Pick one to your liking and enjoy juggling your new ball.FieldsThere are 4 different fields where you can play Basketball io. Indoor basketball courtStreetball courtBeach basketball fieldThe private court in the forestHow to Play Basketball io?Hit the start button to begin the match immediately.Use arrow keys to move around in the field.Go over the player with the ball to steal it.Run beyond the free throw line to slam dunk.Customize the players, balls, and courts in the shop section. ControlsWASD or arrow keys to move across the fieldUse your cursor to switch between menusEsc to pause the gameMore Games Like ThisIf you like Basketball io, you can try our other Basketball Games.Embed URL:https://www.onlinegames.io/games/2022/unity3/basketball-io/index.htmlThis article was updated on May 9, 20243DArcadeArenaBallBasketballEmbeddableFreeFunio GamesSimulatorSports",
  "extractedAt": "2025-06-10T05:14:56.216Z",
  "localThumbnail": "Basketball io_1749532496217.jpg"
}