{
  "url": "https://www.onlinegames.io/basket-hoop/",
  "title": "Basket Hoop",
  "category": "/t/sports/",
  "thumbnail": "https://www.onlinegames.io/media/posts/843/Basket-Hoop.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/843/Basket-Hoop.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/843/responsive/Basket-Hoop-xs.jpg 384w, https://www.onlinegames.io/media/posts/843/responsive/Basket-Hoop-sm.jpg 600w, https://www.onlinegames.io/media/posts/843/responsive/Basket-Hoop-md.jpg 768w, https://www.onlinegames.io/media/posts/843/responsive/Basket-Hoop-lg.jpg 1200w",
    "alt": "Basket Hoop Play Online",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://cloud.onlinegames.io/games/2024/construct/311/basket-hoop/index-og.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "How to Play Basket Hoop"
      },
      {
        "type": "h3",
        "text": "Ball Shop"
      },
      {
        "type": "h2",
        "text": "Tips and Tricks"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "Compatibility"
      },
      {
        "type": "h2",
        "text": "More Online Sports Games"
      }
    ],
    "controls": [
      "Computer:",
      "Use your mouse to shoot the ball.",
      "Mobile:",
      "Tap to shoot the ball"
    ],
    "howToPlay": "Tap or click on anywhere on the screen to dunk the ball.You can jump the ball mid-air as well. Control the angle to land the ball in the hoop.You have 5 seconds to make a score. If you miss a score within the time limit, the ball will return from the other side for another chance.Each successful shot will create a new net in a different position for your next attempt.Continue tapping to jump and shoot as many baskets as possible before the time runs out.If you run out of time without scoring enough baskets, restart and aim to beat your personal best!",
    "tips": "Pay close attention to the rhythm of your taps. Timing is key to making those perfect shots! At the beginning of the game you'll see the pathway the ball should follow for perfect shots. Try to stick with that path for high scores.Try out different balls from the Ball Shop. Each type has its unique speed and trajectory, which can help you find the best fit for your playstyle.Unlock new fields that comes with extra time limit. Even though you have five seconds to perform the dunk in the default field, you can unlock 5 more fields that come with extra seconds. Beating high scores will be much easier when you have more time.   Try to chain successful baskets together (streaks) for bonus points. The faster you score, the more points you'll rack up!",
    "developer": "Basket Hoop was created by FreezeNova.",
    "similarGames": []
  },
  "fullContent": "Home› BasketballBasket HoopBy OnlineGames.ioMake Game Full ScreenIn Basket Hoop, gravity is your only challenge, and tapping is your sole weapon. Your goal is simple make the ball jump and send it inside the hoop. The charm of the one button games peaks in Basket Hoop online. Make as many baskets as you can in a limited amount of time. This game brings the same joy of playing Skeeball in arcade rooms, but with an extra: longer play sessions than you'd get with a single token.ControlsComputer:Use your mouse to shoot the ball.Mobile:Tap to shoot the ballHow to Play Basket HoopTap or click on anywhere on the screen to dunk the ball.You can jump the ball mid-air as well. Control the angle to land the ball in the hoop.You have 5 seconds to make a score. If you miss a score within the time limit, the ball will return from the other side for another chance.Each successful shot will create a new net in a different position for your next attempt.Continue tapping to jump and shoot as many baskets as possible before the time runs out.If you run out of time without scoring enough baskets, restart and aim to beat your personal best!Ball ShopWe know the game name is \"Basket Hoop\" and it takes place in a basketball field, but that doesn't mean you have to stick with a traditional ball! Explore the Ball Shop by tapping on the shop icon. You'll find 27 unlockable balls. From tennis balls and volleyballs to golf balls and Pokéballs, there's a wide range of choices that offer faster gameplay than the default ball. Use your in-game coins to purchase these unique options and complete your collection.Tips and TricksPay close attention to the rhythm of your taps. Timing is key to making those perfect shots! At the beginning of the game you'll see the pathway the ball should follow for perfect shots. Try to stick with that path for high scores.Try out different balls from the Ball Shop. Each type has its unique speed and trajectory, which can help you find the best fit for your playstyle.Unlock new fields that comes with extra time limit. Even though you have five seconds to perform the dunk in the default field, you can unlock 5 more fields that come with extra seconds. Beating high scores will be much easier when you have more time.   Try to chain successful baskets together (streaks) for bonus points. The faster you score, the more points you'll rack up!DeveloperBasket Hoop was created by FreezeNova.CompatibilityBasket Hoop is perfectly compatible with mobile phones including iOS and Android. However if you'd like to play the game in portrait mode on your mobile, then try Tap Tap Shots.More Online Sports GamesLooking for even more fun? We got your back, take a look at the other sports games on Online Games.io! Soccer, football, tennis, pool and many other sports games await you!Embed URL:https://cloud.onlinegames.io/games/2024/construct/311/basket-hoop/index-og.htmlThis article was updated on January 28, 20251 Player2DBallBasketballEmbeddableEndlessFreeHTML5MobileMousePhysicsSkillSports",
  "extractedAt": "2025-06-10T05:52:35.397Z",
  "localThumbnail": "Basket Hoop_1749534755397.jpg"
}