{
  "url": "https://www.onlinegames.io/basket-champs/",
  "title": "Basket Champs",
  "category": "/t/arcade/",
  "thumbnail": "https://www.onlinegames.io/media/posts/767/Basket-Champs-Game.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/767/Basket-Champs-Game.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/767/responsive/Basket-Champs-Game-xs.jpg 384w, https://www.onlinegames.io/media/posts/767/responsive/Basket-Champs-Game-sm.jpg 600w, https://www.onlinegames.io/media/posts/767/responsive/Basket-Champs-Game-md.jpg 768w, https://www.onlinegames.io/media/posts/767/responsive/Basket-Champs-Game-lg.jpg 1200w",
    "alt": "Basket Champs Play Online",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2024/more/basket-champs/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "How to Play Basket Champs"
      },
      {
        "type": "h3",
        "text": "Take Extra Shots!"
      },
      {
        "type": "h3",
        "text": "Doge is On Your Side"
      },
      {
        "type": "h3",
        "text": "Watch Out For Moving Hoops"
      },
      {
        "type": "h3",
        "text": "Understanding Arrows"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "More Basketball Games"
      }
    ],
    "controls": [
      "Move your mouse to adjust the angle and speedLeft-click to throw the ball"
    ],
    "howToPlay": "At the beginning, choose the national team you'd like to represent.Twenty teams, including the US, UK, Australia, France, and Turkey, are available for the tournament.When the match starts, the ball will appear in random places on the court. Adjust the angle and speed, then throw the ball.Both you and your rival will take five free throws in turns.Score more than your opponent to win the match.Your first aim is to win at least 3 games to qualify out of the group.You'll play 4 matches in the group stage.If you win 3 matches in the group, you'll advance to the quarter-finals. Eliminate other teams one by one to reach the championship match.",
    "tips": "",
    "developer": "RavalMatic created Basket Champs.",
    "similarGames": []
  },
  "fullContent": "Home› BasketballBasket ChampsBy OnlineGames.ioMake Game Full ScreenBasket Champs, an online basketball game, is designed to test players' precision skills. In each match, you have 5 free throws to outscore your rival team. Step into the tournament, prove your skills, qualify out of the group, and earn your spot in the championship match!ControlsMove your mouse to adjust the angle and speedLeft-click to throw the ballHow to Play Basket ChampsAt the beginning, choose the national team you'd like to represent.Twenty teams, including the US, UK, Australia, France, and Turkey, are available for the tournament.When the match starts, the ball will appear in random places on the court. Adjust the angle and speed, then throw the ball.Both you and your rival will take five free throws in turns.Score more than your opponent to win the match.Your first aim is to win at least 3 games to qualify out of the group.You'll play 4 matches in the group stage.If you win 3 matches in the group, you'll advance to the quarter-finals. Eliminate other teams one by one to reach the championship match.Take Extra Shots!If the match ends in a tie, each team will be given one extra shot, known as sudden death.This shot requires more precision and timing than any other in the game. Score it to see the smiles on your supporters' faces.Doge is On Your SideFrom time to time, you may see Doge on the screen cheering you on!It will say affirmations like \"Amaze!\" adding fun and humor to the game.Watch Out For Moving HoopsAs you progress in Basket Champs, you'll face hoops that move up and down and forward and backward. Take a deep breath and aim for the shooter's box calmly!Understanding ArrowsBefore throwing the ball, you can see where and how fast you're aiming. Look at the arc on the screen. If it's long, the ball will be thrown very fast. If it's too short, the ball may not reach the hoop.You'll soon understand and enjoy the fun physics of Basket Champs.DeveloperRavalMatic created Basket Champs.More Basketball GamesBasket Champs is not your only option when it comes to online basketball games. Explore other alternatives and find your next favorite sports game, including titles with both casual gameplay and more realistic 3D graphics.If you have any questions about gameplay, Gamie will be in the comments section to help. You can also share your thoughts, best scores, or anything else you want there. This article was updated on June 12, 20241 Player2DArcadeBallBasketballFreeHTML5MobileMousePhysicsSports",
  "extractedAt": "2025-06-10T05:18:47.688Z",
  "localThumbnail": "Basket Champs_1749532727688.jpg"
}