{
  "url": "https://www.onlinegames.io/basket-random/",
  "title": "Basket Random",
  "category": "/t/arcade/",
  "thumbnail": "https://www.onlinegames.io/media/posts/651/Basket-Random.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/651/Basket-Random.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/651/responsive/Basket-Random-xs.jpg 384w, https://www.onlinegames.io/media/posts/651/responsive/Basket-Random-sm.jpg 600w, https://www.onlinegames.io/media/posts/651/responsive/Basket-Random-md.jpg 768w, https://www.onlinegames.io/media/posts/651/responsive/Basket-Random-lg.jpg 1200w",
    "alt": "Basket Random Free Online Game",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://html5.gamedistribution.com/bf1268dccb5d43e7970bb3edaa54afc8/?gd_sdk_referrer_url=https://www.onlinegames.io/basket-random",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "How to Play Basket Random"
      },
      {
        "type": "h3",
        "text": "The Dunker or The Defender"
      },
      {
        "type": "h3",
        "text": "Game Modes in Basket Random"
      },
      {
        "type": "h3",
        "text": "Changing Environments and Physics"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "What is More?"
      }
    ],
    "controls": [
      "Player 1: W KeyPlayer 2: Upper Arrow Key"
    ],
    "howToPlay": "There will be two teams in a match, and each team will have two members.Controlling the player will be the utmost challenge, as you can only use one key to control the stickman.You can not easily guess which way the character will move. But once you learn to control your man, no one can beat you anymore!When you get the ball, try to dunk it directly to the opposite side's hoop without losing it.The one who gets the five scores wins the game.",
    "tips": "",
    "developer": "Basket Random was developed by RHM Interactive.",
    "similarGames": []
  },
  "fullContent": "Home› 2 PlayerBasket RandomBy OnlineGames.ioMake Game Full ScreenBasket Random is a pixelated arcade game where you participate in basketball games online against the CPU or a friend. The basketball players have limited mobility. Direct your character with only one key and perform the most dunks to the hoops to win. Basket Random will give you great pleasure with changing characters and environments as one of the most favorable sports games!How to Play Basket RandomThere will be two teams in a match, and each team will have two members.Controlling the player will be the utmost challenge, as you can only use one key to control the stickman.You can not easily guess which way the character will move. But once you learn to control your man, no one can beat you anymore!When you get the ball, try to dunk it directly to the opposite side's hoop without losing it.The one who gets the five scores wins the game.The Dunker or The DefenderEach team consists of two players: a dunker and a defender. With each of your moves, you actually move both players. To shoot baskets, use the dunker player, as he will be closer to the rival's hoop. He can also easily grab the ball from the opponents.The defender is responsible for guarding the hoop. He is behind the dunker. He must prevent opponents from scoring a goal.Game Modes in Basket RandomThe game offers you two game modes: 1 Player and 2 Player.1P mode will create a match against the computer. Don't underestimate the CPU, as it will test your basketball skills extremely.On the other hand, if you want to challenge yourself with a friend, you can play in the 2P mode. It's always fun to play with a buddy. Make your selections from the menu according to your desires.Changing Environments and PhysicsEach time you or your opponent scores a basket, the players' uniform and playing field will change. You will engage in matches with different themes, such as a snowy scene or a sandy beach. The players will wear suits or basic basketball uniforms from time to time. Even the ball will have different shapes.For example, the iron ball will make it harder for you to make precise dunks. In contrast, the light ball can get out of control quickly. Players' arms and hoops can randomly lengthen or shorten, as well.ControlsPlayer 1: W KeyPlayer 2: Upper Arrow KeyDeveloperBasket Random was developed by RHM Interactive.What is More?If you enjoy playing Basket Random, you may also try Basketball Slam Dunk. The players' arms will fly in the air in the game. Control the arms before they intertwine, and try to score as many as possible!For further options, you may look for other basketball games for free on OnlineGames.io. Keep coming back to explore new and thrilling games. Making new discoveries with free browser games at Online Games is very easy.This article was updated on May 9, 20242 Player2DArcadeArenaBallBasketballCrazyFreeFunHTML5MobilePhysicsPixelSports",
  "extractedAt": "2025-06-10T05:13:26.166Z",
  "localThumbnail": "Basket Random_1749532406167.jpg"
}