{
  "url": "https://www.onlinegames.io/bffs-black-friday-collection/",
  "title": "BFFs Black Friday Collection",
  "category": "/t/html5/",
  "thumbnail": "https://www.onlinegames.io/media/posts/873/bffs-black-friday-game.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/873/bffs-black-friday-game.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/873/responsive/bffs-black-friday-game-xs.jpg 384w, https://www.onlinegames.io/media/posts/873/responsive/bffs-black-friday-game-sm.jpg 600w, https://www.onlinegames.io/media/posts/873/responsive/bffs-black-friday-game-md.jpg 768w, https://www.onlinegames.io/media/posts/873/responsive/bffs-black-friday-game-lg.jpg 1200w",
    "alt": "BFFs Black Friday Collection Play Online",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2024/jul2/bffs-black-friday-collection/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "How to Play BFFs Black Friday Collection"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "More Fashion Games"
      }
    ],
    "controls": [
      "On Computer:",
      "Click and drag clothing items to dress up each girlUse the makeup tools by clicking on them to apply makeupClick on the check mark to confirm their looks",
      "On Mobile:",
      "Tap on clothing and makeup options to dress and style the girlsUse the icons to apply makeupTap the check mark to finish each look"
    ],
    "howToPlay": "Start by choosing one of the six girls to style.Pick out her clothes from a variety of outfits.You can mix and match tops, pants, dresses, and accessories.Next, hairstyles! Choose from different hairstyles from French braids to buns and more.Once you're done with one girl, move on to the next!After styling all the girls, they'll be ready to head to the mall and enjoy their Black Friday shopping spree!",
    "tips": "",
    "developer": "BFFs Black Friday Collection game was created by FreezeNova.",
    "similarGames": []
  },
  "fullContent": "Home› GirlBFFs Black Friday CollectionBy OnlineGames.ioMake Game Full ScreenHey girls! The Christmas season has begun already! And we're excited about Black Friday shopping, aren't we? Bustling malls, massive deals, shoppers zigzag with the energy, and the air buzzes with the sound of laughter and \"did you see this?\" Families wheel out carts piled high with bargains, and friends take selfies with giant store decorations. We took this festive frenzy to the virtual world and added the magic of dress-up games!BFFs Black Friday Collection is a fun fashion game where you help six stylish girls prepare for a day of Black Friday shopping. Each girl has her own unique style and personality, so it's up to you to create the perfect outfit and makeup look for each of them. The mall is waiting, and these BFFs are ready to score some amazing deals, but they need your help to look their best!ControlsOn Computer:Click and drag clothing items to dress up each girlUse the makeup tools by clicking on them to apply makeupClick on the check mark to confirm their looksOn Mobile:Tap on clothing and makeup options to dress and style the girlsUse the icons to apply makeupTap the check mark to finish each lookHow to Play BFFs Black Friday CollectionStart by choosing one of the six girls to style.Pick out her clothes from a variety of outfits.You can mix and match tops, pants, dresses, and accessories.Next, hairstyles! Choose from different hairstyles from French braids to buns and more.Once you're done with one girl, move on to the next!After styling all the girls, they'll be ready to head to the mall and enjoy their Black Friday shopping spree!DeveloperBFFs Black Friday Collection game was created by FreezeNova.More Fashion GamesIf you're a fan of dress-up games and enjoy the festive spirit of Thanksgiving, you won't want to miss Ellie's Thanksgiving Day. Join Ellie as she prepares for the perfect Thanksgiving celebration. From choosing stylish outfits for the big day to planning the event from start to finish, you'll help her with everything. Pick out the perfect dress for Ellie, design the invitations, and set up the beautiful Thanksgiving table. You can even decorate the porch to create a cozy welcome. OnlineGames.io is packed with fashion, creativity, and celebration games that capture the fun and joy of special occasions all year round.This article was updated on November 25, 20241 Player2DDress UpFashionFreeGirlHTML5KidsMakeupMobileMouse",
  "extractedAt": "2025-06-10T06:01:57.952Z",
  "localThumbnail": "BFFs Black Friday Collection_1749535317952.jpg"
}