{
  "url": "https://www.onlinegames.io/blob-opera/",
  "title": "Blob Opera",
  "category": "/new-games/",
  "thumbnail": "https://www.onlinegames.io/media/posts/590/Blop-Opera-Gameplay.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/590/Blop-Opera-Gameplay.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/590/responsive/Blop-Opera-Gameplay-xs.jpg 384w, https://www.onlinegames.io/media/posts/590/responsive/Blop-Opera-Gameplay-sm.jpg 600w, https://www.onlinegames.io/media/posts/590/responsive/Blop-Opera-Gameplay-md.jpg 768w, https://www.onlinegames.io/media/posts/590/responsive/Blop-Opera-Gameplay-lg.jpg 1200w",
    "alt": "Blop Opera in NYC",
    "width": 465,
    "height": 266,
    "className": "is-loaded",
    "parentClass": "post__image is-loaded"
  },
  "gameFrame": null,
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "How to Play Blob Opera?"
      },
      {
        "type": "h2",
        "text": "New Cities to Perform"
      },
      {
        "type": "h2",
        "text": "Who created Blob Opera?"
      },
      {
        "type": "h2",
        "text": "Who are the voices of Blob Opera?"
      },
      {
        "type": "h2",
        "text": "What to Play Next?"
      }
    ],
    "controls": [],
    "howToPlay": "You have 4 different opera singers: Bass, Tenor, Mezzo-Soprano and Soprano.To make the Blob sing at a higher pitch, drag them up. For a lower pitch, drag them down.If you'd like them to sing a certain vowel, drag the Blobs left and right. From left to right, you hear their voices making vowel sounds of a, e, i, o, and u, respectively.You can mute one (or more) of the Blobs by hitting on the mute button on the top of their heads.As you are the chef of this little orchestra, Blobs will follow your hand with their eyes. Move your mouse on the screen, and you will enjoy the silly faces of them.There are ready-to-listen songs in Blob Opera, too. Click on the button at the bottom right to listen to Jingle Bells, Joy to the World, and many other songs from Blobs. Who knows, they might inspire you to create a brand-new, excellent piece of art!Remember to record the song you created and share it with your loved ones.",
    "tips": "",
    "developer": "",
    "similarGames": []
  },
  "fullContent": "Home› MusicBlob OperaBy OnlineGames.ioMake Game Full ScreenLadies and Gentlemen! We introduce you to the best choir of all time. Meet the Blobs! An extremely talented opera choir who are able to sing any song you'd like with great harmony!Blob Opera is an experimental music game that allows you to create and play your own songs in your web browser.Blobs are so talented that they can sing any song, but it is not limited to that. They look so hilarious that you can even watch them breathe, each at their own speed, when they are silent.How to Play Blob Opera?You have 4 different opera singers: Bass, Tenor, Mezzo-Soprano and Soprano.To make the Blob sing at a higher pitch, drag them up. For a lower pitch, drag them down.If you'd like them to sing a certain vowel, drag the Blobs left and right. From left to right, you hear their voices making vowel sounds of a, e, i, o, and u, respectively.You can mute one (or more) of the Blobs by hitting on the mute button on the top of their heads.As you are the chef of this little orchestra, Blobs will follow your hand with their eyes. Move your mouse on the screen, and you will enjoy the silly faces of them.There are ready-to-listen songs in Blob Opera, too. Click on the button at the bottom right to listen to Jingle Bells, Joy to the World, and many other songs from Blobs. Who knows, they might inspire you to create a brand-new, excellent piece of art!Remember to record the song you created and share it with your loved ones. New Cities to PerformBlobs are taking a world tour! Other than the Blobpera House, you can create or listen to their performance in London, New York, Mexico City, Seoul, Cape Town, and Paris. In each city, they will sing re-owned songs of that culture. You should definitely see Blob Opera's performance of Carmen from Bizet in Paris.Another recommendation is listening to Hallelujah under the lights of London streets.Let us know which one is your favorite in the comment section below. Who created Blob Opera?Blob Opera is created by David Li in collaboration with Google Arts and Culture. You may have already known another work of David Li: Elastic Man Morty. If you haven't met him yet, we strongly recommend you play with Morty's face for a while. Enjoy the fantastic visuals and physics of the game.Who are the voices of Blob Opera?Bass: Frederick TongTenor: Christian JoelMezzo‑soprano: Joanna GambleSoprano: Olivia DoutneyWhat to Play Next?OnlineGames.io has a lot of experimental and funny games for you. Explore all of the tags, and we are sure you will find a title that feels like it was created only for you.Please bookmark this website (Ctrl +D) to come back whenever you want. Then, you will always find the newest games online.created by Busra Gezen using Canva toolsThis article was updated on August 15, 20241 Player3DCrazyCuteFreeFunFunnyMobileMouseMusic",
  "extractedAt": "2025-06-10T06:15:25.324Z",
  "localThumbnail": "Blob Opera_1749536125325.jpg"
}