{
  "url": "https://www.onlinegames.io/blocky-blast/",
  "title": "Blocky Blast",
  "category": "/t/puzzle/",
  "thumbnail": "https://www.onlinegames.io/media/posts/551/Blocky-Blast.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/551/Blocky-Blast.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/551/responsive/Blocky-Blast-xs.jpg 384w, https://www.onlinegames.io/media/posts/551/responsive/Blocky-Blast-sm.jpg 600w, https://www.onlinegames.io/media/posts/551/responsive/Blocky-Blast-md.jpg 768w, https://www.onlinegames.io/media/posts/551/responsive/Blocky-Blast-lg.jpg 1200w",
    "alt": "Blocky Blast Free Online Game",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2022/unity3/blocky-blast/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "How to Play Blocky Blast"
      },
      {
        "type": "h3",
        "text": "Bombs on the Playing Field"
      },
      {
        "type": "h3",
        "text": "Match in the Blocky Blast"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Explore Other Puzzle Games"
      }
    ],
    "controls": [
      "To eliminate blocks, click or tap on the blocks"
    ],
    "howToPlay": "You will see colored cubes on the playing field. They all have facial expressions on them, which makes them so cute.Each level possesses a specific goal. For example, you may need to destroy 10 blue and 15 orange blocks within a particular level. Complete the task to move on to the next level.But you need to pay attention to your move count while performing these tasks. You can not pass the level if you run out of your counts before completing what is requested. You have 20 move counts.",
    "tips": "",
    "developer": "",
    "similarGames": []
  },
  "fullContent": "Home› PuzzleBlocky BlastBy OnlineGames.ioMake Game Full ScreenBlocky Blast is a 2D puzzle game where you try to blast the cubes of the same color on the grid. Tap on the neighbor cubes with matching colors to remove them altogether. Continue removing cubes until you fulfill the task of the level. However, be mindful that you have a limited number of moves. You need to destroy all the blocks by acting wisely and using the move counts given to you appropriately.Dive into the colorful puzzle adventure with Blocky Blast!How to Play Blocky BlastYou will see colored cubes on the playing field. They all have facial expressions on them, which makes them so cute.Each level possesses a specific goal. For example, you may need to destroy 10 blue and 15 orange blocks within a particular level. Complete the task to move on to the next level.But you need to pay attention to your move count while performing these tasks. You can not pass the level if you run out of your counts before completing what is requested. You have 20 move counts.Bombs on the Playing FieldOn the playground, you can see a few bombs and TNT bombs among the sweetly colored blocks. Don't let these bombs scare you! They will make your job much easier. Click on these bombs to eliminate most cubes on the playing field with a single move. This way, you don't need to use more than one move count to be able to eliminate lots of blocks.While some bombs can explode in all directions, others can only do so in horizontal or vertical directions.If no bombs are on the playing field, you can purchase new ones by clicking the bomb icons at the bottom of the game screen.If you bring more than one bomb side by side and explode them together, you can destroy too many cubes simultaneously.Match in the Blocky BlastIf you achieve the level goal without using all your move counts, a bomb equal to your remaining move count is added to the playing field and activated. These exploding bombs eliminate all remaining colored cubes in the field and give you a much higher score.ControlsTo eliminate blocks, click or tap on the blocksExplore Other Puzzle GamesIf you enjoy playing Blocky Blast, you may try Tic Tac Toe. It's a 2D board game featuring a two-player mode. The player must leave three consecutive marks with X or O letters on a 3x3 grid to win. The letters can be arranged horizontally, vertically, or diagonally. Play this time-honored classic with a friend or against the AI.Alternatively, you may look up puzzle games on OnlineGames.io for further game options. If you have any suggestions, please leave a comment in the comment section below!Embed URL:https://www.onlinegames.io/games/2022/unity3/blocky-blast/index.htmlThis article was updated on May 9, 20241 Player2DBlockColorCuteEmbeddableFreeFunKidsMobileMousePuzzleUnity",
  "extractedAt": "2025-06-10T05:46:51.932Z",
  "localThumbnail": "Blocky Blast_1749534411932.jpg"
}