{
  "url": "https://www.onlinegames.io/blocky-combat-swat/",
  "title": "Blocky Combat Swat",
  "category": "/t/shooting/",
  "thumbnail": "https://www.onlinegames.io/media/posts/561/Blocky-Combat-Swat-Controls-Keyboard-Controls.webp",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/561/Blocky-Combat-Swat-Controls-Keyboard-Controls.webp",
    "srcset": "https://www.onlinegames.io/media/posts/561/responsive/Blocky-Combat-Swat-Controls-Keyboard-Controls-xs.webp 384w, https://www.onlinegames.io/media/posts/561/responsive/Blocky-Combat-Swat-Controls-Keyboard-Controls-sm.webp 600w, https://www.onlinegames.io/media/posts/561/responsive/Blocky-Combat-Swat-Controls-Keyboard-Controls-md.webp 768w, https://www.onlinegames.io/media/posts/561/responsive/Blocky-Combat-Swat-Controls-Keyboard-Controls-lg.webp 1200w",
    "alt": "Blocky Combat Swat Controls Keyboard Controls",
    "width": 750,
    "height": 224,
    "className": "is-loaded",
    "parentClass": "post__image post__image--center is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2023/unity3/blocky-combat-swat/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "How to Play Blocky Combat Swat"
      },
      {
        "type": "h3",
        "text": "Game Modes"
      },
      {
        "type": "h3",
        "text": "Weapons to Choose"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "You May Also Like"
      }
    ],
    "controls": [
      "Press the WASD or Arrow keys to move your player.Space to jumpC to crouchE to change weapon attachmentsTo fire, use the left mouse button.Right-click to aim.Press the R key to reload.To pause, press the Tab key.To change the weapon, use the number keys or scroll the mouse.Press the Q key to change the appearance of the weapon.Press the E key to change the weapon's attachment."
    ],
    "howToPlay": "Zombies will start to appear in the area when you begin playing the game, coming from all directions. And it's your job to take them out one by one. These zombies are tough, so you have to exercise caution. You can play this game in single-player mode or with other players online, depending on your preference.\n\nCampaign Mode: Play as a single player and view the mission map by choosing the \"Campaign\" option from the main menu. Each assignment must be finished individually. You can select the team you want to play for when playing campaign mode. You are entitled, for instance, to play for either the first or the second team. Or, you can play as a zombie.Multiplayer Mode: Start a multiplayer game by selecting \"Play in America\" from the main menu. As a result, you will be brought to the lobby. From this page, you can view available servers or create a new one.",
    "tips": "",
    "developer": "",
    "similarGames": []
  },
  "fullContent": "Home› First Person ShooterBlocky Combat SwatBy OnlineGames.ioMake Game Full ScreenBlocky Combat Swat is a 3D shooting game in which the player faces off against pixelated zombies. These zombies might arrive from anywhere and at any time. They may come up to you creeping, sprinting, or sneakily. Stop the zombies from attacking you and wipe them out. These zombies don't die quickly. Just when you think you've shot them and are safe, you'll notice them crawling towards you. You'll have a lot of fun playing this Minecraft-inspired game!How to Play Blocky Combat SwatZombies will start to appear in the area when you begin playing the game, coming from all directions. And it's your job to take them out one by one. These zombies are tough, so you have to exercise caution. You can play this game in single-player mode or with other players online, depending on your preference.Campaign Mode: Play as a single player and view the mission map by choosing the \"Campaign\" option from the main menu. Each assignment must be finished individually. You can select the team you want to play for when playing campaign mode. You are entitled, for instance, to play for either the first or the second team. Or, you can play as a zombie.Multiplayer Mode: Start a multiplayer game by selecting \"Play in America\" from the main menu. As a result, you will be brought to the lobby. From this page, you can view available servers or create a new one.Game ModesBlocky Combat Swat improves your gaming experience by offering a variety of game modes. The available game modes are given below.DeathmatchTeam DeathmatchWave SurvivalZombiesGun GameWeapons to ChooseThe game gives you eighteen different weapon options. You start with five of them: Handgun, Rifle 1, SMG 1, Sniper 1, and Shotgun 1. You can acquire new weapons as your character levels up. While playing the game, use the numbers 1-5 for changing your weapon.ControlsPress the WASD or Arrow keys to move your player.Space to jumpC to crouchE to change weapon attachmentsTo fire, use the left mouse button.Right-click to aim.Press the R key to reload.To pause, press the Tab key.To change the weapon, use the number keys or scroll the mouse.Press the Q key to change the appearance of the weapon.Press the E key to change the weapon's attachment.You May Also LikeTry Realistic Zombie Survival Warfare, if you like playing Blocky Combat Swat. You have to strive to survive in this first person shooter game while avoiding the terrifying monsters. Zombies will attack you in waves. You have to fight with them. The zombies will get harder with each wave.Or, you may look up other free shooting games on OnlineGames.io for more game alternatives. Please leave your thoughts on this game in the comments section below!This article was updated on January 24, 20243DBattleBattle RoyaleBlockFirst Person ShooterFreeGunMinecraftMultiplayerShootingUnity",
  "extractedAt": "2025-06-10T05:40:42.605Z",
  "localThumbnail": "Blocky Combat Swat_1749534042606.jpg"
}