{
  "url": "https://www.onlinegames.io/bloxd-io/",
  "title": "Bloxd io",
  "category": "/t/action/",
  "thumbnail": "https://www.onlinegames.io/media/posts/722/Bloxd-io-KC.webp",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/722/Bloxd-io-KC.webp",
    "srcset": "https://www.onlinegames.io/media/posts/722/responsive/Bloxd-io-KC-xs.webp 384w, https://www.onlinegames.io/media/posts/722/responsive/Bloxd-io-KC-sm.webp 600w, https://www.onlinegames.io/media/posts/722/responsive/Bloxd-io-KC-md.webp 768w, https://www.onlinegames.io/media/posts/722/responsive/Bloxd-io-KC-lg.webp 1200w",
    "alt": "Bloxd.io keyboard controls",
    "width": 750,
    "height": 224,
    "className": "is-loaded",
    "parentClass": "post__image post__image--center is-loaded"
  },
  "gameFrame": "https://bloxd.io/",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Bloxd io Game Modes Explained"
      },
      {
        "type": "h3",
        "text": "Open World Modes"
      },
      {
        "type": "h3",
        "text": "PvP Team Modes"
      },
      {
        "type": "h3",
        "text": "Building-Centered Modes"
      },
      {
        "type": "h3",
        "text": "Free For All Modes"
      },
      {
        "type": "h3",
        "text": "Parkour Maps"
      },
      {
        "type": "h3",
        "text": "Other Modes"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "You May Also Like"
      },
      {
        "type": "h2",
        "text": "We'd Like to Hear From You"
      }
    ],
    "controls": [
      "Move Forward: WMove Backward: SMove Left: AMove Right: DRun: ShiftBreak Block: Left ClickPlace Block: Right Click / EOpen Inventory / Craft: TabDrop Item: QJump: SpaceCrouch: Control / C / CapsLockPick Block (creative): Middle Mouse Button / Alt+Left ClickZoom: V"
    ],
    "howToPlay": "",
    "tips": "",
    "developer": "Arthur Baker created this game.",
    "similarGames": []
  },
  "fullContent": "Home› MinecraftBloxd ioBy OnlineGames.ioMake Game Full ScreenWelcome to Bloxd io, an ultimate online Minecraft game with diverse modes. Whether you're interested in a peaceful building session or intense PvP battles, you will find what you expect from Bloxd io.Each game mode has its own objective, such as survival, building, battling, or even solving murder mysteries. Learn about the game modes below. You can choose to play solo or with a friends online. ControlsMove Forward: WMove Backward: SMove Left: AMove Right: DRun: ShiftBreak Block: Left ClickPlace Block: Right Click / EOpen Inventory / Craft: TabDrop Item: QJump: SpaceCrouch: Control / C / CapsLockPick Block (creative): Middle Mouse Button / Alt+Left ClickZoom: VBloxd io Game Modes ExplainedSo, let's get you acquainted with the game modes you can choose. We split modes into 6 sub-categories to ease the selection.  Open World ModesSurvival: Survival mode allows players to engage in PvP and explore an open world. The player should take down other players. Collect resources and outlast others.Peaceful: No PVP in peaceful mode. Dig, carve and create whatever your heart desires. No danger to worry about. Enjoy the pure exploration.Creative: Find all the building blocks in your inventory and start building. Whether a cathedral, a shelter or an island for yourself. Sandbox gameplay with fly mode on.PvP Team ModesBed Wars: Similar to capture the flag of FPS games. Keep your team bed safe, and don't let any opponent approach it. The battle is in the sky, so try not to fall down. You can play Bedwars mode with 2x2 or 4x4 players.Pirates: PvP mode where you destroy enemies' ships to win. Dig enemy spawn blocks first and take down enemies themself later! Hide and Seek: This one is certainly our favorite. Players split into two teams: hiders and seekers. Before the time runs out, explore the map and find a perfect place to hide. You will hide as a block, so choose the block you want to be according to the theme of the place you'll hide. A bookshelf in the woods would reveal itself, wouldn't it? If you get caught, be a seeker and look for any suspicious behavior on the map. You have 15 chances to find hiders.Building-Centered ModesOne Block: Experience the Big Bang virtually! You will start with only one block and dig it to generate new blocks. With a single block and hard work, you can build an island of your own.Doodle Cube: Build anything that matches the theme of a map within the time limit. When time is up, go vote for other buildings and try to win the competition.Plots: Build whatever you like without someone approaching. Everyone's builds are safe in this mode. Build a plot on private land.Free For All ModesSky Wars: 12 players spawn on islands with 2-3 chests containing random items in them. Players must bridge to other islands and fight until only one player is left. If a player dies, they lose the game, and the killer gets 10 coins. The winner of this Battle Royale match gets 30 coins.Cube Warfare: Cube Warfare is very similar to Pixel Survival. You will enter a battle to eliminate other players to earn coins and obtain powerups. Free-for-all game mode with FPS perspective.Infection: Apocalypse world with zombies trying to hunt you down in every corner. Run, escape and survive on the map!Parkour MapsEvil Tower: Climb through a challenging tower without any checkpoints. It's cruelly evil, isn't it?Bloxd Hop: Hop and jump on blocks. Just like the Only Up game, you'll climb through rough parkours.Other ModesGreenville: Similar to Sims, you need to work to live in Greenville mode. Be a miner, lumberjack, or even a street fighter to earn coins. Play mini-games and go to the market to buy and sell items to multiply your winnings.Murder Mystery: You can choose to play as an innocent detective or murderer in this mode. Survive as an innocent or collect ten moonstones to get a gun to kill the murderer. The murderer's goal is to kill everyone without getting shot. The detective has a gun to kill the murderer, but it takes five seconds to reload if they miss. Worlds: Create your own world and choose the game mode you'd like. Create lobbies and shape the game to your taste.DeveloperArthur Baker created this game.You May Also LikeIf you like online Minecraft games like Bloxd io another alternative is Miniblox, a crafting game with even more game modes, miniplays and tons of different blocks.Your alternatives do not end on OnlineGames.io! Feel free to explore all our titles and tags to find the game that suits you best.We'd Like to Hear From YouWe're working hard to make our platform more entertaining every day. We value your opinions and love to hear from you. In the comment section below, tell us your favorite maps, modes and best scores. You can also leave an emoji to help us better understand your feelings about the game.This article was updated on April 30, 20243DActionAdventureBattleBattle RoyaleBlockCraftingFirst Person ShooterFreeGunio GamesMinecraftMultiplayerParkourPirateSandboxShootingSimulatorSurvivalWeaponZombie",
  "extractedAt": "2025-06-10T04:10:49.939Z",
  "localThumbnail": "Bloxd io_1749528649939.jpg"
}