{
  "url": "https://www.onlinegames.io/bob-the-robber/",
  "title": "Bob the Robber",
  "category": "/t/action/",
  "thumbnail": "https://www.onlinegames.io/media/posts/420/Bob-The-Robber-Online.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/420/Bob-The-Robber-Online.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/420/responsive/Bob-The-Robber-Online-xs.jpg 384w, https://www.onlinegames.io/media/posts/420/responsive/Bob-The-Robber-Online-sm.jpg 600w, https://www.onlinegames.io/media/posts/420/responsive/Bob-The-Robber-Online-md.jpg 768w, https://www.onlinegames.io/media/posts/420/responsive/Bob-The-Robber-Online-lg.jpg 1200w",
    "alt": "Bob the Robber Play Online",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://html5.gamedistribution.com/18d28481ea514f3c838f9a5a355fb0f7/?gd_sdk_referrer_url=https://www.onlinegames.io/bob-the-robber",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "How to play Bob The Robber?"
      },
      {
        "type": "h2",
        "text": "How to Escape from Cameras in Bob The Robber?"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "Similar Games"
      }
    ],
    "controls": [
      "Use the A or D keys or the Left and Right Arrow keys to move BobUse the W key or the Upper Arrow key to climb up a stair or use an elevatorPress the W key or the Upper Arrow key to search for valuable items among the boxes or casesPress the W key or the Upper Arrow key and hold the key to open a locked doorPress the W key or the Upper Arrow key to unlock a coded door by using the 0-9 numbersPress the W key or the Upper Arrow key to cut the power to disable the laser system"
    ],
    "howToPlay": "Bob has a story. His deep admiration for Robin Hood since childhood led him to this path. He trained himself for years. And now he feels ready for more significant tasks. Now it is crusade time for him. He completed all his preparations. Now it is time to witness the 5 biggest robberies in the world.\n\nThere are five major venues expected to be robbed in Bob The Robbery. There are different environments, from the most vulnerable to those with the most advanced technologies. First, you will start robbing a house. After completing this, it is time for the jewelry shop. You will finish the game by robbing a casino.Every place has its own defense system. You must overcome these obstacles one by one. For example, you can disable the laser defense system by cutting off the electricity. Or you can bypass security cameras by hiding in blind spots. If you encounter any guards, we recommend using your stick by pressing the Spacebar 😅.",
    "tips": "",
    "developer": "Bob the Robber was created by Funtomic.",
    "similarGames": [
      {
        "title": "Poptropica",
        "url": "https://www.onlinegames.io/poptropica/"
      }
    ]
  },
  "fullContent": "Home› EscapeBob the RobberBy OnlineGames.ioMake Game Full ScreenCome, let me introduce you to robber Bob! Bob The Robber is an arcade crime game where you play as a cunning robber. You will face many obstacles while stealing. You have to dodge guards, laser sensors and, of course, the cameras. But remember, Bob is not yesterday's kid either! He is an extraordinary thief who has been training himself for a long time. Steal from the rich, give to the poor and keep the spirit of Robin Hood alive! To complete each heist successfully, move on tiptoe and never remove your mask even once. How to play Bob The Robber?Bob has a story. His deep admiration for Robin Hood since childhood led him to this path. He trained himself for years. And now he feels ready for more significant tasks. Now it is crusade time for him. He completed all his preparations. Now it is time to witness the 5 biggest robberies in the world.There are five major venues expected to be robbed in Bob The Robbery. There are different environments, from the most vulnerable to those with the most advanced technologies. First, you will start robbing a house. After completing this, it is time for the jewelry shop. You will finish the game by robbing a casino.Every place has its own defense system. You must overcome these obstacles one by one. For example, you can disable the laser defense system by cutting off the electricity. Or you can bypass security cameras by hiding in blind spots. If you encounter any guards, we recommend using your stick by pressing the Spacebar 😅.How to Escape from Cameras in Bob The Robber?Unfortunately, this game has no way to get rid of the cameras. You can disable the laser system by cutting off the power. Still, for the cameras, you can only follow the camera's direction and take shelter in blind spots. Taking shelter in the shadows or using the stairs to go up or down are good options to evade the cameras.ControlsUse the A or D keys or the Left and Right Arrow keys to move BobUse the W key or the Upper Arrow key to climb up a stair or use an elevatorPress the W key or the Upper Arrow key to search for valuable items among the boxes or casesPress the W key or the Upper Arrow key and hold the key to open a locked doorPress the W key or the Upper Arrow key to unlock a coded door by using the 0-9 numbersPress the W key or the Upper Arrow key to cut the power to disable the laser systemDeveloperBob the Robber was created by Funtomic.Similar GamesFor another funny adventure, give a chance to Poptropica, it will be your next obsession! For additional gaming options, we also advise following the links for more online crazy games and 2D games on OnlineGames.io.This article was updated on May 9, 20241 Player2DActionAdventureAvoidCrazyEscapeFreeFunFunny",
  "extractedAt": "2025-06-10T05:03:41.469Z",
  "localThumbnail": "Bob the Robber_1749531821469.jpg"
}