{
  "url": "https://www.onlinegames.io/boxing-random/",
  "title": "Boxing Random",
  "category": "/t/arcade/",
  "thumbnail": "https://www.onlinegames.io/media/posts/473/Boxing-Random.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/473/Boxing-Random.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/473/responsive/Boxing-Random-xs.jpg 384w, https://www.onlinegames.io/media/posts/473/responsive/Boxing-Random-sm.jpg 600w, https://www.onlinegames.io/media/posts/473/responsive/Boxing-Random-md.jpg 768w, https://www.onlinegames.io/media/posts/473/responsive/Boxing-Random-lg.jpg 1200w",
    "alt": "Boxing Random Play Online",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://html5.gamedistribution.com/e8c02771085e4c8b9de3deda5e087e0e/?gd_sdk_referrer_url=https://www.onlinegames.io/boxing-random",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "How to Play Boxing Random"
      },
      {
        "type": "h3",
        "text": "Unstable Ragdolls"
      },
      {
        "type": "h3",
        "text": "Hooking The Opponent"
      },
      {
        "type": "h3",
        "text": "Changing Environments"
      },
      {
        "type": "h3",
        "text": "Playing Boxing Random with Friends"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "What Is More?"
      }
    ],
    "controls": [
      "Player 1: Use the W key to punch the opponent.",
      "Player 2: Use the Upper arrow key to punch the opponent."
    ],
    "howToPlay": "The gameplay of the Boxing Random is very straightforward. But there are also challenging conditions that come with this simplicity. Because your character's movements are very limited. You can only punch using the up arrow key; other than that, you don't have any movement options. That's why you have to be careful while making your shots.",
    "tips": "",
    "developer": "",
    "similarGames": []
  },
  "fullContent": "Home› 2 PlayerBoxing RandomBy OnlineGames.ioMake Game Full Screen Does the idea of ​​boxing with retro guys appeal to you? Boxing Random is a pixelated ragdoll game where you try to eliminate your opponent by throwing a right hook and a left hook. If you hit your opponent right in the head, you win that round. But since it is tough to keep balance, it will not be that easy for you to make the right shots. It's because directing your character is a bit challenging in this game.How to Play Boxing RandomThe gameplay of the Boxing Random is very straightforward. But there are also challenging conditions that come with this simplicity. Because your character's movements are very limited. You can only punch using the up arrow key; other than that, you don't have any movement options. That's why you have to be careful while making your shots.Unstable RagdollsThe ragdolls in the game are not stationary types. They are constantly moving forward and backward. If you try to throw a hook while your ragdoll is leaning backward, your character will move in that direction. Or vice versa with the same logic. This is the only way you can direct your ragdoll.Hooking The OpponentEvery punch you throw, except for your opponent's head, is considered wasted. If you hit his head exactly, you win the round. In some rounds, you will have the right to perform a rocket punch. You must aim well and use it in the most effective way on your opponent. The person who earns 5 rounds becomes the winner of the game.Changing EnvironmentsWhile playing this game, as the rounds change, the place where you play the game and your ragdolls will change shape. This diversity makes the game very enjoyable. Sometimes, you will box under the sun on the beach, sometimes in the snow, in winter, with your feet slipping.Playing Boxing Random with FriendsBoxing Random offers you the opportunity to play the game with two people. If you want to play the game with your friend and maximize your gaming experience, just select the 2-player option from the main menu.ControlsPlayer 1: Use the W key to punch the opponent.Player 2: Use the Upper arrow key to punch the opponent.What Is More?We heartily encourage you to try Car Football, one of our other two-player games, if you found Boxing Random to be really enjoyable. In this game, you can use your preferred monster truck to kick a ball to your adversary's side. You can also click the link to search through additional OnlineGames.io pixel games and 2-player games collections. To find fresh browser games, visit OnlineGames.io again!This article was updated on May 9, 20242 Player2DArcadeArenaCombatCrazyFreeFunMobilePhysicsPixelSports",
  "extractedAt": "2025-06-10T05:15:18.292Z",
  "localThumbnail": "Boxing Random_1749532518292.jpg"
}