{
  "url": "https://www.onlinegames.io/bullet-master/",
  "title": "Bullet Master",
  "category": "/t/puzzle/",
  "thumbnail": "https://www.onlinegames.io/media/posts/597/Bullet-Master.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/597/Bullet-Master.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/597/responsive/Bullet-Master-xs.jpg 384w, https://www.onlinegames.io/media/posts/597/responsive/Bullet-Master-sm.jpg 600w, https://www.onlinegames.io/media/posts/597/responsive/Bullet-Master-md.jpg 768w, https://www.onlinegames.io/media/posts/597/responsive/Bullet-Master-lg.jpg 1200w",
    "alt": "Bullet Master Free Online Game",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2023/freezenova.com/bullet-master/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "How to Play Bullet Master"
      },
      {
        "type": "h3",
        "text": "Use Your Bullets Wisely"
      },
      {
        "type": "h3",
        "text": "Make Use of TNTs"
      },
      {
        "type": "h2",
        "text": "More Games Like Bullet Master"
      }
    ],
    "controls": [],
    "howToPlay": "Take on your mission from level one.Aim and shoot with a left-click to eliminate targets directly in your line of sightAt first levels, you will face targets just in front of you. They'll be easier to remove.As you progress through the game, the enemies will hide behind walls, in pits and on stairs.In order to shoot down enemies, estimate the path that bullets will draw.Bullets will bounce from the walls, make zigzags and find the true target.Think of Bullet Master as if it's a pool billiard game. Bullets will move just like balls on the pool table. Anticipate the path of the bullets accordingly.You kill multiple enemies at once. But no need to worry if the bullets bounce and neutralize your character. He is bulletproof.",
    "tips": "",
    "developer": "",
    "similarGames": []
  },
  "fullContent": "Home› ShootingBullet MasterBy OnlineGames.ioMake Game Full Screen Bullet Master is a physics puzzle game where you clear enemies by indirect shooting. Take control of a special agent in his mission to clear streets from the bad guys.The special agent is a clever man. Even if the enemies are behind walls or hiding upstairs, he can figure out a way to eliminate them. He uses his knowledge of geometry and physics to do so. Create a path for his bullets. Make them hit the walls, and turn back so that the bullets somehow arrive in the enemies by hitting the objects.40 fantastic levels await to be solved in Bullet Master. Let's see how far you can get!How to Play Bullet MasterTake on your mission from level one.Aim and shoot with a left-click to eliminate targets directly in your line of sightAt first levels, you will face targets just in front of you. They'll be easier to remove.As you progress through the game, the enemies will hide behind walls, in pits and on stairs.In order to shoot down enemies, estimate the path that bullets will draw.Bullets will bounce from the walls, make zigzags and find the true target.Think of Bullet Master as if it's a pool billiard game. Bullets will move just like balls on the pool table. Anticipate the path of the bullets accordingly.You kill multiple enemies at once. But no need to worry if the bullets bounce and neutralize your character. He is bulletproof.Use Your Bullets WiselyYou will have 4 to 6 bullets in your ammo, depending on the level. Use them efficiently.Before you run out of bullets, you should clear all the targets in the level.Otherwise, you need to start over.At the end of each level, you will be rewarded with stars depending on how many bullets you consume.Make Use of TNTsIn this fictional and funny setting of the Bullet Master game, shooting down the enemies is not the only way to remove them.You should think outside the box to pass some levels. Use your problem-solving skills when the enemies are out of sight.You can let the box drop on them.Or you can make use of TNTs that blow up when you shoot.More Games Like Bullet MasterIf you have completed all forty levels and are still hungry for more physics puzzles, try your hand at Mr. Dracula. In this game, you will help Mr. Dracula get rid of pumpkins and zombies who invaded his castle's garden. Mr Dracula is at least as funny and challenging as Bullet Master. Or else, take a look at all free online physics games on OnlineGames.io. Our daily goal is to provide our community with the best quality games for free. Stay in touch, and keep enjoying hundreds of games online!This article was updated on May 9, 20241 Player2DActionFreeFunFunnyGunHTML5LogicMobilePhysicsPuzzleShootingWeapon",
  "extractedAt": "2025-06-10T05:47:45.879Z",
  "localThumbnail": "Bullet Master_1749534465879.jpg"
}