{
  "url": "https://www.onlinegames.io/burnout-city/",
  "title": "Burnout City",
  "category": "/t/car/",
  "thumbnail": "https://www.onlinegames.io/media/posts/861/burnoutcity.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/861/burnoutcity.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/861/responsive/burnoutcity-xs.jpg 384w, https://www.onlinegames.io/media/posts/861/responsive/burnoutcity-sm.jpg 600w, https://www.onlinegames.io/media/posts/861/responsive/burnoutcity-md.jpg 768w, https://www.onlinegames.io/media/posts/861/responsive/burnoutcity-lg.jpg 1200w",
    "alt": "Burnout City Play Online Free",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://cloud.onlinegames.io/games/2024/unity/burnout-city/index-og.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "How to Play Burnout City"
      },
      {
        "type": "h3",
        "text": "Customization Options"
      },
      {
        "type": "h3",
        "text": "Game Modes"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "More Car Games Online"
      }
    ],
    "controls": [
      "Throttle: WBrake: SSteering: A/DHandbrake: SpaceNOS: FGear Neutral: NChange Camera: CLook Back: BLow Beam Lights: LHigh Beam Lights: KGear Shift Up: ShiftGear Shift Down: ControlIndicator Hazard: ZIndicator Left: QIndicator Right: EStart/Stop Engine: IRespawn: RGear 1-5: Press number keys from 1-5"
    ],
    "howToPlay": "With 11 vehicles, from monstrous trucks to sleek F1 cars, pick the beast that matches your style.Peek into the garage to scope out each car's stats and upgrade potential. Need for speed? Seek a lightweight car like the Porsche 993. Prefer engine power on those hills? Monster Truck comes to the help. Or Would you like to master maneuvers on those tight turns? Then, stick with a car with extreme handling performance.",
    "tips": "",
    "developer": "Burnout City was created by FreezeNova.",
    "similarGames": []
  },
  "fullContent": "Home› DriftBurnout CityBy OnlineGames.ioMake Game Full ScreenBurnout City is a place where the night never ends. The streets of a hill-climbing city will be your playground. Your toys? Eleven awesome cars with lots of tuning options. Here in Burnout City, you'll be playing more than a plain online racing game. Chasing thrills, pulling off insane drifts, dodging the fuzz in epic mafia-style chases and many other challenges await you!ControlsThrottle: WBrake: SSteering: A/DHandbrake: SpaceNOS: FGear Neutral: NChange Camera: CLook Back: BLow Beam Lights: LHigh Beam Lights: KGear Shift Up: ShiftGear Shift Down: ControlIndicator Hazard: ZIndicator Left: QIndicator Right: EStart/Stop Engine: IRespawn: RGear 1-5: Press number keys from 1-5How to Play Burnout CityWith 11 vehicles, from monstrous trucks to sleek F1 cars, pick the beast that matches your style.Peek into the garage to scope out each car's stats and upgrade potential. Need for speed? Seek a lightweight car like the Porsche 993. Prefer engine power on those hills? Monster Truck comes to the help. Or Would you like to master maneuvers on those tight turns? Then, stick with a car with extreme handling performance.Customization OptionsNext, head to the customization menu and make your car scream your personality. Explore them all, from slick paint jobs to neon underglow. You have an unlimited supply of in-game currency, so make sure your car stands out without any budget concerns. If you run out of money, simply go back to the main menu and click \"add money\" button. It's like magic! A car game cheat has never been this obvious. So, go all out to enjoy your ride! Here's what you've got in the customization menu:Paint: From matte black to neon green, paint your ride to reflect your soul.Wheels: Choose rims that spin right or wide or just look downright wild.Mechanic: Tune your cambers, suspension, and brakes. Make every part sing your tune.Upgrades: Max out your car's potential. Leave no part left behind.Spoilers: Add some air to your flair. Make your car cut through the wind and look cool doing it.Decals: Slap on some street cred with decals that just look rad.Neons: Light up the night with underglow that turns heads and lights up the streets. Pro Gamer Tip: neon lights look awesome, especially on the Midnight City map.Game ModesAfter picking your car and upgrading it to its full potential, enter the map. You'll see multiple circles, each presenting a game mode. Drive over the circle to enter that game mode. You have 5 game mode options. You've got Race Mode to outpace AI for glory, Pursuit Mode to chase down a nemesis, Trailblazer for precision cone hitting, Checkpoints for a timed challenge, and Free Ride for mission-free and stunt-filled exploration.DeveloperBurnout City was created by FreezeNova.More Car Games OnlineCraving More Asphalt Tearing? Check out our latest release in online car games: Super Car Driving, a game where speed meets chaos. Buckle up, hit the gas, and let's make some noise! Embed URL:https://cloud.onlinegames.io/games/2024/unity/burnout-city/index-og.htmlThis article was updated on November 12, 20241 Player3DCarDriftDrivingEmbeddableFreeGTARacingSimulatorSpeedStuntUnity",
  "extractedAt": "2025-06-10T05:21:45.027Z",
  "localThumbnail": "Burnout City_1749532905027.jpg"
}