{
  "url": "https://www.onlinegames.io/burnout-racers/",
  "title": "Burnout Racers",
  "category": "/t/car/",
  "thumbnail": "https://www.onlinegames.io/media/posts/830/Burnout-Racers.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/830/Burnout-Racers.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/830/responsive/Burnout-Racers-xs.jpg 384w, https://www.onlinegames.io/media/posts/830/responsive/Burnout-Racers-sm.jpg 600w, https://www.onlinegames.io/media/posts/830/responsive/Burnout-Racers-md.jpg 768w, https://www.onlinegames.io/media/posts/830/responsive/Burnout-Racers-lg.jpg 1200w",
    "alt": "Burnout Racers Play Online Free",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2024/unity/burnout-racers/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "How to Play Burnout Racers"
      },
      {
        "type": "h2",
        "text": "Customize the Car"
      },
      {
        "type": "h2",
        "text": "Offline or Multiplayer Rooms"
      },
      {
        "type": "h2",
        "text": "3..2..1... Race!"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "More Games Like This"
      }
    ],
    "controls": [
      "Move: WASD or Arrow KeysHandbrake: SpaceNOS: ShiftChange Camera: CLook Back: BLow Beam Lights: LHigh Beam Lights: KIndicator Hazard: ZIndicator Left: QIndicator Right: E"
    ],
    "howToPlay": "Burnout Racers offers pure joy in each step of the game. First, buy and customize your car, decide whether you go offline or multiplayer, then choose a track and play. Here's a step-by-step guide.",
    "tips": "",
    "developer": "Bonecracker Games created Burnout Racers.",
    "similarGames": []
  },
  "fullContent": "Home› DriftBurnout RacersBy OnlineGames.ioMake Game Full ScreenBurnout Racers is a 3D online car tuning game on OnlineGames.io. Start your car project, upgrade, and tune anything about your car that you like. You don't need to worry about in-game coins because you have unlimited money in this game. You can buy any car or upgrade you'd like.When you're done with configurations, take a ride with your car at vibrant maps to test if drift and grip levels suit you. If you'd like host a multiplayer game room and race with your friends. Show off with your spoilers, decals, and many more!Stay tuned to learn more about controls and how to play Burnout Racers!ControlsMove: WASD or Arrow KeysHandbrake: SpaceNOS: ShiftChange Camera: CLook Back: BLow Beam Lights: LHigh Beam Lights: KIndicator Hazard: ZIndicator Left: QIndicator Right: EHow to Play Burnout RacersBurnout Racers offers pure joy in each step of the game. First, buy and customize your car, decide whether you go offline or multiplayer, then choose a track and play. Here's a step-by-step guide.Customize the CarFirst, explore 7 unique cars in the garage. There are cars for every taste, from old vintage vehicles to sports cars like Porsche 993.Buy the one that suits your style. You have 100K $ initially, but you can add more money from the cheat buttons if you'd like.After the purchase, move on to upgrades section. Start by painting your car, change wheels, upgrade parts like the engine, brakes, handling and speed.Dine tune with adjusting cambers and heights. If you need some advice in this, check our tuning guide.Next, hands down in details like decals, colors of LED lights, spoilers and more.Offline or Multiplayer RoomsLeave the garage after the customizations and hit the play button. Pick between solo offline mode or multiplayer rooms.If you go solo, you can add some AI bots to the game to race with. But you won't be able to earn points.There are two maps you can jump: Dockside Night and Dockside Day.If you create a multiplayer room, you can pick between practice and race mode, adjust the number of laps in a race, add/remove bots.Finally, set the maximum number of players and create your own room. When all other players in the room press \"ready,\" the host can start the race.3..2..1... Race!Use WASD buttons to drive, and use the left shift to activate NOS.Pay attention to the turns and reach the finish first!If you can't send your car to trash, add some money using cheats and start all over again to catch the maximum speed you can achieve in Burnout Racers!DeveloperBonecracker Games created Burnout Racers.More Games Like ThisIf you enjoy multiplayer racing games, you should definitely check out Drift King! It's the most popular car game on OnlineGames.io! Enjoy more models, maps and features!This article was updated on October 2, 20243DCarDriftDrivingFreeMultiplayerRacingSimulatorSpeedStuntUnity",
  "extractedAt": "2025-06-10T05:28:34.143Z",
  "localThumbnail": "Burnout Racers_1749533314143.jpg"
}