{
  "url": "https://www.onlinegames.io/bus-subway-runner/",
  "title": "Bus Subway Runner",
  "category": "/t/arcade/",
  "thumbnail": "https://www.onlinegames.io/media/posts/235/Bus-Subway-Runner-Game.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/235/Bus-Subway-Runner-Game.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/235/responsive/Bus-Subway-Runner-Game-xs.jpg 384w, https://www.onlinegames.io/media/posts/235/responsive/Bus-Subway-Runner-Game-sm.jpg 600w, https://www.onlinegames.io/media/posts/235/responsive/Bus-Subway-Runner-Game-md.jpg 768w, https://www.onlinegames.io/media/posts/235/responsive/Bus-Subway-Runner-Game-lg.jpg 1200w",
    "alt": "Bus Subway Runner Play Online",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2022/unity/bus-subway-runner/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "How to play Bus Subway Runner?"
      },
      {
        "type": "h2",
        "text": "Tips and Tricks to Master in Bus Subway Runner"
      },
      {
        "type": "h2",
        "text": "Does Bus Subway Runner have an end?"
      },
      {
        "type": "h2",
        "text": "Meet the Runners of Bus Subway Runner"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Similar Games"
      }
    ],
    "controls": [
      "Use the A key or the Left arrow key to move leftUse the D key or the Right arrow key to move rightUse the W key or the Up arrow key to jumpUse the S key or the Down arrow key to slideUse the left mouse button twice to use your hoverboard"
    ],
    "howToPlay": "When you open the game and start to play it, your hero automatically runs. All you need to do is steer his direction throughout the chase, just like Subway Surfer. Occasionally, you will need to use your hoverboard as you cannot overcome some obstacles just by jumping. Hoverboard will be your best tool to overcome all challenges by going higher in this game. Also, remember to collect the coins while trying to escape the police. Because later, you will use these coins to buy new items, change your character and improve your existing auxiliary materials.",
    "tips": "There are things we can suggest to you to make your game more enjoyable.\n\nIt is a smart move to use your hover by double-clicking the left mouse button when you are most stuck.The game will offer you some power-ups as you run along the road. Using them adds liveliness and movement to your game. It makes you more agile. These power-ups are Jetpack, Super Sneaker, Coin Magnet, 2x Multiplier, Hoverbike and Hoverboard. You can upgrade their power by using your collected coins.Watch out for balloons. Be sure to get them. They are the ones who will fly you to other dimensions.",
    "developer": "",
    "similarGames": [
      {
        "title": "LOLBeans io",
        "url": "https://www.onlinegames.io/lolbeans-io/"
      }
    ]
  },
  "fullContent": "Home› 1 PlayerBus Subway RunnerBy OnlineGames.ioMake Game Full Screen There is no end to this chase… Bus Subway Runner is an enjoyable runner game where you are being chased by a policeman. You remember Subway Surfer, right? There you were racing against trains. In Bus Subway Runner, you will be facing buses! Be prepared to encounter many obstacles on your way while escaping from the police. Dozens of buses want to crush you in this subway. Trust your reflexes when dodging them!How to play Bus Subway Runner?When you open the game and start to play it, your hero automatically runs. All you need to do is steer his direction throughout the chase, just like Subway Surfer. Occasionally, you will need to use your hoverboard as you cannot overcome some obstacles just by jumping. Hoverboard will be your best tool to overcome all challenges by going higher in this game. Also, remember to collect the coins while trying to escape the police. Because later, you will use these coins to buy new items, change your character and improve your existing auxiliary materials.Tips and Tricks to Master in Bus Subway Runner There are things we can suggest to you to make your game more enjoyable.It is a smart move to use your hover by double-clicking the left mouse button when you are most stuck.The game will offer you some power-ups as you run along the road. Using them adds liveliness and movement to your game. It makes you more agile. These power-ups are Jetpack, Super Sneaker, Coin Magnet, 2x Multiplier, Hoverbike and Hoverboard. You can upgrade their power by using your collected coins.Watch out for balloons. Be sure to get them. They are the ones who will fly you to other dimensions.Does Bus Subway Runner have an end?No, Bus Subway Runner doesn't have an end. It's an endless game where you run to beat your best score and obtain new characters and hoverboards. You can also challenge your family and friends to beat your score in Bus Subway Runner.Meet the Runners of Bus Subway RunnerYou will begin Max, a cute boy who is 14 years old and fond of running in parkours.If you'd like to run around with colorful hats and mini-shorts, Stella should be your runner on the subway. Stella is an adorable runner with ocean blue eyes and a ponytail shaking while running. She is great at dancing. This means you may see her doing some awesome dance moves after an achievement if you are lucky enough. You need to have 5000 coins to unlock Stella.Meet the cool American Rock Star. She will blow your mind with her moves on the runway. She is a real slay queen! Her guitar is on flame. It is only 10000 coins to unlock her. It's nothing compared to her ability to run away from cops.Meet the ultimate runner Tadita! She is a 13 years old native American. Very agile and strong and definitely a live wire. She also looks terrific in her unique ethnic outfit. She'll be your best friend on the roads. You need to submit 25000 coins to unlock her. We believe you can do this if you start running now!ControlsUse the A key or the Left arrow key to move leftUse the D key or the Right arrow key to move rightUse the W key or the Up arrow key to jumpUse the S key or the Down arrow key to slideUse the left mouse button twice to use your hoverboardSimilar GamesIf you enjoy parkour style running games, you might also enjoy LOLBeans io, in which you will be race-running over crazy obstacles with funky bean characters. For more options similar to Bus Subway Runner, browse Adventure Games tag on OnlineGames.io. Embed URL:https://www.onlinegames.io/games/2022/unity/bus-subway-runner/index.htmlThis article was updated on January 28, 20251 Player3DArcadeAvoidCrazyEmbeddableEndlessFreeFunParkourRunningSkateboardingSkillSpeedTraffic",
  "extractedAt": "2025-06-10T05:17:48.596Z",
  "localThumbnail": "Bus Subway Runner_1749532668597.jpg"
}