{
  "url": "https://www.onlinegames.io/car-stunt-king/",
  "title": "Car Stunt King",
  "category": "/t/car/",
  "thumbnail": "https://www.onlinegames.io/media/posts/713/Car-Stunt-King.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/713/Car-Stunt-King.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/713/responsive/Car-Stunt-King-xs.jpg 384w, https://www.onlinegames.io/media/posts/713/responsive/Car-Stunt-King-sm.jpg 600w, https://www.onlinegames.io/media/posts/713/responsive/Car-Stunt-King-md.jpg 768w, https://www.onlinegames.io/media/posts/713/responsive/Car-Stunt-King-lg.jpg 1200w",
    "alt": "Car Stunt King Online Game",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2024/unity/car-stunt-king/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "How to Play Car Stunt King?"
      },
      {
        "type": "h2",
        "text": "Shop"
      },
      {
        "type": "h2",
        "text": "Garage"
      },
      {
        "type": "h2",
        "text": "Maps and Game Modes"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "What to Play Next?"
      }
    ],
    "controls": [
      "WASD or the Arrow Keys: MoveLeft shift: NOS"
    ],
    "howToPlay": "Select a map among several options, such as Arizona, Port, Street, and Wasteland. Complete obstacle courses driving a crazy car.Drive through ramps, avoid wrecking balls, perform flips, and collect coins. Use your coins to buy new car parts, including an engine, suspension, and tires.Or upgrade the ones you have to increase horsepower.If the car still underperforms in races, buy a new car in the garage and max the speed up.",
    "tips": "",
    "developer": "",
    "similarGames": []
  },
  "fullContent": "Home› CarCar Stunt KingBy OnlineGames.ioMake Game Full ScreenReady for a stunt ride in a Dodge? Car Stunt King is a 3D driving game that offers an exhilarating driving experience on an obstacle course. It features various game modes, including racing and police chase. What you can do with these cars will blow your mind!How to Play Car Stunt King?Select a map among several options, such as Arizona, Port, Street, and Wasteland. Complete obstacle courses driving a crazy car.Drive through ramps, avoid wrecking balls, perform flips, and collect coins. Use your coins to buy new car parts, including an engine, suspension, and tires.Or upgrade the ones you have to increase horsepower.If the car still underperforms in races, buy a new car in the garage and max the speed up.ShopBesides collecting coins on the road, there is an in-game currency feature. You will earn passive income in both gold coins and dollars. If you'd like to exchange your CSK dollars for gold coins, you can buy 500 gold coins for 5 dollars, 5000 gold coins for 50 dollars, and 50000 gold coins for 500 dollars.GarageEleven different vehicles, such as Dodge, school bus, minivan, Cooper, bike, and monster truck, are available in the garage. Apart from that, you can buy new car parts and tune them to 20th-level performance. These parts are as follows:Engine: 10 different engines, upgradable up to 1200 HPExhaust Pipe: Eases the load on the engine. The maximum effect is +12 HPTires: Choose between the coolest tires and rims and increase the friction up to 1980 FSuspension: Absorbs the shocks after obstacles on the way, making driving smoother on rough surfacesPaint Job: You can paint the car in the colors of the USA flagMaps and Game ModesCar Stunt King offers 5 different maps and 3 game modes in total. Game modes are solo race, police chase, and pair racing.Maps featuring fantastic landscapes are Arizona, Port, Street, Golden Gate, and Wasteland.Arizona: 23 challenging levels with various obstacles in the desertPort: Drive in the vast port, stunt over containers. 24 levels are available.Street: Escape from cops and jump over buses. 20 levels are available.Golden Gate: 20 levels filled with fire rings, barrels, bridge stunts, and many more.Wasteland: Post-apocalypse obstacle course, dark but fun!In Pair racing mode, there are 7 racetracks and 7 cars to unlock. Racing with a few of the vehicles mentioned below will be a true challenge.MahoneyMcQueenBlack HallMcGovernWeisNehherCooperOttoManControlsWASD or the Arrow Keys: MoveLeft shift: NOSWhat to Play Next?If you like crazy driving games with lots of tuning and customization options, our offer is Drift Hunters 2. With a number of cars in the garage and more realistic graphics than ever, an epic playtime awaits you!For more options, take a look at our most popular category, car games online. We do our best to provide our community with the latest releases. Keep coming back for the coolest games online!This article was updated on April 16, 20241 Player3DCarCrashCrazyDrivingFreeMouseRacingSpeedStunt",
  "extractedAt": "2025-06-10T05:23:20.903Z",
  "localThumbnail": "Car Stunt King_1749533000903.jpg"
}