{
  "url": "https://www.onlinegames.io/cat-simulator/",
  "title": "Cat Simulator",
  "category": "/t/adventure/",
  "thumbnail": "https://www.onlinegames.io/media/posts/330/Cat-Simulator-Online.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/330/Cat-Simulator-Online.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/330/responsive/Cat-Simulator-Online-xs.jpg 384w, https://www.onlinegames.io/media/posts/330/responsive/Cat-Simulator-Online-sm.jpg 600w, https://www.onlinegames.io/media/posts/330/responsive/Cat-Simulator-Online-md.jpg 768w, https://www.onlinegames.io/media/posts/330/responsive/Cat-Simulator-Online-lg.jpg 1200w",
    "alt": "Cat Simulator Play For Free",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2022/unity4/cat-simulator/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "How to Play Cat Simulator?"
      },
      {
        "type": "h2",
        "text": "Game Modes"
      },
      {
        "type": "h2",
        "text": "Features"
      },
      {
        "type": "h2",
        "text": "More Games Like This"
      }
    ],
    "controls": [],
    "howToPlay": "Use the W or Up Arrow key to move forwardUse the S or Down Arrow key to move backwardUse the A or Left Arrow key to move leftUse the D or Right Arrow key to move rightUse the Space key to jumpUse the Shift key to gain speedUse the F key to attack your enemies with your claws",
    "tips": "",
    "developer": "",
    "similarGames": []
  },
  "fullContent": "Home› CatCat SimulatorBy OnlineGames.ioMake Game Full Screen Purrr! Cat Simulator is a game where you purrr a lot. You are playing as a cat. You have the option to choose your cat's species. All you need to do is unlock other cat breeds by earning coins. As you level up, your earnings and difficulty levels will increase simultaneously. How to Play Cat Simulator?Use the W or Up Arrow key to move forwardUse the S or Down Arrow key to move backwardUse the A or Left Arrow key to move leftUse the D or Right Arrow key to move rightUse the Space key to jumpUse the Shift key to gain speedUse the F key to attack your enemies with your clawsGame ModesWhen you open the game, there will be an opening screen with many game mode options. Each one has unique features. Choose whichever is best for you, and have fun!Cat Stunt Mode: There is parkour in this mode, and you should jump and cross over the hurdles. It is like Wipeout but with a cat!Maga XP: You are given a limited time and lots of coins in this mode. You can collect coins as much as you can within a short period.Career: As you can expect, it is all about career development. Yes, cats have careers, too. There will be some quests, and you will be expected to fulfill these tasks. Destruction: The cat's paws are itching. It needs to break some things, to drop them. Just tour the venue.Maga Kill: There are squirrels, tortoises, and spiders in this survival mode. And you need to scratch them before running out of health. When you kill an animal, coins drop. Take them and tease other animals.Pool Mini Game: You have 50 seconds! Use this span to claw animals gliding on the water's surface. But avoid catching dangerous animals like lobsters, squirrels and tortoises. You may end up dying.FeaturesThis game offers you many options. You can select the game mode mentioned above as you wish. Also, you can choose your main character's breed. There are 13 different cat breeds there. Each species comes with varying portions of health percentage, damage and power ability. Or, you can customize your cat's outfits by buying a hat with your coins. Additionally, you can design the room you are playing in with TVs, paintings, shelves, vases, curtains, etc.More Games Like ThisIf you like the Cat Simulator, you can find more games by browsing other cat games and pet games online on our platform.Embed URL:https://www.onlinegames.io/games/2022/unity4/cat-simulator/index.htmlThis article was updated on May 9, 20241 Player3DAdventureAnimalCatCozyCrazyCuteEmbeddableFreeFunKidsPetSimulator",
  "extractedAt": "2025-06-10T05:07:17.184Z",
  "localThumbnail": "Cat Simulator_1749532037185.jpg"
}