{
  "url": "https://www.onlinegames.io/christmas-mahjong/",
  "title": "Christmas Mahjong",
  "category": "/t/puzzle/",
  "thumbnail": "https://www.onlinegames.io/media/posts/555/Christmas-Mahjong.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/555/Christmas-Mahjong.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/555/responsive/Christmas-Mahjong-xs.jpg 384w, https://www.onlinegames.io/media/posts/555/responsive/Christmas-Mahjong-sm.jpg 600w, https://www.onlinegames.io/media/posts/555/responsive/Christmas-Mahjong-md.jpg 768w, https://www.onlinegames.io/media/posts/555/responsive/Christmas-Mahjong-lg.jpg 1200w",
    "alt": "Christmas Mahjong Free Online Game",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://html5.gamedistribution.com/7aaa62dd2c9840a2a6e89c0cf3aba873/?gd_sdk_referrer_url=https://www.onlinegames.io/christmas-mahjong",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "How to Play Christmas Mahjong"
      },
      {
        "type": "h3",
        "text": "Game Rules of Christmas Mahjong"
      },
      {
        "type": "h3",
        "text": "Can I play Christmas Mahjong on Chromebook?"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "Similar Christmas Games"
      }
    ],
    "controls": [
      "Click on the tiles to match them with their pairs."
    ],
    "howToPlay": "There are 28 tiles on the first level. You will find 14 different festive object images on them. They are adorned with festive icons like Santa Clauses, socks, snowmen, and more. Your main goal is to match these stonewares with their pairs and eliminate them one by one.\n\nBut you have limited time. The more stonewares you pair within 1 minute and 30 seconds, the more points you get. Keep in mind that as you level up, you will deal with much more stoneware!",
    "tips": "",
    "developer": "Christmas Mahjong was created by WillingGames.",
    "similarGames": []
  },
  "fullContent": "Home› ChristmasChristmas MahjongBy OnlineGames.ioMake Game Full ScreenChristmas Mahjong is a puzzle game where the player attempts to match each tile with its corresponding pair until no more tiles remain. The aim is to remove all the Christmas-themed tiles from the board. But you have to be fast because you have very little time. Playing mahjong, one of the oldest games, with a festive theme. We are sure you'll love it.How to Play Christmas MahjongThere are 28 tiles on the first level. You will find 14 different festive object images on them. They are adorned with festive icons like Santa Clauses, socks, snowmen, and more. Your main goal is to match these stonewares with their pairs and eliminate them one by one.But you have limited time. The more stonewares you pair within 1 minute and 30 seconds, the more points you get. Keep in mind that as you level up, you will deal with much more stoneware!Game Rules of Christmas MahjongThe game has 28 stonewares in the beginning. The goal of the game is to match these 28 stonewares with their pairs.As the number of tiles increases in the following levels, the time given to you will also increase.To make a pair, make sure the tile you chose is free on one side (left or right). Otherwise, the matching does not happen.In addition, for tiles to pair, they must be in a position to match and move towards each other. If there is an obstacle in front of them, they can not match.When you've paired all of the stonewares and no tiles remaining, you've won! You can move on to the next level.Can I play Christmas Mahjong on Chromebook?Yes, definitely. You can play the game on your Chromebook, mobile devices, desktops and tablets. All you have to do is enter OnlineGames.io and search for the game. Afterward, you can play any game you want, wherever you want, for free.ControlsClick on the tiles to match them with their pairs.DeveloperChristmas Mahjong was created by WillingGames.Similar Christmas GamesIf you love playing Christmas Mahjong, you may try your hand at other puzzle games. Alternatively, you may look up the other Christmas games on OnlineGames.io for more options. Please bookmark the website to quickly access the new games!This article was updated on February 15, 20251 Player2DBrainChristmasCozyFreeHTML5LogicMousePuzzleStrategy",
  "extractedAt": "2025-06-10T05:47:54.030Z",
  "localThumbnail": "Christmas Mahjong_1749534474030.jpg"
}