{
  "url": "https://www.onlinegames.io/city-stunts/",
  "title": "City Stunts",
  "category": "/t/car/",
  "thumbnail": "https://www.onlinegames.io/media/posts/629/City-Stunts-Game.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/629/City-Stunts-Game.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/629/responsive/City-Stunts-Game-xs.jpg 384w, https://www.onlinegames.io/media/posts/629/responsive/City-Stunts-Game-sm.jpg 600w, https://www.onlinegames.io/media/posts/629/responsive/City-Stunts-Game-md.jpg 768w, https://www.onlinegames.io/media/posts/629/responsive/City-Stunts-Game-lg.jpg 1200w",
    "alt": "City Stunts Free Online Game",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2023/unity3/city-stunts/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "How to Play City Stunts"
      },
      {
        "type": "h3",
        "text": "Fly Me to the Moon"
      },
      {
        "type": "h3",
        "text": "Choose Your Car"
      },
      {
        "type": "h3",
        "text": "Tips for Cool Moves"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "Similar Driving Games"
      }
    ],
    "controls": [
      "WASD or Arrow Keys: MoveSpace Key: Brake"
    ],
    "howToPlay": "The game offers many luxurious vehicles. After deciding which one you will drive on the city streets from the car selection menu, you are ready to set! Enter the city and perform flyovers using the sky-high ramps of different kinds. Or, you can wander around the map if you want. Performing drifts is also at your disposal.",
    "tips": "To make flyovers, you must choose the most optimal car among the options. Many of them will allow you to do a somersault. But, for example, the bus or the jeep may not be the best option to perform such movements as they are heavier than the others. After the selection, enter a ramp at high speed by centering it. And try not to lose the steering control while moving on it.",
    "developer": "City Stunts was developed by FreezeNova.",
    "similarGames": [
      {
        "title": "Highway Cars",
        "url": "https://www.onlinegames.io/highway-cars/"
      }
    ]
  },
  "fullContent": "Home› StuntCity StuntsBy OnlineGames.ioCity Stunts is a 3D driving game where your main job is to perform spectacular stunts with the most exotic cars in the world. Test your driving skills on high ramps. Many platforms on the city map allow you to make acrobatic movements with your vehicle. Choose your favorite vehicle and challenge the sky in this thrilling stunt game!How to Play City StuntsThe game offers many luxurious vehicles. After deciding which one you will drive on the city streets from the car selection menu, you are ready to set! Enter the city and perform flyovers using the sky-high ramps of different kinds. Or, you can wander around the map if you want. Performing drifts is also at your disposal.Fly Me to the MoonThe best way to enjoy this car game is to perform acrobatic movements in the air. You will encounter many ramps on the streets. Head towards them at high speed and fly to the moon, as Frank Sinatra said. Don't worry about damaging your vehicle. You won't even find a scratch on it after hitting the ground. You can continue your way as if nothing happened!Choose Your CarThere are 7 elegant cars to choose from. And you have the option to drive a bus in the game. It is up to you which one you want to drive.Most of them are similar to renowned brands such as Ferrari, Aston Martin, and Jeep. There is no unlocking restriction, so you can go with any of them.But keep in mind that each has its own specific features regarding weight and speed limits. These differences may impact the act of performing the stunts.Tips for Cool MovesTo make flyovers, you must choose the most optimal car among the options. Many of them will allow you to do a somersault. But, for example, the bus or the jeep may not be the best option to perform such movements as they are heavier than the others. After the selection, enter a ramp at high speed by centering it. And try not to lose the steering control while moving on it.ControlsWASD or Arrow Keys: MoveSpace Key: BrakeDeveloperCity Stunts was developed by FreezeNova.Similar Driving GamesIf you like playing City Stunts, you may also enjoy Highway Cars. You will drive your car on a highway in the flow of traffic. You must dodge other cars on the road to avoid any accidents. Try to pass the vehicles as close as possible to get the higher points!For further options, you may look for other online driving games on OnlineGames.io. Bookmark the website to access new games easily!Embed URL:https://www.onlinegames.io/games/2023/unity3/city-stunts/index.htmlThis article was updated on March 13, 20241 Player3DCarCrashCrazyDriftDrivingEmbeddableFreeSimulatorSpeedStuntUnity",
  "extractedAt": "2025-06-10T05:28:50.793Z",
  "localThumbnail": "City Stunts_1749533330794.jpg"
}