{
  "url": "https://www.onlinegames.io/cobraz-io-classic/",
  "title": "CobraZ.io Classic",
  "category": "/t/io-games/",
  "thumbnail": "https://www.onlinegames.io/media/posts/546/Cobraz-Io-Keyboard-Controls.webp",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/546/Cobraz-Io-Keyboard-Controls.webp",
    "srcset": "https://www.onlinegames.io/media/posts/546/responsive/Cobraz-Io-Keyboard-Controls-xs.webp 384w, https://www.onlinegames.io/media/posts/546/responsive/Cobraz-Io-Keyboard-Controls-sm.webp 600w, https://www.onlinegames.io/media/posts/546/responsive/Cobraz-Io-Keyboard-Controls-md.webp 768w, https://www.onlinegames.io/media/posts/546/responsive/Cobraz-Io-Keyboard-Controls-lg.webp 1200w",
    "alt": "Cobraz io Controls",
    "width": 750,
    "height": 224,
    "className": "is-loaded",
    "parentClass": "post__image post__image--center is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2022/unity/cobraz-io-classic/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "How to Play CobraZ.io Classic?"
      },
      {
        "type": "h3",
        "text": "Game Modes in CobraZ.io Classic"
      },
      {
        "type": "h3",
        "text": "Equipments Section"
      },
      {
        "type": "h3",
        "text": "Change the Soldier's Appearance"
      },
      {
        "type": "h3",
        "text": "Skills in CobraZ.io Classic"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Discover FPS Games"
      }
    ],
    "controls": [
      "WASD or the Arrow keys to move.Left Mouse button to fire.Right Mouse button to aim.Space key to slide while moving.Left Shift key to run.1-2-3 number keys to change weapons.E key or the F key to interact with a gun.G key to throw grenade.H key to use med kit.T key to chat.L key to toggle cursor lock.C key to crouch.Press the N key to show the scoreboard.ESC key to pause."
    ],
    "howToPlay": "Before entering the war, you can customize your soldier's clothing, weapons, abilities, and even his dance routine after winning the battle. This game offers you many alternatives. Evaluating these alternatives makes the gaming experience much more delightful. You can find anything you can think of in the highly developed shop section.",
    "tips": "",
    "developer": "",
    "similarGames": []
  },
  "fullContent": "Home› First Person ShooterCobraZ.io ClassicBy OnlineGames.ioMake Game Full ScreenCobraZ.io Classic is one of the most advanced FPS games where the player can customize his soldier and prepare himself for war with the best items. There are 4 game modes, each with unique features. It offers you Team Deathmatch, Free For All, Capture The Flag and Gun Game mode options. Decide which game mode you will play according to your mood and equip your weapon! Enjoy online battles with this game, which has the most magnificent graphics among battle games.How to Play CobraZ.io Classic?Before entering the war, you can customize your soldier's clothing, weapons, abilities, and even his dance routine after winning the battle. This game offers you many alternatives. Evaluating these alternatives makes the gaming experience much more delightful. You can find anything you can think of in the highly developed shop section.Game Modes in CobraZ.io ClassicThere are 4 different game modes with rich graphics and storylines. Try each of them and enjoy their different gaming experiences. You can choose which game mode you want to play by pressing the gear icon in the main menu. Or, you can directly set it to \"All\" and press the button below to have the game open a random mode for you.Team Deathmatch: In Team Deathmatch mode, the battle occurs between two teams. It can be called the most straightforward game mode.Free For All: Free For All mode is risky in which everyone fights alone.Capture The Flag: In Capture The Flag mode, you also fight in teams, but there are designated points for both teams. The flags here are captured and taken to the main base.Gun Game: In Gun Game mode, you start the game with a simple gun, and as you eliminate enemies, you level up and acquire more powerful weapons.Equipments SectionIn the Equipment section, you can view everything your soldier has. Here, you can find his heavy weapons, the gun and the axe. You can view the features of a weapon by tapping on it: Damage, Fire Rate, Accuracy Range, Ammunition and Mobility. Or you can look at the new weapons you may unlock. You can also create a new loadout for yourself.Change the Soldier's AppearanceChange your soldier's appearance and clothing from the Equipment section. You can purchase a hat for him and choose his hairstyle and color. You might even find skull face paints. In short, be the architect of your own game with the many options offered to you.Skills in CobraZ.io ClassicWhen you enter the game, the game will give you the chance to choose one of 4 skills. By choosing one of these, you determine a helping force for yourself. You activate these skills by pressing the Q key.Supply Drop: It allows you to obtain new weapons by dropping a chest.AOE Heal: It provides rapid recovery.Holo Soldier: It creates 3 holograms identical to your character and confuses your enemies.Dome Shield: It creates a circle of protection and protects you from bullets.ControlsWASD or the Arrow keys to move.Left Mouse button to fire.Right Mouse button to aim.Space key to slide while moving.Left Shift key to run.1-2-3 number keys to change weapons.E key or the F key to interact with a gun.G key to throw grenade.H key to use med kit.T key to chat.L key to toggle cursor lock.C key to crouch.Press the N key to show the scoreboard.ESC key to pause.Discover FPS GamesIf you are a fan of CobraZ.io Classic, you may try Crazy Strike Force. You can give your character a distinct look and make them resistant to enemies. You will be able to shoot every player in the game with an excellent assortment of weaponry. You have to defeat your rivals; don't be afraid of creating your own strategy.For more options, look up all FPS Games on OnlineGames.io by following the link. Share your gaming experience with fellow gamers in the comments section below.Embed URL:https://www.onlinegames.io/games/2022/unity/cobraz-io-classic/index.htmlThis article was updated on January 24, 20243DActionBattleEmbeddableFirst Person ShooterFreeGunio GamesMultiplayerShootingUnityWeapon",
  "extractedAt": "2025-06-10T05:34:04.749Z",
  "localThumbnail": "CobraZ.io Classic_1749533644750.jpg"
}