{
  "url": "https://www.onlinegames.io/coin-empire/",
  "title": "Coin Empire",
  "category": "/new-games/",
  "thumbnail": "https://www.onlinegames.io/media/posts/737/Coin-Empire.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/737/Coin-Empire.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/737/responsive/Coin-Empire-xs.jpg 384w, https://www.onlinegames.io/media/posts/737/responsive/Coin-Empire-sm.jpg 600w, https://www.onlinegames.io/media/posts/737/responsive/Coin-Empire-md.jpg 768w, https://www.onlinegames.io/media/posts/737/responsive/Coin-Empire-lg.jpg 1200w",
    "alt": "Coin Empire Play Online",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://html5.gamedistribution.com/057a70cd0c1b4b38b79751b9d4f57802/?gd_sdk_referrer_url=https://www.onlinegames.io/coin-empire",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "How to Play Coin Empire"
      },
      {
        "type": "h2",
        "text": "Play Mini Games for More Coins"
      },
      {
        "type": "h2",
        "text": "Progress Through Ages"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "Release Date"
      },
      {
        "type": "h2",
        "text": "Conclusion"
      },
      {
        "type": "h2",
        "text": "Explore More Games"
      }
    ],
    "controls": [
      "Use your LMB or tap on icons to build a town"
    ],
    "howToPlay": "You'll have an empty island at the beginning of Stone Age.Construc buildings and upgrade them to get stars.When you upgrade all of the buildings up to the 5th level, you can proceed to the next age and create another town with new units.However, from time to time, your opponents will try to attack and loot your buildings. Defend your town and seek revenge when they do so. You'll need resources such as coins, crystals and stars to succeed in the game. Utilize the slot machine and spin until you have enough coins to build your dream town.Unlock epic heroes such as Hercules, Zeus, Iron Musk and Thor by claiming chests.",
    "tips": "",
    "developer": "MarketJS created Coin Empire.",
    "similarGames": []
  },
  "fullContent": "Home› DefenseCoin EmpireBy OnlineGames.ioMake Game Full ScreenYou will get to rewrite history in Coin Empire! Start with a small village in the Stone Age. Create shelters, employ soldiers, and tame wild animals. Raid neighbors' attacks and create an empire. Upgrade your units to pass to other ages.Coin Empire stands out as an idle empire-building game with a twist. As you construct your town and defend it from opponents, you'll also get to spin a slot machine to earn more coins. This unique blend of idle building and slot machine mechanics brings a fresh gameplay experience to traditional defense games.ControlsUse your LMB or tap on icons to build a townHow to Play Coin EmpireYou'll have an empty island at the beginning of Stone Age.Construc buildings and upgrade them to get stars.When you upgrade all of the buildings up to the 5th level, you can proceed to the next age and create another town with new units.However, from time to time, your opponents will try to attack and loot your buildings. Defend your town and seek revenge when they do so. You'll need resources such as coins, crystals and stars to succeed in the game. Utilize the slot machine and spin until you have enough coins to build your dream town.Unlock epic heroes such as Hercules, Zeus, Iron Musk and Thor by claiming chests.Play Mini Games for More CoinsNavigate to the mini-games section at the bottom of your screen to play short games that'll bring you lots of coins.You can play Simon Says, Match Cards, Guess the Number or solve a Maze Challenge. Progress Through AgesEvery build and upgrade in Coin Empire is a strategic decision. Each one brings you 1 star, and when you collect 25 stars, you'll enter a new era. Similar to the renowned PC game Age of Empire, you'll learn how to craft more advanced buildings over time. This strategic progression allows you to build different kinds of structures at each age, challenging you to adapt and evolve your empire. Are you ready to defend your town from merciless attacks and become the ruler of the ages?DeveloperMarketJS created Coin Empire.Release DateMarch 11, 2024Conclusion Coin Empire is not just an idle game; it's a diverse gaming experience. From the thrill of the slot machines to the interesting mini-games, you'll find yourself captivated with various tasks to keep up.Explore More GamesIf you like this game, our recommendation is God Simulator. It's another idle game where you manage a religion and reshape civilizations.Coin Empire and all other games on OnlineGames.io are free of charge and instantly playable on your browser. With no signup hassle or hiccups, you can dive right into a world of quality games. Start playing now and discover your next gaming adventure!This article was updated on May 14, 20241 Player2DBattleDefenseFreeHTML5IdleMouse",
  "extractedAt": "2025-06-10T06:09:57.045Z",
  "localThumbnail": "Coin Empire_1749535797045.jpg"
}