{
  "url": "https://www.onlinegames.io/colony-simulator/",
  "title": "Colony Simulator",
  "category": "/new-games/",
  "thumbnail": "https://www.onlinegames.io/media/posts/574/Colony-Simulator.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/574/Colony-Simulator.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/574/responsive/Colony-Simulator-xs.jpg 384w, https://www.onlinegames.io/media/posts/574/responsive/Colony-Simulator-sm.jpg 600w, https://www.onlinegames.io/media/posts/574/responsive/Colony-Simulator-md.jpg 768w, https://www.onlinegames.io/media/posts/574/responsive/Colony-Simulator-lg.jpg 1200w",
    "alt": "Colony Simulator Free Online Game",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2023/unity/colony-simulator/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "How to Play Colony Simulator"
      },
      {
        "type": "h3",
        "text": "Villagers in Colony Simulator"
      },
      {
        "type": "h3",
        "text": "Meet the Needs of the Colony"
      },
      {
        "type": "h3",
        "text": "Crafting and Building"
      },
      {
        "type": "h3",
        "text": "How can I gather the necessary materials?"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Other Crafting Games"
      }
    ],
    "controls": [
      "Use your mouse or the arrow keys to scroll the map.Click on the left mouse button to move the characters."
    ],
    "howToPlay": "When you enter the game, you will see a house with 3 villagers. These are all you have at the start of the game. Your aim is to improve your gaming experience by crafting new tools and constructing new buildings. Even new people may join these villagers! Use your creativity and start crafting.",
    "tips": "",
    "developer": "",
    "similarGames": []
  },
  "fullContent": "Home› CraftingColony SimulatorBy OnlineGames.ioMake Game Full ScreenColony Simulator is a simulator game where the player tries to craft and build things with the help of the three villagers. These villagers, Mary, John and Marc, are at your disposal. They act according to the commands you give. You can send them to collect wood and have them build houses with the materials they have. You have complete control in one of the most strategic crafting games! Exactly like in Age of Empires. 🪓How to Play Colony SimulatorWhen you enter the game, you will see a house with 3 villagers. These are all you have at the start of the game. Your aim is to improve your gaming experience by crafting new tools and constructing new buildings. Even new people may join these villagers! Use your creativity and start crafting.Villagers in Colony SimulatorYou have a colony in this deserted area, which will increase in number as you progress in the game. In the beginning, you will be with Mary, John and Marc. (These names may vary.) They are at your administration. Each of them has different tasks and characteristics. All of them can fight, build, craft and harvest. But there are also specific features of each.Mary: Mary is a logger. Mary meets the wood, rock and other material needs of the colony.John: John is a builder. He is the person responsible for construction work.Marc: Marc is a farmer. Generally, production and harvesting tasks fall on his shoulders.Meet the Needs of the ColonyEach of your villagers is very hardworking and fulfills all the tasks you give them, one by one. But they need to rest, sleep and eat. You also need to monitor their emotional state.When you click on one of the characters, you will see 3 bars in the lower right corner of the screen. The first bar shows their health status, and the second shows their mood. The third one displays hunger conditions.You must follow these bars and meet their needs. Otherwise, they may not work efficiently.Crafting and BuildingThe colony must have the necessary materials to craft or build something. By clicking on the icons at the bottom of the screen, you can see what you can produce or create and how many materials are required for each. Everything you can think of is available here. You can even make beer by building a distillery!How can I gather the necessary materials?By tapping on the trees, rocks and other things you see on the game map, you can direct your characters there and get materials. When you click on the ingredients, a window will open at the bottom right, where you can specify how many characters you want to assign to the task.ControlsUse your mouse or the arrow keys to scroll the map.Click on the left mouse button to move the characters.Other Crafting GamesTry The Farmer Craft, if you enjoy playing Colony Simulator. In this 3D farming simulator game, you take control of a farm and reside in a forest. This is a farm, after all, and you have a lot of work ahead of you! You are a craftsman who makes the instruments he needs. Taking care of your animals for yearly productions is equally important as crafting the right tools for you and your farm.For other game options, look up the crafting games tag on OnlineGames.io by following the link. We're also looking forward to hearing from you in the comments section about the most interesting thing you've crafted or built while playing the game!This article was updated on November 28, 20241 Player3DAdventureCraftingDefenseFreeMinecraftSandboxSimulatorUnity",
  "extractedAt": "2025-06-10T06:16:21.037Z",
  "localThumbnail": "Colony Simulator_1749536181038.jpg"
}