{
  "url": "https://www.onlinegames.io/conquer-kingdoms/",
  "title": "Conquer Kingdoms",
  "category": "/t/adventure/",
  "thumbnail": "https://www.onlinegames.io/media/posts/969/conquer-kigdoms-online.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/969/conquer-kigdoms-online.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/969/responsive/conquer-kigdoms-online-xs.jpg 384w, https://www.onlinegames.io/media/posts/969/responsive/conquer-kigdoms-online-sm.jpg 600w, https://www.onlinegames.io/media/posts/969/responsive/conquer-kigdoms-online-md.jpg 768w, https://www.onlinegames.io/media/posts/969/responsive/conquer-kigdoms-online-lg.jpg 1200w",
    "alt": "Conquer Kingdoms Play Online",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://cloud.onlinegames.io/games/2025/unity/conquer-kingdoms/index-og.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "How to Play Conquer Kingdoms"
      },
      {
        "type": "h2",
        "text": "Tips & Tricks to Conquer Kingdoms"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "Online Kingdom Games"
      }
    ],
    "controls": [
      "Move Troops: Use WASD or the arrow keys to walk, or click and drag your mouse.Thunder Strike: Press the Spacebar to call down a huge bolt of lightning.Zoom In/Out: Scroll with your mouse wheel to view the map from close up or far away."
    ],
    "howToPlay": "In Conquer Kingdoms, you begin with a squad of five soldiers. They’ll follow your every move, so guide them into unknown territory to battle the red-armored foes. Once you triumph, treasure chests await you, as their king, just walk over them to pick them up. But keep in mind, your army members can also act as servants to carry your loot, which means fewer fighters if you face another enemy. So don’t get greedy! Bring your treasure home regularly so you can expand and strengthen your domain. Once you’ve collected chests, head to your Treasury. There, you can turn all that loot into coins, which will come in handy for forging better gear.\n\nIf your team is defeated, you can resurrect at your castle. Your castle is the heart of your kingdom. Heal up your crew here and upgrade it to unlock bigger battles and grander conquests. But any chests you were carrying while battle will remain where you fell. Don’t worry, gather some upgrades, rebuild your army, and head back for revenge. It’s all part of becoming a stronger king in this fun free game online. Lastly, the Forge to craft sturdier armor, sharpen your weapons, and even recruit more soldiers for your growing army.",
    "tips": "If you carry too many chests, you’ll lack soldiers for defense. Return to base more often for safe deposits. Or else, boost your carrying capacity by upgrading the castle’s flag. More storage means more treasure you can lug back home before needing to refill your ranks.Keep an eye on the temple’s energy meter. Once it’s full, head over for a prayer and earn the power to call down a devastating lightning strike. Timing is key, use this shock-and-awe ability when you face especially tricky battles with dragons.Focus on forging better armor and weapons early on. A sturdy army is more valuable than other fancy upgrades you might not need right away.While roaming the map, watch out for small golden pouches. These random drops can give you a little bump in resources exactly when you need it.If you lose a battle and drop your treasure, take the time to reinforce your forces and attack again. The treasure will still be there!",
    "developer": "This awesome kingdom-building game was crafted by FreezeNova. They’re known for creating high quality browser games.",
    "similarGames": []
  },
  "fullContent": "Home› StrategyConquer KingdomsBy OnlineGames.ioReady to play a 3D strategy adventure like Clash of Clans on your browser? Meet Conquer Kingdoms, a free online game that puts you in charge of a fearless king and his five trusty soldiers. You’ll explore lands, collect treasures, and battle with enemies to build your kingdom. Strap on your crown, pick up your sword, and let the conquest begin. Enjoy this game online, build your dream fortress, and fight for every inch of territory you can claim. Your kingdom awaits so go forth and conquer!ControlsMove Troops: Use WASD or the arrow keys to walk, or click and drag your mouse.Thunder Strike: Press the Spacebar to call down a huge bolt of lightning.Zoom In/Out: Scroll with your mouse wheel to view the map from close up or far away.How to Play Conquer KingdomsIn Conquer Kingdoms, you begin with a squad of five soldiers. They’ll follow your every move, so guide them into unknown territory to battle the red-armored foes. Once you triumph, treasure chests await you, as their king, just walk over them to pick them up. But keep in mind, your army members can also act as servants to carry your loot, which means fewer fighters if you face another enemy. So don’t get greedy! Bring your treasure home regularly so you can expand and strengthen your domain. Once you’ve collected chests, head to your Treasury. There, you can turn all that loot into coins, which will come in handy for forging better gear.If your team is defeated, you can resurrect at your castle. Your castle is the heart of your kingdom. Heal up your crew here and upgrade it to unlock bigger battles and grander conquests. But any chests you were carrying while battle will remain where you fell. Don’t worry, gather some upgrades, rebuild your army, and head back for revenge. It’s all part of becoming a stronger king in this fun free game online. Lastly, the Forge to craft sturdier armor, sharpen your weapons, and even recruit more soldiers for your growing army.Tips & Tricks to Conquer KingdomsIf you carry too many chests, you’ll lack soldiers for defense. Return to base more often for safe deposits. Or else, boost your carrying capacity by upgrading the castle’s flag. More storage means more treasure you can lug back home before needing to refill your ranks.Keep an eye on the temple’s energy meter. Once it’s full, head over for a prayer and earn the power to call down a devastating lightning strike. Timing is key, use this shock-and-awe ability when you face especially tricky battles with dragons.Focus on forging better armor and weapons early on. A sturdy army is more valuable than other fancy upgrades you might not need right away.While roaming the map, watch out for small golden pouches. These random drops can give you a little bump in resources exactly when you need it.If you lose a battle and drop your treasure, take the time to reinforce your forces and attack again. The treasure will still be there!DeveloperThis awesome kingdom-building game was crafted by FreezeNova. They’re known for creating high quality browser games.Online Kingdom GamesIf Conquer Kingdoms sparks your love for action, strategy, and epic army showdowns, then check out other hits like State io Wars and Stick Guys Defense. Each delivers its own spin on conquering lands and defending your base. These browser games are also fun to play and give you plenty of fresh challenges.This article was updated on March 21, 20251 Player3DAdventureArmyBattleFreeStrategyWar",
  "extractedAt": "2025-06-10T05:10:05.615Z",
  "localThumbnail": "Conquer Kingdoms_1749532205615.jpg"
}