{
  "url": "https://www.onlinegames.io/crazy-strike-force/",
  "title": "Crazy Strike Force",
  "category": "/t/action/",
  "thumbnail": "https://www.onlinegames.io/media/posts/366/Crazy-Strike-Force-Controls.webp",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/366/Crazy-Strike-Force-Controls.webp",
    "srcset": "https://www.onlinegames.io/media/posts/366/responsive/Crazy-Strike-Force-Controls-xs.webp 384w, https://www.onlinegames.io/media/posts/366/responsive/Crazy-Strike-Force-Controls-sm.webp 600w, https://www.onlinegames.io/media/posts/366/responsive/Crazy-Strike-Force-Controls-md.webp 768w, https://www.onlinegames.io/media/posts/366/responsive/Crazy-Strike-Force-Controls-lg.webp 1200w",
    "alt": "Crazy Strike Force Controls",
    "width": 750,
    "height": 224,
    "className": "is-loaded",
    "parentClass": "post__image post__image--center is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2023/unity/crazy-strike-force/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "What armors are available in Crazy Strike Force?"
      },
      {
        "type": "h2",
        "text": "How can I change my nickname? Where can I see my gaming history?"
      },
      {
        "type": "h2",
        "text": "How can I earn gold in Crazy Strike Force?"
      },
      {
        "type": "h2",
        "text": "How to create a room in Crazy Strike Force?"
      },
      {
        "type": "h3",
        "text": "🔞 Important Notice"
      }
    ],
    "controls": [
      "WASD or arrow keys:  MoveLeft click: FireRight click: AimSpace: JumpQ: Slide while runningC: CrouchLeft shift: Run1, 2, 3: Change between weaponsE or F:  Interact or pick up a weaponG: Throw dynamiteH: Use medkitT: ChatL: Toggle cursor lockHold Tab: Show the scoreboardEscape: Pause"
    ],
    "howToPlay": "",
    "tips": "",
    "developer": "",
    "similarGames": []
  },
  "fullContent": "Home› First Person ShooterCrazy Strike ForceBy OnlineGames.ioMake Game Full ScreenJoin the ultimate battle competition in the Crazy Strike Force game. You can customize your character with a unique style and resist opponents. With a great selection of weapons, you will be able to shoot anybody. The enemies must be taken down, and do not hesitate to create your own strategy. ControlsWASD or arrow keys:  MoveLeft click: FireRight click: AimSpace: JumpQ: Slide while runningC: CrouchLeft shift: Run1, 2, 3: Change between weaponsE or F:  Interact or pick up a weaponG: Throw dynamiteH: Use medkitT: ChatL: Toggle cursor lockHold Tab: Show the scoreboardEscape: PauseWhat armors are available in Crazy Strike Force?There are more than 20 armors in Crazy Strike Force. Most knowns are Magnum, MP5K, M870, SC-AR, MGL, Tommy, M4A1, AWP and Crossbow…Additional skills will also increase damage against opponents and protect your life. Some of them are Quickdraw ammo, silence walker, samurai, UAV Ghost, and Sitrep. You will be able to choose between kill messages after slaughtering your enemy.How can I change my nickname? Where can I see my gaming history? Go to the profile section to change the nickname, and load/save the code. You can replace your current load code with another load with a higher value. You can follow your gaming history details, such as K/D rate, games played, scores, wins, headshots, knife kills, etc. in the profile section. How can I earn gold in Crazy Strike Force?You can earn gold and diamonds by watching ads. Rewarded ads will bring you +5000 gold and +1000 diamonds. You may also get a loot box having 500-2000 diamonds inside.How to create a room in Crazy Strike Force?You can begin a game by joining a room made by other players or create a room yourself. To create a room, you must give a name to the room and decide on the maximum number of players. After that, choose the game mode, round time, bot count, and map.🔞 Important NoticeThis game features content intended for a mature audience, including action-packed scenes, violence, or strong language. If you're sensitive to such material, we recommend checking out our other free online games.This article was updated on March 17, 20253DActionArmorBattleBattle RoyaleCrazyFirst Person ShooterFreeGunShootingUnityWarWeapon",
  "extractedAt": "2025-06-10T04:12:14.264Z",
  "localThumbnail": "Crazy Strike Force_1749528734264.jpg"
}