{
  "url": "https://www.onlinegames.io/crazy-drifter/",
  "title": "Crazy Drifter",
  "category": "/t/car/",
  "thumbnail": "https://www.onlinegames.io/media/posts/314/Crazy-Drifter-Keyboard-Controls.webp",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/314/Crazy-Drifter-Keyboard-Controls.webp",
    "srcset": "https://www.onlinegames.io/media/posts/314/responsive/Crazy-Drifter-Keyboard-Controls-xs.webp 384w, https://www.onlinegames.io/media/posts/314/responsive/Crazy-Drifter-Keyboard-Controls-sm.webp 600w, https://www.onlinegames.io/media/posts/314/responsive/Crazy-Drifter-Keyboard-Controls-md.webp 768w, https://www.onlinegames.io/media/posts/314/responsive/Crazy-Drifter-Keyboard-Controls-lg.webp 1200w",
    "alt": "Crazy Drifter Keyboard Controls",
    "width": 750,
    "height": 224,
    "className": "is-loaded",
    "parentClass": "post__image post__image--center is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2022/unity3/crazy-drifter/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Game Controls"
      },
      {
        "type": "h2",
        "text": "Garage"
      },
      {
        "type": "h2",
        "text": "Tips and Tricks"
      },
      {
        "type": "h2",
        "text": "Similar Games"
      }
    ],
    "controls": [
      "Just like other racing games, Crazy Drifter is very simple and enjoyable to play.",
      "Use WASD keys or the Arrow keys to steer your carUse the Spacebar to use handbrakeUse the Left Shift to boostUse the C key to change the camera viewUse the R key to respawn"
    ],
    "howToPlay": "",
    "tips": "This game will be competitive. Prepare yourself for this. There are some strategies to get ahead of other vehicles.\n\nYou will be in the flowing traffic while racing with other cars on the streets. This is good on the one hand and bad on the other. You have a high risk of hitting other vehicles and getting left behind. However, you can also get ahead by squeezing the cars you are racing against with cars flowing in traffic.Since the game aims to drift, the vehicles are thrown a lot when maneuvered left and right. And the map you are racing on has some sharp twists and turns. It may be best for you to adjust your speed and steering wheel well around curves and slow down your speed from time to time. Remember that steering control is your biggest weapon in this game.",
    "developer": "",
    "similarGames": [
      {
        "title": "Drift Hunters Pro",
        "url": "https://www.onlinegames.io/drift-hunters-pro/"
      }
    ]
  },
  "fullContent": "Home› DriftCrazy DrifterBy OnlineGames.ioMake Game Full ScreenThe streets are calling you! Crazy Drifter is a racing simulator game where you tend to drift often. This game is a different breath of racing games. I am sure you will be addicted to the adrenaline this game causes you to release! It offers you four different racing options with different gaming experiences: Drift, Time Attack, Knockout and Circuit. Choose the one that suits you the best and join the race! The streets have something to suffer from you…Game ControlsJust like other racing games, Crazy Drifter is very simple and enjoyable to play.Use WASD keys or the Arrow keys to steer your carUse the Spacebar to use handbrakeUse the Left Shift to boostUse the C key to change the camera viewUse the R key to respawnGarageYou will earn money as you play the game and win races. Your best investment option with the money you earn is to either buy a new car or modify your existing one. Or buy the most expensive car in the garage and change it. Crazy Drifter offers you five different vehicles and lots of modification features. Below, you will find what you can modify in Crazy Drifter:PaintCageHoodFront BumperSplitterSide SkirtBack BumperSpoilerExhaustTips and TricksThis game will be competitive. Prepare yourself for this. There are some strategies to get ahead of other vehicles.You will be in the flowing traffic while racing with other cars on the streets. This is good on the one hand and bad on the other. You have a high risk of hitting other vehicles and getting left behind. However, you can also get ahead by squeezing the cars you are racing against with cars flowing in traffic.Since the game aims to drift, the vehicles are thrown a lot when maneuvered left and right. And the map you are racing on has some sharp twists and turns. It may be best for you to adjust your speed and steering wheel well around curves and slow down your speed from time to time. Remember that steering control is your biggest weapon in this game.Similar GamesIf you like playing Crazy Drifter, you should definitely try Drift Hunters Pro. Check out the Drift Games on OnlineGames.io for more options.Embed URL:https://www.onlinegames.io/games/2022/unity3/crazy-drifter/index.htmlThis article was updated on February 22, 20241 Player3DCarCrashCrazyDriftDrivingEmbeddableFreeRacingSimulatorSpeedStunt",
  "extractedAt": "2025-06-10T05:24:07.660Z",
  "localThumbnail": "Crazy Drifter_1749533047661.jpg"
}