{
  "url": "https://www.onlinegames.io/crazy-roll/",
  "title": "Crazy Roll",
  "category": "/new-games/",
  "thumbnail": "https://www.onlinegames.io/media/posts/600/Crazy-Roll.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/600/Crazy-Roll.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/600/responsive/Crazy-Roll-xs.jpg 384w, https://www.onlinegames.io/media/posts/600/responsive/Crazy-Roll-sm.jpg 600w, https://www.onlinegames.io/media/posts/600/responsive/Crazy-Roll-md.jpg 768w, https://www.onlinegames.io/media/posts/600/responsive/Crazy-Roll-lg.jpg 1200w",
    "alt": "Crazy Roll Free Online Game",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2021/unity2/crazy-roll/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "How to Play Crazy Roll"
      },
      {
        "type": "h3",
        "text": "Get New Balls"
      },
      {
        "type": "h3",
        "text": "Power-Ups in Crazy Roll"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Other Running Games"
      }
    ],
    "controls": [
      "Use the A/D or Left/Right arrow keys to steer the ball."
    ],
    "howToPlay": "Begin playing by pressing the Space key. The ball will automatically start running on a platform in shades of yellow.Your main aim is to run the longest distance each time you try. Break your own running records.Along the way, you will face many obstacles. Contact with them causes you to lose.In addition, try not to fall while you are moving along at a high speed.It is an endless run, but as you make progress, you will see leveling-ups. Things get more challenging as you level up!",
    "tips": "",
    "developer": "",
    "similarGames": []
  },
  "fullContent": "Home› BallCrazy RollBy OnlineGames.ioMake Game Full Screen Crazy Roll is a 3D bouncing ball game where you, in the shape of a basketball, move along on a fast-paced platform. There is no end to this game. Run as much as you can. You must count on your reflexes as you encounter many obstacles on the platform. Try not to hit any objects or fall. Otherwise, you will fail the game inspired by the popular Slope! 🏀How to Play Crazy RollBegin playing by pressing the Space key. The ball will automatically start running on a platform in shades of yellow.Your main aim is to run the longest distance each time you try. Break your own running records.Along the way, you will face many obstacles. Contact with them causes you to lose.In addition, try not to fall while you are moving along at a high speed.It is an endless run, but as you make progress, you will see leveling-ups. Things get more challenging as you level up!Get New BallsCollect diamonds on the road while you are running. These diamonds will enable you to buy yourself new balls from the Shop section. There are many ball types here. You can find a red basketball, beach ball, football, and even a golf ball. The most expensive ball is the earth-shaped ball. Unlocking this ball can be your ultimate goal in this arcade game!Power-Ups in Crazy RollGetting power-ups with your diamonds also helps you a lot while making progress. There are 3 power-ups: Shield, Magnet and the X2 Multiplier.The Shield will guard you to not hit any object running.The Magnet will pull all the diamonds around toward your ball.Finally, the X2 Multiplier will double the diamonds you are collecting.Here is a little tip for you: you can mix your power-ups. For example, you may activate the Magnet and the X2 Multiplier simultaneously and get all the diamonds near you doubled up.ControlsUse the A/D or Left/Right arrow keys to steer the ball.Other Running GamesIf you love playing Crazy Roll, you may try Electron Dash. It is another game where you run on a blue-colored tunnel. While you are running, you will encounter lasers and gaps. Do not fall from the gaps and get hit by red lasers!For more options, you may look up other ball games on OnlineGames.io by tapping on the link. You can find many amusing games online for free on the site!This article was updated on January 28, 20251 Player3DActionArcadeAvoidBallCrazyEndlessFreeFunParkourSkillSpeedUnity",
  "extractedAt": "2025-06-10T06:15:15.841Z",
  "localThumbnail": "Crazy Roll_1749536115842.jpg"
}