{
  "url": "https://www.onlinegames.io/crazy-stickman-physics/",
  "title": "Crazy Stickman Physics",
  "category": "/new-games/",
  "thumbnail": "https://www.onlinegames.io/media/posts/715/Crazy-Stickman-Physics.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/715/Crazy-Stickman-Physics.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/715/responsive/Crazy-Stickman-Physics-xs.jpg 384w, https://www.onlinegames.io/media/posts/715/responsive/Crazy-Stickman-Physics-sm.jpg 600w, https://www.onlinegames.io/media/posts/715/responsive/Crazy-Stickman-Physics-md.jpg 768w, https://www.onlinegames.io/media/posts/715/responsive/Crazy-Stickman-Physics-lg.jpg 1200w",
    "alt": "Crazy Stickman Physics Online Game",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2023/construct/185/crazy-stickman-physics/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Overview of Crazy Stickman Physics"
      },
      {
        "type": "h3",
        "text": "Make the Hardest Hit"
      },
      {
        "type": "h3",
        "text": "Unlock New Jumping Settings"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "What is More?"
      }
    ],
    "controls": [
      "Desktops and Laptops",
      "Left-Click (drag and drop): Jump",
      "Mobile Devices",
      "Use the touchscreen to jump."
    ],
    "howToPlay": "",
    "tips": "",
    "developer": "FreezeNova developed Crazy Stickman Physics.",
    "similarGames": []
  },
  "fullContent": "Home› StickmanCrazy Stickman PhysicsBy OnlineGames.ioMake Game Full ScreenFind the perfect position and make your stickman jump! Crazy Stickman Physics is a 2D stickman game where your utmost challenge is to break as many bones as you can. Earn coins as you break your stickman's bones.Use your money to unlock new settings and purchase vehicles and outfits for your ragdoll. Find the perfect pose and get the highest scores in this arcade game! Let's see if you can deliver the most brutal hit.Overview of Crazy Stickman PhysicsStart by customizing your stickman's physical appearance. You can choose your favorite color from the coloring bar. Our favorite is neon green!As you earn coins, you can get various hats, a cap or a headphone and accessories such as a guitar or a sword.Next, you are ready to break bones. At the beginning, there are three settings to throw your stickman off.After selecting one of them, your job is to find the perfect position to jump your stickman.There are four unique jumping positions. Choose the one that makes the best hit, and you will reach the top of the platform!Make the Hardest HitIf you want to break every bone of your ragdoll, you must strive to make the hardest hit. It's crucial to find the proper jumping position and swing it violently. Additionally, acquiring a vehicle to severely strike the ground will help you get the highest scores.Click and drag the arrow on the screen to make your ragdoll jump from the top of the platform. When you release the left click, the ragdoll will start to move forward in the relevant direction.Unlock New Jumping SettingsYou have the option to unlock new kinds of settings in this stickman game. There are seven jumping platforms to unlock; each comes with unique objects, enabling you to break many more bones.While some can be accessed with accumulated coins, others require reaching certain levels. New platforms will undoubtedly increase your enjoyment of this arcade game!ControlsDesktops and LaptopsLeft-Click (drag and drop): JumpMobile DevicesUse the touchscreen to jump.DeveloperFreezeNova developed Crazy Stickman Physics.What is More?You may also try playing Stickman Destruction. In this game, you will try to tear your virtual ragdoll character apart. Hit it from left to right until all its bones are broken!View other online stickman games on OnlineGames.io for more options. There are many free online games to enjoy on the site. Moreover, you will always find new and thrilling games if you stay tuned!Embed URL:https://www.onlinegames.io/games/2023/construct/185/crazy-stickman-physics/index.htmlThis article was updated on August 7, 20241 Player2DCrashCrazyDestroyEmbeddableFreeHTML5MobileMousePhysicsStickman",
  "extractedAt": "2025-06-10T06:11:04.018Z",
  "localThumbnail": "Crazy Stickman Physics_1749535864019.jpg"
}