{
  "url": "https://www.onlinegames.io/crazy-plane-landing/",
  "title": "Crazy Plane Landing",
  "category": "/t/3d/",
  "thumbnail": "https://www.onlinegames.io/media/posts/999/crazy-plane-landing.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/999/crazy-plane-landing.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/999/responsive/crazy-plane-landing-xs.jpg 384w, https://www.onlinegames.io/media/posts/999/responsive/crazy-plane-landing-sm.jpg 600w, https://www.onlinegames.io/media/posts/999/responsive/crazy-plane-landing-md.jpg 768w, https://www.onlinegames.io/media/posts/999/responsive/crazy-plane-landing-lg.jpg 1200w",
    "alt": "Crazy Plane Landing Free",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://html5.gamedistribution.com/fd8ad948b534420caced19c62764019f/?gd_sdk_referrer_url=https://www.onlinegames.io/crazy-plane-landing/",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Launch and Fly"
      },
      {
        "type": "h2",
        "text": "Upgrade Planes"
      },
      {
        "type": "h2",
        "text": "Developer"
      }
    ],
    "controls": [
      "Left Click & Hold: Fire the plane down the ramp and keep holding to burn boost fuel.A / D Keys or mouse move: Steer left or right for mid-air steering and barrel rolls."
    ],
    "howToPlay": "",
    "tips": "",
    "developer": "BoomBit S.A. built Crazy Plane Landing. Another cool game by them is Super Hero Driving School. When you’re ready for a different kind of sky adventure, you can also pop any of our plane games online. But start with Crazy Plane Landing to get the hang of boosting, rolling, and landing like a pro.",
    "similarGames": []
  },
  "fullContent": "Home› AirplaneCrazy Plane LandingBy OnlineGames.ioMake Game Full ScreenPaper-airplanes and daydreams, but this time louder. Crazy Plane Landing is a 3D stunt flight game where you launch a plane off a ramp, try to keep it in one piece and land on the runway. Until you arrive at the finish, every barrel roll, every extra meter adds to your payout. Spend those coins on a beefier Engine, a longer Boost, or a bigger Bonus multiplier, then keep chasing that distant finish line on different terrains. Play free, right in your web browser, on OnlineGames.io, no installs, just click and fly. (And try to land. In one piece.)ControlsLeft Click & Hold: Fire the plane down the ramp and keep holding to burn boost fuel.A / D Keys or mouse move: Steer left or right for mid-air steering and barrel rolls.Launch and FlyHold the mouse button as the countdown hits zero. The boost bar drains fast. You can also tap it in pulses instead of one long blast.Use A and D to tilt. A barrel roll scores coins. If you over-rotate, you’ll kiss the canyon wall.The green boost bar is your lifeline. Spend it too early and you’ll stall before the landing strip. Spend it too late and you might overshoot the target entirely.A checkered runway marks the end of each level. Cross it on your wheels and move on to the next level. Clear the levels from sun-baked canyons to snowy peaks, coastal cliffs, or neon city nights. Each new scene resets the finish line even farther out.Upgrade PlanesAfter landing (or crashing), the game tots up distance, stunts, and landing quality. Longer flights plus flashier rolls equal bigger rewards.Three upgrade cards sit under your plane:Engine: Adds raw speed off the ramp.Boost: Extends the fuel bar so you stay airborne longer.Bonus: Multiplies every coin you earn, making later runs pay off faster.Prices climb each level. Engine Level 5 costs more than Engine 4, so plan your spending. When you’ve saved enough, swap in a sleeker jet. New planes start basic but scale higher, letting you push way past your old records.DeveloperBoomBit S.A. built Crazy Plane Landing. Another cool game by them is Super Hero Driving School. When you’re ready for a different kind of sky adventure, you can also pop any of our plane games online. But start with Crazy Plane Landing to get the hang of boosting, rolling, and landing like a pro.This article was updated on May 8, 20251 Player3DAirplaneFlyingFreeSimulatorStunt",
  "extractedAt": "2025-06-10T05:58:53.767Z",
  "localThumbnail": "Crazy Plane Landing_1749535133766.jpg"
}