{
  "url": "https://www.onlinegames.io/dark-ninja-hanjo/",
  "title": "Dark Ninja Hanjo",
  "category": "/t/adventure/",
  "thumbnail": "https://www.onlinegames.io/media/posts/451/Dark-Ninja-Hanjo.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/451/Dark-Ninja-Hanjo.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/451/responsive/Dark-Ninja-Hanjo-xs.jpg 384w, https://www.onlinegames.io/media/posts/451/responsive/Dark-Ninja-Hanjo-sm.jpg 600w, https://www.onlinegames.io/media/posts/451/responsive/Dark-Ninja-Hanjo-md.jpg 768w, https://www.onlinegames.io/media/posts/451/responsive/Dark-Ninja-Hanjo-lg.jpg 1200w",
    "alt": "Dark Ninja Hanjo Play Online",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2023/unity/dark-ninja-hanjo/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "How to Play Dark Ninja Hanjo?"
      },
      {
        "type": "h3",
        "text": "Following the Sensei's Instructions"
      },
      {
        "type": "h3",
        "text": "Purple Beams"
      },
      {
        "type": "h3",
        "text": "Free the Mythical Phoenix"
      },
      {
        "type": "h3",
        "text": "Store"
      },
      {
        "type": "h3",
        "text": "Characters"
      },
      {
        "type": "h3",
        "text": "Weapons"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "More Games Like This"
      }
    ],
    "controls": [
      "Use the WASD or the arrow keys to moveUse the Space key to jumpUse the Left mouse button to attackUse the Right mouse button to use the projectileUse the R key to change the projectileUse the X key to Special MoveUse the E key to change the weaponUse the T key to change the powerUse the C key to change the camera viewUse the P key to pause"
    ],
    "howToPlay": "Click on the \"Play\" pane from the main menu and proceed to the level selection section. There are 15 levels taking place in deserted areas. Then, start the game by choosing the level you want to play.",
    "tips": "",
    "developer": "",
    "similarGames": []
  },
  "fullContent": "Home› ActionDark Ninja HanjoBy OnlineGames.ioMake Game Full Screen The city was destroyed. Dark Ninja Hanjo is an adventure game where you explore and try to recover this ruined city. But it will take a lot of work. You need to recover the ancient scroll first to be able to make it happen. You must follow the clues, complete the missions and fight enemies when necessary.How to Play Dark Ninja Hanjo?Click on the \"Play\" pane from the main menu and proceed to the level selection section. There are 15 levels taking place in deserted areas. Then, start the game by choosing the level you want to play.Following the Sensei's InstructionsSensei will guide you along this path. He will send you to the destroyed city to find out what happened. He warns you to be aware of your surroundings because you never know what will happen in this deserted city.Purple BeamsFollowing Sensei's instructions, you will encounter very high purple beams. Sensei will ask you to investigate these. The enemies cast spells to extract the scrolls. These purple beams belong to those spells. You have to stop the Extractor from extracting the scrolls.Free the Mythical PhoenixThe enemies captured the soul core of the Mythical Phoenix. You need to get it back. To do this, you need to destroy 2 UzunaWolf. This will be a challenging war.StoreSuppose you want to change your character's appearance and weapons or buy ammunition and energy. In that case, you can personalize your character and game by clicking on the \"Store\" section from the main menu. Especially, purchasing ammunition from here that you can attack from a distance, such as Shurikens, will make your job much easier on some levels.CharactersHeavenly WolfFlash HayateDemon TsukanaShinobi AshuraWeaponsKatanasDual KatanasFistsArrow BowSpearControlsUse the WASD or the arrow keys to moveUse the Space key to jumpUse the Left mouse button to attackUse the Right mouse button to use the projectileUse the R key to change the projectileUse the X key to Special MoveUse the E key to change the weaponUse the T key to change the powerUse the C key to change the camera viewUse the P key to pauseMore Games Like ThisGive a chance to Blocky Parkour Ninja, where you jump between blocks as a ninja, if you love playing ninja games. Or, you may look for other adventure and action games on OnlineGames.io for more alternatives.Embed URL:https://www.onlinegames.io/games/2023/unity/dark-ninja-hanjo/index.htmlThis article was updated on February 20, 20241 Player3DActionAdventureCombatEmbeddableFreeNinjaUnity",
  "extractedAt": "2025-06-10T05:09:20.576Z",
  "localThumbnail": "Dark Ninja Hanjo_1749532160576.jpg"
}