{
  "url": "https://www.onlinegames.io/darkness-survivors/",
  "title": "Darkness Survivors",
  "category": "/new-games/",
  "thumbnail": "https://www.onlinegames.io/media/posts/696/Darkness-Survivors.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/696/Darkness-Survivors.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/696/responsive/Darkness-Survivors-xs.jpg 384w, https://www.onlinegames.io/media/posts/696/responsive/Darkness-Survivors-sm.jpg 600w, https://www.onlinegames.io/media/posts/696/responsive/Darkness-Survivors-md.jpg 768w, https://www.onlinegames.io/media/posts/696/responsive/Darkness-Survivors-lg.jpg 1200w",
    "alt": "Darkness Survivors Online Game",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2024/q2/darkness-survivors/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Darkness Survivors Overview"
      },
      {
        "type": "h3",
        "text": "Lady Elowen or Daerian the Red?"
      },
      {
        "type": "h3",
        "text": "Level Up Your Hero"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "What’s Next?"
      }
    ],
    "controls": [
      "Desktops and Laptops",
      "WASD or the Arrow Keys: MoveLeft-Click: To SelectYou can also use the mouse and drag your hero in any direction to move.",
      "Mobile Devices",
      "Use the virtual joystick to move your hero."
    ],
    "howToPlay": "",
    "tips": "",
    "developer": "QKY Game Studios developed Darkness Survivors.",
    "similarGames": []
  },
  "fullContent": "Home› CombatDarkness SurvivorsBy OnlineGames.ioMake Game Full ScreenAre you ready to battle with the darkness minions? Darkness Survivors is a 2D action game where you try to remove dark creatures from the battlefield. You have various hero characters to choose from.Just decide whether you want to slay them using a sword, boomerangs or other weapons. Then, choose your hero and enter the battlefield in this RPG game. Don’t forget to collect dropped diamonds on the field!Darkness Survivors OverviewYour main objective in this action game is to clear as many dark minions from the arena as you can.However, before entering the arena, you must choose your hero from four unique protagonists, each with specific abilities.Select your preferred hero and begin slaying the evil creatures!When you enter the arena, all those creatures will start approaching you.Direct your hero and make him or her aim at these minions well. Your hero automatically attacks them.Remember that collecting the coins will enable you to get enhancements from the Amulet Shop.Lady Elowen or Daerian the Red?When you click the “Play” button, the hero selection menu will open.There are four protagonists here. Two of these heroes are women, and two are men.Their names are Lady Elowen, Rob the Ranger, Ravenna Fireheart and Daeriean the Red.Lady Elowen is a woman who loves her sword very much, especially at night.Rob the Ranger is a handsome man with his sharp knives.Ravenna Fireheart always looks for an opportunity to use her boomerangs.Daerian the Red is an old wise man who is into magic and spells.Level Up Your HeroAs you slay the dark minions, they will drop diamonds and coins. You must collect them to level up your hero. When the level bar turns blue, you can proceed to the next level, which offers three perk options.These options can be Stoneward, Money Bag or Iron Arrow. You will see a brief information about them besides the perks. You can make your choice according to the features of them.ControlsDesktops and LaptopsWASD or the Arrow Keys: MoveLeft-Click: To SelectYou can also use the mouse and drag your hero in any direction to move.Mobile DevicesUse the virtual joystick to move your hero.DeveloperQKY Game Studios developed Darkness Survivors.What’s Next?Soul Essence Adventure may also draw your attention. In the game, you must help your hero to escape from a spooky castle full of enemies. Get rid of them and find the exit!Look up other online action games on OnlineGames.io for further options. Our community is constantly trying to add new thrilling games on the site. Please contact us if you have any suggestions or a wish list!Embed URL:https://www.onlinegames.io/games/2024/q2/darkness-survivors/index.htmlThis article was updated on February 19, 20251 Player2DActionArcadeBattleCombatEmbeddableFreeHeroHTML5PixelRPGSurvivalWeapon",
  "extractedAt": "2025-06-10T06:11:38.710Z",
  "localThumbnail": "Darkness Survivors_1749535898710.jpg"
}