{
  "url": "https://www.onlinegames.io/darts-hit/",
  "title": "Darts Hit",
  "category": "/t/sports/",
  "thumbnail": "https://www.onlinegames.io/media/posts/655/Darts-Hit-Online.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/655/Darts-Hit-Online.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/655/responsive/Darts-Hit-Online-xs.jpg 384w, https://www.onlinegames.io/media/posts/655/responsive/Darts-Hit-Online-sm.jpg 600w, https://www.onlinegames.io/media/posts/655/responsive/Darts-Hit-Online-md.jpg 768w, https://www.onlinegames.io/media/posts/655/responsive/Darts-Hit-Online-lg.jpg 1200w",
    "alt": "Darts Hit Online Game",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2021/4/darts-hit/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "How to Play Darts Hit"
      },
      {
        "type": "h3",
        "text": "The Purple Board"
      },
      {
        "type": "h3",
        "text": "Boss Fights"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "Similar Browser Games"
      }
    ],
    "controls": [
      "Left-Click or Tap: Shoot"
    ],
    "howToPlay": "In each stage, you will have a certain number of darts. The number of them is changeable. You must send all the shafts you have in your hand to the rotating board. You can move to the next stage when you send all of them successfully without two shafts colliding.From time to time, you will see apples on the board. Aim at the apples, as getting them will allow you to get new shafts.View your shaft options from the shop section by clicking the sword icon.",
    "tips": "",
    "developer": "Darts Hit was developed by FreezeNova.",
    "similarGames": [
      {
        "title": "Archery Master",
        "url": "https://www.onlinegames.io/archery-master/"
      }
    ]
  },
  "fullContent": "Home› SportsDarts HitBy OnlineGames.ioMake Game Full ScreenDarts Hit is a 2D sports game where you try to shoot on a rotating board until you have no darts left. Make sure no two darts overlap on the board. Otherwise, you will lose the game. In addition, targeting the apples on the board will earn you those apples, enabling you to unlock new kinds of shafts in this game, similar to the iconic mobile game aa.How to Play Darts HitIn each stage, you will have a certain number of darts. The number of them is changeable. You must send all the shafts you have in your hand to the rotating board. You can move to the next stage when you send all of them successfully without two shafts colliding.From time to time, you will see apples on the board. Aim at the apples, as getting them will allow you to get new shafts.View your shaft options from the shop section by clicking the sword icon.The Purple BoardThe purple board will be constantly revolving to the left and right. To fool you, it will slow down and suddenly start moving in the opposite direction now and then. Sometimes, it will start moving backward before making a complete turn.Keep your eyes wide open before sending your needles. Calculate the movements of the purple board for successful shots. In later levels, things will get more complicated!Boss FightsAfter successfully passing every four stages, you will participate in boss fight challenges. Remember that these fight stages can be a bit more difficult than the casual ones. For example, after making a quarter turn, the board may suddenly turn in the opposite direction.Additionally, the board will differ in each boss fight stage. It can turn into a CD or a barrel. Besides getting the apples, defeating boss fights will also allow you to unlock unique shafts such as Genesis and Colossus.ControlsLeft-Click or Tap: ShootDeveloperDarts Hit was developed by FreezeNova.Similar Browser GamesIf you like playing Darts Hit, you may also give a chance to Archery Master. It is a dart-like sports game where you try to hit the bullseye. Take your arrow from the bow and send it to the middle. Get the highest scores possible! For further game options, you may look up other online sports games on OnlineGames.io by following the link.We constantly add new and thrilling free online games on Online Games to offer many options to our players. If you have any suggestions or wishes, please contact us!This article was updated on May 9, 20241 Player2DArcadeFreeFunMobileMouseSports",
  "extractedAt": "2025-06-10T05:54:24.483Z",
  "localThumbnail": "Darts Hit_1749534864484.jpg"
}