{
  "url": "https://www.onlinegames.io/dockyard-tank-parking/",
  "title": "Dockyard Tank Parking",
  "category": "/new-games/",
  "thumbnail": "https://www.onlinegames.io/media/posts/603/Dockyard-Tank-Parking.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/603/Dockyard-Tank-Parking.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/603/responsive/Dockyard-Tank-Parking-xs.jpg 384w, https://www.onlinegames.io/media/posts/603/responsive/Dockyard-Tank-Parking-sm.jpg 600w, https://www.onlinegames.io/media/posts/603/responsive/Dockyard-Tank-Parking-md.jpg 768w, https://www.onlinegames.io/media/posts/603/responsive/Dockyard-Tank-Parking-lg.jpg 1200w",
    "alt": "Dockyard Tank Parking Free Online Game",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2021/unity/dockyard-tank-parking/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "How to Play Dockyard Tank Parking"
      },
      {
        "type": "h3",
        "text": "Avoid Collisions"
      },
      {
        "type": "h3",
        "text": "Game Map: Dockyard"
      },
      {
        "type": "h3",
        "text": "What should I do if my tank turns upside down?"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "Similar Driving Games"
      }
    ],
    "controls": [
      "Use the WASD or the Arrow keys to steer the tank.Use the Left Mouse button to shoot a tank shell.You may also use the Spacebar key for firing.Use the C key to change the camera view.Use the ESC key to pause."
    ],
    "howToPlay": "Get into the seat of your machine and start to drive! You must follow the reddish arrow to go to the blue areas. Before getting to the zone, you must pass these blue halos one by one. You will see two red Ferraris when you arrive at the parking lot. Park your car carefully in the area between these two cars. It may sound simple, but parking the vehicle will be arduous as you level up.\n\nThere are 44 unique levels to achieve. Levels get more complicated as you make progress.You can view how much time you spend to pass a specific level from the level selection screen.You can also see how many stars you passed a particular level with from the same section.",
    "tips": "",
    "developer": "Dockyard Tank Parking is created by FreezeNova.",
    "similarGames": [
      {
        "title": "Monster Truck City Parking",
        "url": "https://www.onlinegames.io/monster-truck-city-parking/"
      }
    ]
  },
  "fullContent": "Home› TankDockyard Tank ParkingBy OnlineGames.io Dockyard Tank Parking is a 3D tank driving game where you steer a huge machine and try to park it in the specified parking area. It is one of the most unusual parking games. Fitting the giant tank into a narrow zone will not be that easy! You must park it into the zone properly to move to the next level. 🚧How to Play Dockyard Tank ParkingGet into the seat of your machine and start to drive! You must follow the reddish arrow to go to the blue areas. Before getting to the zone, you must pass these blue halos one by one. You will see two red Ferraris when you arrive at the parking lot. Park your car carefully in the area between these two cars. It may sound simple, but parking the vehicle will be arduous as you level up.There are 44 unique levels to achieve. Levels get more complicated as you make progress.You can view how much time you spend to pass a specific level from the level selection screen.You can also see how many stars you passed a particular level with from the same section.Avoid CollisionsTo pass a level with three stars, you should avoid collisions with pontons or cars. Each contact with them will cause you to lose a star. You can target the cars and shoot them if you want, but you should not collide.Game Map: DockyardYou will move along on a dockyard full of shiploads. You will see colossal transport ships on the rough sea. You may wonder how they brought this giant machine here. It is also carried by a ship. Steering a car on the sea level will be very enjoyable!What should I do if my tank turns upside down?You do not need to be alarmed at all! The game will automatically return the machine to its former state. You just need to wait a few seconds. Once the vehicle is fixed, you can continue on your way.ControlsUse the WASD or the Arrow keys to steer the tank.Use the Left Mouse button to shoot a tank shell.You may also use the Spacebar key for firing.Use the C key to change the camera view.Use the ESC key to pause.DeveloperDockyard Tank Parking is created by FreezeNova.Similar Driving GamesIf you enjoy playing Dockyard Tank Parking, you may also try Monster Truck City Parking. You must park your giant truck in the designated area. To reach the zone, follow the pink halos throughout the city streets. Properly fitting the huge vehicle into a tight area will be your utmost challenge!For more options, you may look for other driving games online on OnlineGames.io by clicking on the link. If you have any suggestions or wishes, please contact us!Embed URL:https://www.onlinegames.io/games/2021/unity/dockyard-tank-parking/index.htmlThis article was updated on February 20, 20241 Player3DArmorCrazyDrivingEmbeddableFreeParkingShootingSimulatorTankUnity",
  "extractedAt": "2025-06-10T06:14:54.547Z",
  "localThumbnail": "Dockyard Tank Parking_1749536094549.jpg"
}