{
  "url": "https://www.onlinegames.io/drift-king/",
  "title": "Drift King",
  "category": "/t/car/",
  "thumbnail": "https://www.onlinegames.io/media/posts/729/Drift-King.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/729/Drift-King.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/729/responsive/Drift-King-xs.jpg 384w, https://www.onlinegames.io/media/posts/729/responsive/Drift-King-sm.jpg 600w, https://www.onlinegames.io/media/posts/729/responsive/Drift-King-md.jpg 768w, https://www.onlinegames.io/media/posts/729/responsive/Drift-King-lg.jpg 1200w",
    "alt": "Drift King Online",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2024/unity/drift-king/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "How To Play Drift King"
      },
      {
        "type": "h2",
        "text": "Explore Garage"
      },
      {
        "type": "h2",
        "text": "Multiplayer Drifting"
      },
      {
        "type": "h2",
        "text": "More Games Like Drift King"
      }
    ],
    "controls": [
      "WASD or arrow keys: Move car M: Rearview MirrorC: Change CarneraR: Reset CarU: Toggle between KMH and MPHI: Start/Stop EngineP: Fullscreen"
    ],
    "howToPlay": "The traditional approach in a car game would be to give zero cash to the player at the beginning. This means waiting and playing for a long time to use any cool feature a game might offer. However, we told you Drift King is different. Here's a step-by-step guide to get you started.\n\nDrift King puts 30,000 coins in your pocket, right as you enter the game. This allows you to buy most of the cars in the garage, upgrade the parts, and tune them as you like before you.So, our suggestion is to first hang out in the garage a bit. Find the car you like the most, explore upgrades and tuning options. If you're not sure how to tune your car, find our complete guide on tuning. Then move on to maps. You have six options in the maps section. Select a map that will describe your drifting experience, your environment preferences, and what you expect from the game.Some of maps have racetracks while some are long countryside roads with slight curves. It's up to you.If you spawn onto the map, now aim for the longest drift. Keep the speed high and perform manji drifts and donuts. Or go freestyle and follow the curves of the road while leaving S-shaped marks behind you.",
    "tips": "",
    "developer": "",
    "similarGames": []
  },
  "fullContent": "Home› DriftDrift KingBy OnlineGames.ioMake Game Full Screen Drift King stands out among online drift games, offering a unique experience where you can witness the smoke you leave behind from the rearview window. This game surrounds you in every realistic detail, from its premium 3D visuals to the choice of 10 sports cars and 6 maps.The comprehensive tuning options further enhance the game, making it a complete package for drifting enthusiasts.ControlsWASD or arrow keys: Move car M: Rearview MirrorC: Change CarneraR: Reset CarU: Toggle between KMH and MPHI: Start/Stop EngineP: FullscreenHow To Play Drift KingThe traditional approach in a car game would be to give zero cash to the player at the beginning. This means waiting and playing for a long time to use any cool feature a game might offer. However, we told you Drift King is different. Here's a step-by-step guide to get you started.Drift King puts 30,000 coins in your pocket, right as you enter the game. This allows you to buy most of the cars in the garage, upgrade the parts, and tune them as you like before you.So, our suggestion is to first hang out in the garage a bit. Find the car you like the most, explore upgrades and tuning options. If you're not sure how to tune your car, find our complete guide on tuning. Then move on to maps. You have six options in the maps section. Select a map that will describe your drifting experience, your environment preferences, and what you expect from the game.Some of maps have racetracks while some are long countryside roads with slight curves. It's up to you.If you spawn onto the map, now aim for the longest drift. Keep the speed high and perform manji drifts and donuts. Or go freestyle and follow the curves of the road while leaving S-shaped marks behind you.Explore GarageIn the garage, there are a bunch of options to customize your car to your liking.You can upgrade car parts such as the engine, turbo, gearbox, handling, and weight.Paint your car in any color you likeTune front and rear heights and cambers, and adjust brake sensitivity. Buy cool wheels with your in-game currency.Multiplayer DriftingOne of the coolest features Drift King has its multiplayer rooms. After you select multiplayer mode, enter your nickname, choose a map and create a room to hang out with your drifter friends. Race with each other, make drifting competitions or chase after each other to experience crashes and chaos.  More Games Like Drift KingFor an ultimate drifting experience, you should try Drift Hunters 2—an epic game with even more maps and cars in the garage. But be warned, making combos in that game is not as easy as in Drift King. Take up this challenge and drive adrift. Have fun on OnlineGames.io, mates!Embed URL:https://www.onlinegames.io/games/2024/unity/drift-king/index.htmlThis article was updated on February 24, 20253DCarCrazyDriftDrivingEmbeddableFreeMultiplayerSimulatorSpeedUnity",
  "extractedAt": "2025-06-10T05:20:07.222Z",
  "localThumbnail": "Drift King_1749532807222.jpg"
}