{
  "url": "https://www.onlinegames.io/drift-rider/",
  "title": "Drift Rider",
  "category": "/t/car/",
  "thumbnail": "https://www.onlinegames.io/media/posts/553/Drift-Rider-Controls.webp",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/553/Drift-Rider-Controls.webp",
    "srcset": "https://www.onlinegames.io/media/posts/553/responsive/Drift-Rider-Controls-xs.webp 384w, https://www.onlinegames.io/media/posts/553/responsive/Drift-Rider-Controls-sm.webp 600w, https://www.onlinegames.io/media/posts/553/responsive/Drift-Rider-Controls-md.webp 768w, https://www.onlinegames.io/media/posts/553/responsive/Drift-Rider-Controls-lg.webp 1200w",
    "alt": "Drift Rider controls",
    "width": 750,
    "height": 224,
    "className": "is-loaded",
    "parentClass": "post__image post__image--center is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2023/unity3/drift-rider/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "How to Play Drift Rider"
      },
      {
        "type": "h3",
        "text": "Parts Section"
      },
      {
        "type": "h3",
        "text": "Tuning Section"
      },
      {
        "type": "h3",
        "text": "Paint Section"
      },
      {
        "type": "h3",
        "text": "Purchase New Cars"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Similar Games"
      }
    ],
    "controls": [
      "To steer the vehicle, use the Arrow or WASD keys.To brake, press the Space key.To reset the vehicle, press the R key.To make the screen larger, press the P key.To switch the camera view, press the C key.To toggle mirror view, press M key."
    ],
    "howToPlay": "The aim of Drift Rider is to make the longest drifts and earn coins. When you reach a certain speed, suddenly applying the brakes causes your vehicle to drift.\n\nWith the coins you earned, customize and tune your vehicle fully. Customizing your car is the coolest part of drifting games like this. To improve the look and performance of the auto, head over the Parts, Tuning, and Paints sections from the main menu.",
    "tips": "",
    "developer": "",
    "similarGames": [
      {
        "title": "Madalin Stunt Cars Pro",
        "url": "https://www.onlinegames.io/madalin-stunt-cars-pro/"
      }
    ]
  },
  "fullContent": "Home› DriftDrift RiderBy OnlineGames.ioMake Game Full ScreenDrift Rider is a 3D drift game where the players can customize their vehicle and then hit the road. There are 5 distinct racetracks that the player can drift on. You may drive on a highway or in the streets of a city.Or, take the task of navigating a curving and narrow intercity route by drifting. This game will increase your adrenaline level! Take control of your vehicle and challenge your driving skills in one of the drift games with the highest graphic quality.How to Play Drift RiderThe aim of Drift Rider is to make the longest drifts and earn coins. When you reach a certain speed, suddenly applying the brakes causes your vehicle to drift.With the coins you earned, customize and tune your vehicle fully. Customizing your car is the coolest part of drifting games like this. To improve the look and performance of the auto, head over the Parts, Tuning, and Paints sections from the main menu.Parts SectionYou can improve the performance of your car with the modifications you make in the Parts area. For instance, you can improve the car's turbocharger, engine and rear wheels in this part. We can say that the improvements you will make here are three-level.The primary strength of the car part is at Stock level. You can take this power up to Street, Racing and Pro.Tuning SectionYou can adjust your car's brake and height-lowness settings under the Tuning section. Attempt to give your automobile a rebellious appearance by adjusting the back height. Here, you can modify the following. If you'd like to learn the best tuning settings for drifting, read our full guide on drifting.Front HeightRear HeightFront CamberRear CamberBrake BalanceBrake PressurePaint SectionThe Paint section is our favorite section, with the most options. In the Paint section, select the color of your automobile and wheels! You have quite a large color spectrum. Above all, you can choose whether your car will have a glossy, matte, metallic, or chrome finish.Purchase New CarsIn addition to customizing your vehicle, this game allows you to purchase 10 vehicles. You can find the most popular sports cars and even a Rolls Royce among them.You can invest the money you earn by drifting via purchasing a new vehicle. You can find the automobiles in the Cars section of the main menu.ControlsTo steer the vehicle, use the Arrow or WASD keys.To brake, press the Space key.To reset the vehicle, press the R key.To make the screen larger, press the P key.To switch the camera view, press the C key.To toggle mirror view, press M key.Similar GamesIf you found playing Drift Rider enjoyable, you should definitely try Madalin Stunt Cars Pro. It has superb visuals for realistic experiences. In the game, you can select from a variety of vehicles ranging from the most luxurious sports cars to a police cruiser.Or, you may look up other free drifting games on OnlineGames.io for more options. Keep checking the website to get fast access to the newest and most thrilling drift games!Embed URL:https://www.onlinegames.io/games/2023/unity3/drift-rider/index.htmlThis article was updated on September 2, 20241 Player3DCarCrazyDriftDrivingEmbeddableFreeSimulatorUnity",
  "extractedAt": "2025-06-10T05:23:36.550Z",
  "localThumbnail": "Drift Rider_1749533016550.jpg"
}