{
  "url": "https://www.onlinegames.io/drunken-duel/",
  "title": "Drunken Duel",
  "category": "/t/action/",
  "thumbnail": "https://www.onlinegames.io/media/posts/698/Drunken-Duel.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/698/Drunken-Duel.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/698/responsive/Drunken-Duel-xs.jpg 384w, https://www.onlinegames.io/media/posts/698/responsive/Drunken-Duel-sm.jpg 600w, https://www.onlinegames.io/media/posts/698/responsive/Drunken-Duel-md.jpg 768w, https://www.onlinegames.io/media/posts/698/responsive/Drunken-Duel-lg.jpg 1200w",
    "alt": "Drunken Duel Online Game",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2024/code/2/drunken-duel/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "How to Play Drunken Duel"
      },
      {
        "type": "h2",
        "text": "Standing Hard or Hardly Standing?"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "More Games Like Drunken Duel"
      }
    ],
    "controls": [
      "Computers",
      "Left Player: W key to shootRight Player: Up arrow key to shoot",
      "Mobile Devices",
      "Use touchscreen buttons"
    ],
    "howToPlay": "The game starts after choosing the game mode. You can play against AI or pick 2P mode to challenge a friend.There is only one button for each player, and it is for shooting. The W key is for the left player, and the up arrow is for the right.While drunks' arms are swinging in the air, find the perfect angle to shoot down the opponent.Shooting once is not enough to eliminate the enemy. But there is an exception: a single headshot will make you win the round.Keep track of your health bar at the top of the screen; the one with an empty health bar loses the round.Succeed in 5 rounds to win the game.",
    "tips": "",
    "developer": "Neplin Games Studio created this game.",
    "similarGames": []
  },
  "fullContent": "Home› CombatDrunken DuelBy OnlineGames.ioMake Game Full ScreenThese two guys are wasted! No wonder a minor conflict at the table about who will finish the bottle first, turned into a huge deal. Even though these ragdolls are having problems standing up, they insist on making a duel. Take some lessons from this incident, and never drink and duel in real life, folks! Though, it is kind of hilarious to control and watch these two guys in a virtual setting.Welcome to the Drunken Duel game, where you'll constantly LoL with your friend, trying to shoot each other with spinning arms and weak legs.Drunken Duel is a ragdoll shooting game with dummy physics. The aim is to score five times by shooting your opponent to win the duel. You can play the game either against AI or against a friend on the same device. Take your opponent down. We'll not give you a medal, but you can chase the euphoria of victory after all that drinking!How to Play Drunken DuelThe game starts after choosing the game mode. You can play against AI or pick 2P mode to challenge a friend.There is only one button for each player, and it is for shooting. The W key is for the left player, and the up arrow is for the right.While drunks' arms are swinging in the air, find the perfect angle to shoot down the opponent.Shooting once is not enough to eliminate the enemy. But there is an exception: a single headshot will make you win the round.Keep track of your health bar at the top of the screen; the one with an empty health bar loses the round.Succeed in 5 rounds to win the game.  Standing Hard or Hardly Standing?Drunk ragdolls are standing hardly. They're on the verge of sleeping it off. However, touching the ground doesn't mean you lose the game. Instead, it's an opportunity to showcase your resilience. You can still stand up using the firepower.To regain your footing, try to shoot downward. The recoil from the gunshots will ease standing up.Keep in mind that every shot fired is a gamble in this game. And every movement is a risk. Embrace the unpredictable physics of the Drunken Duel, and don't be afraid to experiment with new tactics.Explore how shooting leftward and backward will result in ragdolls' moves. Break bottles and lamps, release your inner fury, and have fun in this duel!ControlsComputersLeft Player: W key to shootRight Player: Up arrow key to shootMobile DevicesUse touchscreen buttonsDeveloperNeplin Games Studio created this game.More Games Like Drunken DuelIf you nurse a grudge, take your revenge in other 2 player games online. Combat, race, or score against each other. OnlineGames.io has a variety of titles to satisfy your hunger for revenge. Bookmark this website and come back to see recent releases!This article was updated on May 9, 20242 Player2DActionArcadeBattleCombatFreeFunFunnyHTML5PhysicsStickman",
  "extractedAt": "2025-06-10T04:13:02.495Z",
  "localThumbnail": "Drunken Duel_1749528782496.jpg"
}