{
  "url": "https://www.onlinegames.io/electron-dash/",
  "title": "Electron Dash",
  "category": "/t/running/",
  "thumbnail": "https://www.onlinegames.io/media/posts/464/Electron-Dash.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/464/Electron-Dash.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/464/responsive/Electron-Dash-xs.jpg 384w, https://www.onlinegames.io/media/posts/464/responsive/Electron-Dash-sm.jpg 600w, https://www.onlinegames.io/media/posts/464/responsive/Electron-Dash-md.jpg 768w, https://www.onlinegames.io/media/posts/464/responsive/Electron-Dash-lg.jpg 1200w",
    "alt": "Electron Dash Play Online",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2023/mjs/electron-dash/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "How to Play Electron Dash"
      },
      {
        "type": "h3",
        "text": "Red Lasers"
      },
      {
        "type": "h3",
        "text": "Gaps in The Tunnel"
      },
      {
        "type": "h3",
        "text": "Hearts on The Road"
      },
      {
        "type": "h3",
        "text": "Light-Colored Platforms"
      },
      {
        "type": "h3",
        "text": "Helpful Tips for Electron Dash"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Similar Games"
      }
    ],
    "controls": [
      "Use the A and D keys or the Left and Right arrow keys to moveUse the W, Upper arrow key or the Space key to jump"
    ],
    "howToPlay": "Electron Dash is an endless game in which the blue tunnel has no end. Your primary mission here is to get a higher score. You are racing against yourself here. Break your own record and reach new experiences every time you play.",
    "tips": "You must consider the steps you take while moving on the platform. You should not allow yourself to fall into any void.It would be beneficial to avoid light-colored platforms as much as possible. You should try to progress on more solid platforms.As you go through the tunnel, things will get more intense. Therefore, it may be good to move by combining some skills with each other, such as jumping while moving left and right.",
    "developer": "",
    "similarGames": [
      {
        "title": "Geometry Dash",
        "url": "https://www.onlinegames.io/geometry-dash/"
      }
    ]
  },
  "fullContent": "Home› EndlessElectron DashBy OnlineGames.ioMake Game Full Screen Shall we go for a run in space with you? Electron Dash is a fast-paced running game where you run through a blue-colored tunnel. While running in this tunnel, you will encounter some obstacles, such as lasers and the gaps between the layers of the tunnel. You must not fall through these gaps; otherwise, you will lose. Let's get started if you are ready!How to Play Electron DashElectron Dash is an endless game in which the blue tunnel has no end. Your primary mission here is to get a higher score. You are racing against yourself here. Break your own record and reach new experiences every time you play.Red LasersAs you run through the tunnel, you will encounter red lasers. It is important that you do not touch these. You must overcome them by jumping over them and running left and right. Otherwise, you will lose the game.Gaps in The TunnelAnother obstacle you will encounter in the tunnel is the gaps in the tunnels. No one wants to slip through them and disappear into the void of space. So pay attention here. Sometimes, while you are running, the layers of the tunnel disappear synchronously, allowing you to slide through this gap. You have to run with full caution.Hearts on The RoadOf course, you will not only encounter obstacles as you progress on the road. You'll also see power-ups with heart icons. If you collect these, you can respawn when you lose the game.Light-Colored PlatformsAdditionally, we can give you an essential tip. Watch out for the light-colored platforms because as soon as you step on them, they will disappear. You need to act quickly.Helpful Tips for Electron DashYou must consider the steps you take while moving on the platform. You should not allow yourself to fall into any void.It would be beneficial to avoid light-colored platforms as much as possible. You should try to progress on more solid platforms.As you go through the tunnel, things will get more intense. Therefore, it may be good to move by combining some skills with each other, such as jumping while moving left and right.ControlsUse the A and D keys or the Left and Right arrow keys to moveUse the W, Upper arrow key or the Space key to jumpSimilar GamesTry Geometry Dash, a top-rated arcade game where you run as a cube with a synchronized rhythm of the music if you enjoy playing Electron Dash. Or you may look for other arcade game collections on OnlineGames.io by following the link.This article was updated on January 28, 20251 Player3DArcadeAvoidEndlessFreeHexagonParkourRunningSkillSpace",
  "extractedAt": "2025-06-10T05:51:27.705Z",
  "localThumbnail": "Electron Dash_1749534687705.jpg"
}