{
  "url": "https://www.onlinegames.io/electric-man-2/",
  "title": "Electric Man 2",
  "category": "/new-games/",
  "thumbnail": "https://www.onlinegames.io/media/posts/708/Electric-Man-2-Online.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/708/Electric-Man-2-Online.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/708/responsive/Electric-Man-2-Online-xs.jpg 384w, https://www.onlinegames.io/media/posts/708/responsive/Electric-Man-2-Online-sm.jpg 600w, https://www.onlinegames.io/media/posts/708/responsive/Electric-Man-2-Online-md.jpg 768w, https://www.onlinegames.io/media/posts/708/responsive/Electric-Man-2-Online-lg.jpg 1200w",
    "alt": "Electric Man Online Game",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2024/flash/electric-man-2/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "About This Game"
      },
      {
        "type": "h3",
        "text": "Stickman's Attacking Figures"
      },
      {
        "type": "h3",
        "text": "Moves in Slow-Motion"
      },
      {
        "type": "h3",
        "text": "How many rounds are there in Electric Man 2?"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "Discover More Games"
      }
    ],
    "controls": [
      "Left-Right Arrows: RunDown Arrow: DodgeA: PunchS: KickD: GrabQ: Slow-Motion PunchE: Slow-Motion GrabW: Slow-Motion Kick"
    ],
    "howToPlay": "",
    "tips": "",
    "developer": "Damien Clarke developed Electric Man 2.",
    "similarGames": []
  },
  "fullContent": "Home› FlashElectric Man 2By OnlineGames.ioMake Game Full ScreenShow your martial arts and street fighting skills in the Tournament of Voltagen! Electric Man 2 is a 2D stickman game in which you combat odd ragdolls in various environments.The ragdolls will try to attack you with all their might. Kick and punch them until their health bar drops to zero. Be the champion in this stickman universe in this action game!About This GameWe recommend that you take part in tutorials if this is your first time playing.However, before entering the tutorials, you need to create your stickman!Choose a name for your character and then choose its color.Additionally, you can determine its skill level from easy to pro.Then press the \"Enter\" button to learn the basics of the Electric Man 2 in the Voltagen training course.After taking your lessons, you will see the Round 1 menu with four unique matches.You must pass each match successfully by defeating the electric fighters to unlock new rounds.Stickman's Attacking FiguresYour stickman character has many attacking figures, which he has learned from the streets.He can perform severe punches and kicks. He also has the power to knock his opponents off their feet.Make him move by using the left and arrow keys. To dodge their attacks, press the down arrow key.We would also like to say that you can go for combinations in attack styles.For example, pressing the D key while running towards an electric fighter will throw him into the air.But make sure he doesn't fall on you when you throw him. Otherwise, he will hurt you by his weight.Moves in Slow-MotionYour stickman can perform slow-motion moves in combat in addition to regular attack moves. The Q, W and E keys allow you to act slowly. However, keep in mind that although such moves take more health, they consume battery points.It means that your character cannot take such actions all the time. He needs to wait until the battery is recharged. But it is worth waiting for the charging, thanks to the severe damage rate caused by slow actions.How many rounds are there in Electric Man 2?There are 19 rounds of combat in Electric Man 2. Each has unique electric fighters with different abilities. To win the Tournament of Voltagen, you must defeat them all in each match of 19 rounds.ControlsLeft-Right Arrows: RunDown Arrow: DodgeA: PunchS: KickD: GrabQ: Slow-Motion PunchE: Slow-Motion GrabW: Slow-Motion KickDeveloperDamien Clarke developed Electric Man 2.Discover More GamesGet On Top may also interest you. It is a two-player game in which you can wrestle with a friend or against the computer. Try to get on top and make your opponent's head hit the ground!View free online stickman games on OnlineGames.io for more alternatives. And please bookmark this website to discover new and thrilling online games easily!This article was updated on July 8, 20241 Player2DActionBattleCombatCrazyFlashFreeStickman",
  "extractedAt": "2025-06-10T06:11:20.510Z",
  "localThumbnail": "Electric Man 2_1749535880511.jpg"
}