{
  "url": "https://www.onlinegames.io/elite-racing/",
  "title": "Elite Racing",
  "category": "/t/car/",
  "thumbnail": "https://www.onlinegames.io/media/posts/666/Elite-Racing.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/666/Elite-Racing.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/666/responsive/Elite-Racing-xs.jpg 384w, https://www.onlinegames.io/media/posts/666/responsive/Elite-Racing-sm.jpg 600w, https://www.onlinegames.io/media/posts/666/responsive/Elite-Racing-md.jpg 768w, https://www.onlinegames.io/media/posts/666/responsive/Elite-Racing-lg.jpg 1200w",
    "alt": "Elite Racing Online Game",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://unblocked-games.s3.amazonaws.com/games/elite-racing/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "How to Play Elite Racing"
      },
      {
        "type": "h3",
        "text": "Vehicle Selection: Inferno or Enigma?"
      },
      {
        "type": "h3",
        "text": "Track Selection: Five Game Modes"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "More Games Like This"
      }
    ],
    "controls": [
      "WASD or the Arrow Keys: MoveLeft-Shift: NitroSpacebar: BrakeTab/ESC: PauseQ/E/C/V Keys: Change Camera View"
    ],
    "howToPlay": "In this racing game, you will create your gaming experience by your choices. Start by determining the race type and track in which you will participate.There are four amazing tracks, each with unique turning points and scenes. After the track selection, it's time to determine the game mode.The Circuit, LapKnockout, SpeedTrap, Elimination and Drift modes call you to experience each of them.You have the option to set the number of the laps and AI racers besides the difficulty level.If you've made all the settings, it's time to hit the track!",
    "tips": "",
    "developer": "Elite Racing was developed by FreezeNova.",
    "similarGames": []
  },
  "fullContent": "Home› RacingElite RacingBy OnlineGames.ioMake Game Full ScreenElite Racing is a 3D racing game where you can engage in races of many kinds against AI competitors. There are many race tracks, vehicle options and game modes to enjoy. All you need to do is select your car, choose your favorite track, and decide on your game mod. Then you can set off in one of the most exciting car games!How to Play Elite RacingIn this racing game, you will create your gaming experience by your choices. Start by determining the race type and track in which you will participate.There are four amazing tracks, each with unique turning points and scenes. After the track selection, it's time to determine the game mode.The Circuit, LapKnockout, SpeedTrap, Elimination and Drift modes call you to experience each of them.You have the option to set the number of the laps and AI racers besides the difficulty level.If you've made all the settings, it's time to hit the track!Vehicle Selection: Inferno or Enigma?There are 13 sports cars in the car game. Each comes with unique features and names. Their top speed, acceleration, handling and braking powers are variable. The Lotus Sport, Vulture and Cobra are accessible in the beginning. But the remaining vehicles are waiting for you to unlock them. Be the winner of the races and get CRs to buy new cars. Our favorite? The Enigma is our most beloved car among the options, as we love not only its power but also its design.Track Selection: Five Game ModesThe game offers you different racing experiences with its five unique game modes. Each comes with distinctive requirements. For example, you must break the highest drifting record among the other AI racers to be the winner of the Drift mode. On the other hand, the SpeedTrap mode requires you to pass the speed point at top speed. We will give you the names of the game modes below.CircuitLapKnockoutSpeedTrapEliminationDriftControlsWASD or the Arrow Keys: MoveLeft-Shift: NitroSpacebar: BrakeTab/ESC: PauseQ/E/C/V Keys: Change Camera ViewDeveloperElite Racing was developed by FreezeNova.More Games Like ThisIf you enjoy playing Elite Racing, you may also like Drift Fury. Your passion for speed reaches its peak in this driving game. Get in your car and start drifting on the winding roads with palm trees and mountain views.For further options, you may look up the online racing games tag on OnlineGames.io by following the link. If you have any suggestions or a wishlist, please don't hesitate to contact us! Online Games will always offer you new kinds of free browser games that match your desires.This article was updated on September 2, 20241 Player3DCarDriftDrivingFreeRacingSimulatorSpeedUnity",
  "extractedAt": "2025-06-10T05:28:18.188Z",
  "localThumbnail": "Elite Racing_1749533298189.jpg"
}