{
  "url": "https://www.onlinegames.io/endless-siege/",
  "title": "Endless Siege",
  "category": "/t/strategy/",
  "thumbnail": "https://www.onlinegames.io/media/posts/744/Endless-Siege.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/744/Endless-Siege.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/744/responsive/Endless-Siege-xs.jpg 384w, https://www.onlinegames.io/media/posts/744/responsive/Endless-Siege-sm.jpg 600w, https://www.onlinegames.io/media/posts/744/responsive/Endless-Siege-md.jpg 768w, https://www.onlinegames.io/media/posts/744/responsive/Endless-Siege-lg.jpg 1200w",
    "alt": "Endless Siege Play Online",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2024/more/endless-siege/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "How to Play Endless Siege"
      },
      {
        "type": "h2",
        "text": "Understanding the Towers"
      },
      {
        "type": "h2",
        "text": "Creating Turret Strategies"
      },
      {
        "type": "h3",
        "text": "Release Date"
      },
      {
        "type": "h3",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "You May Also Like"
      }
    ],
    "controls": [
      "Desktops and Laptops : Use the left mouse button to select and place towersMobile Devices: Use the touchscreen to place towers"
    ],
    "howToPlay": "Buy and locate defense towers along the way of enemies coming in waves. Place them strategically and block them from entering your castle. You begin with 20 lives; each enemy leaking into the castle will decrease your lives by one. Destroy them all on their way and defend your people no matter what.Learn more about how to level up, upgrade or strategize in the game below.",
    "tips": "",
    "developer": "RavalMatic developed Endless Siege.",
    "similarGames": []
  },
  "fullContent": "Home› Tower DefenseEndless SiegeBy OnlineGames.ioMake Game Full ScreenEndless Siege is a free online defense game where enemies come in never-ending waves. Locate towers and weapons, upgrade them and strategize to protect your territory from invaders.ControlsDesktops and Laptops : Use the left mouse button to select and place towersMobile Devices: Use the touchscreen to place towersHow to Play Endless SiegeBuy and locate defense towers along the way of enemies coming in waves. Place them strategically and block them from entering your castle. You begin with 20 lives; each enemy leaking into the castle will decrease your lives by one. Destroy them all on their way and defend your people no matter what.Learn more about how to level up, upgrade or strategize in the game below.Understanding the TowersThere are four types of towers with unique abilities in Endless Siege. These are Ballista, Torch, Cannon and Time Warper. You can buy each of them with 100, 150, 250 and 500 coins respectively. Once you purchase a tower, you should strategically locate it and check its properties. Each turret has at least three of the following abilities.DistanceDamageReload SpeedRangeExplosion RangeInflictedAs you progress in the Endless Siege, your enemies will get more and more powerful, bringing a new level of difficulty. So you need to level up your turrets using your gold coins.Once you reach level 10, you can upgrade them. Upgrades are costly, but they will turn your weapons into entirely new, much more advanced towers. You can upgrade the tower up to the third level.Let's say you misplaced a defense tower and want to get rid of it. You can sell your towers to use the space for a more advanced weapon. Creating Turret StrategiesYou located your towers, leveled them up or even upgraded but still cannot defend your territory effectively. Then, you need a more in-depth strategy. Click on each weapon to decide on a plan for how the turret will attack. You have 2 choices to make in each turret: target and strategy.Target: You can choose to fix a weapon's target or not. If you select unfixed, towers can change the target when a closer/stronger enemy enters the field.Strategy: Decide on which enemy your turret will aim for. You can choose first, last, closest, weakest and strongest. Depending on where the enemies stand, you can dynamically change your settings during the siege. For example, if you placed a turret near your castle gate, it would be wiser to aim for the first enemy approaching.Another tip is to aim for the weakest with your lower-level weapons and aim for the strongest with the top-level turrets. This tip lets you use your resources more effectively.Release DateMarch 2021DeveloperRavalMatic developed Endless Siege.You May Also LikeIf you enjoy games like this, Hero Rush Tower Defense also deserves a chance. It is the most popular game in its category and is enjoyed by thousands of gamers worldwide. You can instantly play all games for free on OnlineGames.io. No download, installation or plug-in is needed. Have fun defending your tower!This article was updated on May 23, 20241 Player2DActionBattleDefenseFantasyFreeHTML5MobileMouseStrategyTower DefenseWarWeapon",
  "extractedAt": "2025-06-10T05:58:15.374Z",
  "localThumbnail": "Endless Siege_1749535095375.jpg"
}