{
  "url": "https://www.onlinegames.io/epic-mine/",
  "title": "Epic Mine",
  "category": "/t/adventure/",
  "thumbnail": "https://www.onlinegames.io/media/posts/927/epic-mine.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/927/epic-mine.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/927/responsive/epic-mine-xs.jpg 384w, https://www.onlinegames.io/media/posts/927/responsive/epic-mine-sm.jpg 600w, https://www.onlinegames.io/media/posts/927/responsive/epic-mine-md.jpg 768w, https://www.onlinegames.io/media/posts/927/responsive/epic-mine-lg.jpg 1200w",
    "alt": "Epic Mine Online Game",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://playhop.com/app/385148?utm_source=distrib&is-united-page=1&skip-guard=1&header=no&utm_medium=cristian-ovidiu&clid=8531463",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Start Mining"
      },
      {
        "type": "h3",
        "text": "Explore the Depths"
      },
      {
        "type": "h3",
        "text": "Gather Resources"
      },
      {
        "type": "h3",
        "text": "Craft Pickaxes"
      },
      {
        "type": "h3",
        "text": "Upgrade Skills"
      },
      {
        "type": "h3",
        "text": "Fight Powerful Bosses"
      },
      {
        "type": "h2",
        "text": "Dig to Save the World"
      }
    ],
    "controls": [
      "Use your mouse"
    ],
    "howToPlay": "",
    "tips": "",
    "developer": "",
    "similarGames": []
  },
  "fullContent": "Home› ClickerEpic MineBy OnlineGames.ioMake Game Full ScreenIn Epic Mine, the fate of the Earth rests in your hand (or rather, your trusty pickaxe and torch). The world is nearing its end, you survived waves of disasters and found a village with a few survivors. Luckily, they know a way to prevent the catastrophe. But, only a miner like you can do this. Reach the Earth's core and uncover the Key of the Gods. Villagers will help you in this epic mining journey, filled with treasure, danger, and mystery, as you smash through walls, collect resources, and build the tools you need to save the day!ControlsUse your mouseStart MiningYour journey begins in a quaint old village, where wise locals teach you the art of mining. Begin with your basic pickaxe and start chipping away at walls in the mines. Each wall you break will crumble into pieces, revealing valuable resources like ore and gems.Explore the DepthsUse dynamite for quicker destruction of tougher walls and obstacles. As you dig deeper, you'll uncover mysterious mines, spiders and catacombs filled with secrets. Be on the lookout for treasure chests hidden throughout the mines. These contain rare items and rewards.Gather ResourcesEvery wall you break provides resources. These materials are your key to progress. Visit the village to sell your findings and earn coins. You can only sell ores at the beginning, but the locksmith will teach you how to sell precious mines.Craft PickaxesWith over 50 unique pickaxes to collect, each has its own strengths and special abilities. Use the coins and materials you gather to craft new pickaxes or upgrade existing ones. When you find a good handle, visit the town's blacksmith, who'll craft the pickaxe for you. Stronger pickaxes allow you to dig deeper and break tougher walls with ease.Upgrade SkillsSome areas require special abilities or tools to access. So keep upgrading your abilities, such as strength, accuracy and luck! Unlock abilities to help you navigate the mines. Freeze walls to make them brittle, or use fire to melt through obstacles. These abilities can also help you during battles with powerful bosses like spiders.Daily missions add extra challenges and rewards to your adventure. Successfully completing missions will level up your character and improve your abilities. Build a unique skill set that suits your playstyle, whether it's focused on mining, combat, or exploration.Fight Powerful BossesAs you dig deeper, you'll encounter fearsome bosses guarding key areas. Use your upgraded pickaxes, dynamite, and magic to defeat them. Bosses drop rare loot and energy that's essential for progressing further into the mines.Your ultimate goal is to reach the Earth's center, where the Key of the Gods lies hidden. Along the way, rescue fellow miners trapped in the collapsing mines. Time is running out, and every level brings you closer to preventing the end of the world!Dig to Save the WorldEpic Mine is an crafting game where you go on an adventure to save the world! Dig deeper, craft better tools, and harness the power of magic as you battle your way to the Earth's core. Whether you're smashing walls, collecting treasures, or facing off against formidable bosses, the journey is as thrilling as the destination. Are you ready to take up the pickaxe and become the hero the world needs? Start mining today and uncover the epic secrets that await below! And hey, we'd like to know about your journey. Let us know what stage you're at in the comment section below.This article was updated on January 23, 20251 PlayerAdventureBlockClickerCraftingFreeMinecraft",
  "extractedAt": "2025-06-10T05:08:59.273Z",
  "localThumbnail": "Epic Mine_1749532139273.jpg"
}