{
  "url": "https://www.onlinegames.io/evil-santa/",
  "title": "Evil Santa",
  "category": "/t/arcade/",
  "thumbnail": "https://www.onlinegames.io/media/posts/539/Evil-Santa-Game.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/539/Evil-Santa-Game.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/539/responsive/Evil-Santa-Game-xs.jpg 384w, https://www.onlinegames.io/media/posts/539/responsive/Evil-Santa-Game-sm.jpg 600w, https://www.onlinegames.io/media/posts/539/responsive/Evil-Santa-Game-md.jpg 768w, https://www.onlinegames.io/media/posts/539/responsive/Evil-Santa-Game-lg.jpg 1200w",
    "alt": "Evil Santa Free Online Game",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2021/1/evil-santa/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Who is Santa Claus?"
      },
      {
        "type": "h2",
        "text": "How to Play Evil Santa?"
      },
      {
        "type": "h3",
        "text": "Weapons with Christmas Theme"
      },
      {
        "type": "h3",
        "text": "Enhance Your Gaming Experience"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Other Crazy Games"
      }
    ],
    "controls": [
      "Use your mouse click to beat evil St. Claus and save the true spirit of Christmas."
    ],
    "howToPlay": "Here's a Santa with a bad attitude. And there are many tools available to you to smash this man. You can use your bare hands, a gun, or run a train. Or, you can choose Christmas tree decorations. Keep checking his health from the bar at the bottom of the screen.",
    "tips": "",
    "developer": "",
    "similarGames": []
  },
  "fullContent": "Home› ChristmasEvil SantaBy OnlineGames.ioMake Game Full ScreenEvil Santa is one of the most stress-relieving Christmas games out there in which the player tries to smash the virtual Santa. This man was once a good man who was giving children gifts. But, he has turned from a gift-giver into a mischief-maker. Now that Christmas is approaching, he will appear again and do ugly things. Beat him and stop him from misbehaving!Who is Santa Claus?Legend has it that Santa Claus lives at the North Pole with a mysterious troupe of elves who help him make toys and gifts for children around the world on Christmas Eve night. He rides a sleigh pulled by a pack of alligators, dropping many presents there under decorated Christmas trees. It is said to enter homes through chimneys.How to Play Evil Santa?Here's a Santa with a bad attitude. And there are many tools available to you to smash this man. You can use your bare hands, a gun, or run a train. Or, you can choose Christmas tree decorations. Keep checking his health from the bar at the bottom of the screen.Weapons with Christmas ThemeThis game is so crazy that it offers you many different Christmas-themed tools to beat the virtual ho-ho man. You have many options that you can not even imagine.There is a section at the top of the game screen where you can see the weapon options. There are six symbols in the row to choose from, five of which are your weapons of choice. Press the final button to release the weapon you just captured.Gift PackagesSnowmanSleighPine treeTrainEnhance Your Gaming ExperienceWe can give you some advice to make your game more enjoyable.You will earn money as you level up and deal with Santa. Reveal your dark wit by using these coins with new weapons!If playing on the same background bores you, you can try different options. You have 4 different backgrounds. You may view these backgrounds by pressing the image icon at the bottom of the screen.ControlsUse your mouse click to beat evil St. Claus and save the true spirit of Christmas.Other Crazy GamesIf you enjoy playing Evil Santa, you may try Pumpkin Monster. It is another crazy game where you can unleash your dark humor by messing up with a monster in pumpkin shape. Or, you can give a chance to Kick the Dummy, where you beat the virtual robot with nuclear tools.For further game options, look at other online crazy games on OnlineGames.io. There are tons of games on our platform that you can enjoy. Please bookmark this page so you can simply return!Embed URL:https://www.onlinegames.io/games/2021/1/evil-santa/index.htmlThis article was updated on December 25, 20241 Player2DArcadeChristmasClickerCrazyDestroyEmbeddableFreeFunFunnyHTML5MobileMouseSandboxWeapon",
  "extractedAt": "2025-06-10T05:16:54.756Z",
  "localThumbnail": "Evil Santa_1749532614757.jpg"
}