{
  "url": "https://www.onlinegames.io/extreme-run-3d/",
  "title": "Extreme Run 3D",
  "category": "/t/action/",
  "thumbnail": "https://www.onlinegames.io/media/posts/839/Extreme-Run-3D.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/839/Extreme-Run-3D.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/839/responsive/Extreme-Run-3D-xs.jpg 384w, https://www.onlinegames.io/media/posts/839/responsive/Extreme-Run-3D-sm.jpg 600w, https://www.onlinegames.io/media/posts/839/responsive/Extreme-Run-3D-md.jpg 768w, https://www.onlinegames.io/media/posts/839/responsive/Extreme-Run-3D-lg.jpg 1200w",
    "alt": "Extreme Run 3D Play Online",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://html5.gamedistribution.com/332fed0d374c4401934cf5b19b7a85b1/?gd_sdk_referrer_url=https://www.onlinegames.io/extreme-run-3d/",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "How to Play Extreme Run 3D"
      },
      {
        "type": "h2",
        "text": "Extreme Run 3D Levels Walkthrough"
      },
      {
        "type": "h3",
        "text": "Level 1: Learn Controls"
      },
      {
        "type": "h3",
        "text": "Level 2: Spikes"
      },
      {
        "type": "h3",
        "text": "Level 3: Hidden Walls"
      },
      {
        "type": "h3",
        "text": "Level 4: Circulars"
      },
      {
        "type": "h3",
        "text": "Level 5: Hammers"
      },
      {
        "type": "h3",
        "text": "Level 6: Lasers"
      },
      {
        "type": "h3",
        "text": "Level 7: Train"
      },
      {
        "type": "h3",
        "text": "Level 8: Run"
      },
      {
        "type": "h3",
        "text": "Level 9: Sink or Float"
      },
      {
        "type": "h3",
        "text": "Level 10: Kitchen Sink"
      },
      {
        "type": "h3",
        "text": "Level 11: Master of Sadism"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "More Running Games"
      }
    ],
    "controls": [
      "Left & Right Arrow Keys: Move left or rightUp Arrow/Spacebar: JumpC: Change camera angleH: Hide controls info"
    ],
    "howToPlay": "Begin with Level 1 to get a feel for the controls and the pace of the game. The ball moves at a steady speed, and your main objective is to dodge obstacles by either moving sideways or jumping over them.There are four difficulty levels: Easy, Medium, Hard, and Extreme.Each difficulty features 11 levels, with the speed and types of obstacles increasing as you progress.To beat the game, you'll need to master all 44 levels across these difficulties.If you can finish the first 11 levels, you've beaten the Easy mode—but there's still plenty more!",
    "tips": "",
    "developer": "AlienWebGames created Extreme Run 3D.",
    "similarGames": []
  },
  "fullContent": "Home› BallExtreme Run 3DBy OnlineGames.ioMake Game Full ScreenEver find yourself so immersed in a game that you start moving along with your character, shaking your legs and swaying side to side? Not every game pulls you in like that, but Extreme Run 3D does.Extreme Run 3D is one of the most fast-paced running games online. Take control of a rolling ball and face various obstacles as you race through 11 levels. The environment is designed to give you a VR-like experience without the headset. Start playing and test your reflexes now!ControlsLeft & Right Arrow Keys: Move left or rightUp Arrow/Spacebar: JumpC: Change camera angleH: Hide controls infoHow to Play Extreme Run 3DBegin with Level 1 to get a feel for the controls and the pace of the game. The ball moves at a steady speed, and your main objective is to dodge obstacles by either moving sideways or jumping over them.There are four difficulty levels: Easy, Medium, Hard, and Extreme.Each difficulty features 11 levels, with the speed and types of obstacles increasing as you progress.To beat the game, you'll need to master all 44 levels across these difficulties.If you can finish the first 11 levels, you've beaten the Easy mode—but there's still plenty more!Extreme Run 3D Levels WalkthroughEach level introduces new challenges to keep you on your toes. Here's a breakdown of what you can expect:Level 1: Learn ControlsThe easiest of the game, but still requires very fast reflexes. Get comfortable with movement and jumping. Hold the spacebar for longer jumps and reach the finish.Level 2: SpikesSharp spikes appear on the ground in this level. You must dodge and jump over them at the right time. If you jump on spikes, you need to start over the level.Level 3: Hidden WallsInvisible walls come out of nowhere, testing your memory and reflexes. Keep an eye on patterns to avoid getting trapped.Level 4: CircularsRed circular platforms rotate and shift, cutting through the ground. Your goal is to pass through the holes in these moving platforms. White circles on the screen mark your path, showing where it's safe to jump. Time your move carefully—when the white circles align with the holes in the red platforms, jump and pass through to the next section.Level 5: HammersHuge hammers that change direction when you jump! Watch out for the unpredictable swings and plan your jumps carefully to avoid getting crushed. This is one of the hardest and game changer obstacles of Extreme Run 3DLevel 6: LasersLaser lights beam across the path, creating barriers you must avoid. Quick reflexes are essential as you time your jumps and movements to safely pass between the laser beams without getting hit.Level 7: TrainYou'll run in a tunnel like platform this time, with all the obstacles introduced in previous levels.Level 8: RunA stair-style level with wide gaps between platforms. Adjusting for distance is crucial to making it to the next platform. It's one of the most demanding levels.Level 9: Sink or FloatMoving platforms with blocks that either drop or float. You must quickly figure out which platforms will hold your weight and which will disappear beneath you.Level 10: Kitchen SinkA mix of everything you've encountered so far—spikes, lasers, hammers, and more! You'll need to use all the skills you've learned to survive this chaotic level.Level 11: Master of SadismIn this boss level, a ghost haunts the platform. He'll be dropping blocks and throwing bombs at you. Dodge his attacks while navigating to the finish line. This is the ultimate test of endurance and strategy!DeveloperAlienWebGames created Extreme Run 3D.More Running GamesLove intense obstacle games like Extreme Run 3D? You'll also enjoy other fast-paced running games on OnlineGames.io. In case this game is too extreme for you, try Run 3 Space and enjoy overcoming obstacles in a mildly easier gameplay.This article was updated on January 28, 20251 Player3DActionArcadeAvoidBallFreeParkourRunningSkillSpeed",
  "extractedAt": "2025-06-10T04:10:57.683Z",
  "localThumbnail": "Extreme Run 3D_1749528657684.jpg"
}