{
  "url": "https://www.onlinegames.io/fall-boys/",
  "title": "Fall Boys",
  "category": "/t/racing/",
  "thumbnail": "https://www.onlinegames.io/media/posts/584/Fall-Boys.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/584/Fall-Boys.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/584/responsive/Fall-Boys-xs.jpg 384w, https://www.onlinegames.io/media/posts/584/responsive/Fall-Boys-sm.jpg 600w, https://www.onlinegames.io/media/posts/584/responsive/Fall-Boys-md.jpg 768w, https://www.onlinegames.io/media/posts/584/responsive/Fall-Boys-lg.jpg 1200w",
    "alt": "Fall Boys Free Online Game",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://cloud.onlinegames.io/games/2023/unity3/fall-boys/index-og.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "How to Play Fall Boys"
      },
      {
        "type": "h3",
        "text": "Race with Online Players"
      },
      {
        "type": "h3",
        "text": "Play Solo or with Friends"
      },
      {
        "type": "h3",
        "text": "Parkours to Compete On"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "What is More?"
      }
    ],
    "controls": [
      "To move, use the WASD or the Arrow keys.To make a jump, press the Space key."
    ],
    "howToPlay": "Decide whether you want to race with other players or play solo, as both of them are possible in the game. You can play solo and try many of the parkours before you race with people all over the world.Then, choose your character among 58 unique characters. You can only select the first one if it is your first time. But you can unlock the rest as you win races and level up.Your main aim in the Fall Boys is to overcome the challenges of the parkours and be the person who accomplishes reaching the finish line first.",
    "tips": "",
    "developer": "",
    "similarGames": []
  },
  "fullContent": "Home› RunningFall BoysBy OnlineGames.ioMake Game Full ScreenFall Boys is a multiplayer racing game where the player races with other online players on parkour courses. Conquer the obstacles, such as swinging pendulums or rotating bars on the platform, and be the one who gets to the finish line first. There will be many challenging barriers on the path. Make strategic movements and overcome them in one of the craziest parkour games!We believe that you will find the satisfaction you get from playing Fall Guys in Fall Boys without the need to download anything. 🥇How to Play Fall BoysDecide whether you want to race with other players or play solo, as both of them are possible in the game. You can play solo and try many of the parkours before you race with people all over the world.Then, choose your character among 58 unique characters. You can only select the first one if it is your first time. But you can unlock the rest as you win races and level up.Your main aim in the Fall Boys is to overcome the challenges of the parkours and be the person who accomplishes reaching the finish line first.Race with Online PlayersTo start playing with online players, press the red “Play” button on the menu. Then click on the “Start” button to match with racers. The game randomly opens a parkour for you to challenge yourself. There are many parkours, each with specific features and gameplay experiences.Play Solo or with FriendsIf you want to play the game all by yourself, click on the “Start Offline” to earn experience. Or, you can play with your friends. Use the Friends Menu at the right side of the screen to add a friend or invite them to race. It can be amusing playing with your buddies.Parkours to Compete OnThere are numerous parkour maps in the game. Each has various ramps, jumping areas and other obstacles to overcome. Try them all and enjoy the gaming experience they offer you. Below, you can find a short description of some of the parkours.Fall Boys Race: You must find the quickest route to overcome challenges. Jump from one ladder to the next. You have 100 seconds to complete this parkour.Roll Out Survival: You have 50 seconds to get to the finish line. There will be many rolling outs in Roll Out Survival.Tor Hunger Race: Like in the Fall Boys race, you must use the shortest route. Use your 120 seconds mindfully by running up and down.ControlsTo move, use the WASD or the Arrow keys.To make a jump, press the Space key.What is More?Try LOLbeans io if you are a fan of Fall Boys. It's an online racing game with colorful and humorous graphics, similar to a battle royale. Navigate a small jelly bean through the finals by taking control of it. Face numerous challenges along the way.For other options, you may look up the running games on OnlineGames.io by following the link. Make sure to bookmark this page so you can simply return!This article was updated on February 3, 20253DBattle RoyaleCrazyFreeFunFunnyMultiplayerParkourRacingRunningUnity",
  "extractedAt": "2025-06-10T05:37:46.940Z",
  "localThumbnail": "Fall Boys_1749533866940.jpg"
}