{
  "url": "https://www.onlinegames.io/fancy-pants/",
  "title": "Fancy Pants",
  "category": "/t/adventure/",
  "thumbnail": "https://www.onlinegames.io/media/posts/752/Fancy-Pants.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/752/Fancy-Pants.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/752/responsive/Fancy-Pants-xs.jpg 384w, https://www.onlinegames.io/media/posts/752/responsive/Fancy-Pants-sm.jpg 600w, https://www.onlinegames.io/media/posts/752/responsive/Fancy-Pants-md.jpg 768w, https://www.onlinegames.io/media/posts/752/responsive/Fancy-Pants-lg.jpg 1200w",
    "alt": "Fancy Pants Play Online",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2024/flash/fancy-pants/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "How to Play Fancy Pants"
      },
      {
        "type": "h3",
        "text": "Avoid the Spiders!"
      },
      {
        "type": "h3",
        "text": "Get Over the Mouse"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "More Games Like This"
      }
    ],
    "controls": [
      "Left Arrow: Move LeftRight Arrow: Move RightDown Arrow: DuckUp Arrow: Open DoorsS: JumpM: MuteSpacebar: Pause"
    ],
    "howToPlay": "Welcome to the colorful world of this cool stickman character with fancy pants!Your main objective in this adventure game is to navigate this cool guy on various platforms.However, this won't be easy! There are many obstacles in the maze. And some evil creatures will attack you if they manage to get close to you!Look out for the coils to move faster by jumping high. Strive to find the hidden doors to make progress in this arcade game!In addition, you can change the color of the fancy pants by entering the Options room from the menu.You can also view the trophies from the Collectible room. Find the trophies from the bonus rooms in the maze!",
    "tips": "",
    "developer": "Brad Borne developed Fancy Pants.",
    "similarGames": []
  },
  "fullContent": "Home› AdventureFancy PantsBy OnlineGames.ioMake Game Full ScreenFancy Pants is a 2D adventure game where you guide a stickman with cool pants on various platforms. You need to help him move forward, navigating the maze. However, there are many obstacles to overcome and spiders are waiting to attack you!Find ways to avoid or defeat the evil creatures. Additionally, don't forget to collect the squiggles in this arcade game. Will you be able to complete this adventure in The Fancy Pants Adventure: World 1?ControlsLeft Arrow: Move LeftRight Arrow: Move RightDown Arrow: DuckUp Arrow: Open DoorsS: JumpM: MuteSpacebar: PauseHow to Play Fancy PantsWelcome to the colorful world of this cool stickman character with fancy pants!Your main objective in this adventure game is to navigate this cool guy on various platforms.However, this won't be easy! There are many obstacles in the maze. And some evil creatures will attack you if they manage to get close to you!Look out for the coils to move faster by jumping high. Strive to find the hidden doors to make progress in this arcade game!In addition, you can change the color of the fancy pants by entering the Options room from the menu.You can also view the trophies from the Collectible room. Find the trophies from the bonus rooms in the maze!Avoid the Spiders!There will be black spiders running towards you when you enter the maze. If they get close to you, they will attack you. You need to pay attention to the health bar in the upper left corner.This bar starts dropping to zero each time these creatures attack you. Therefore, jump over them by pressing the S key to escape. Or, you can jump right on top of them and crush them. Keep in mind that you have only three lives in total!Get Over the MouseSpiders aren't the only creatures that will cause you trouble. There will be a mouse standing near the exit door. He is waiting for you with his gun! Once he sees you, he will try to shoot you down.Dodge his bullets and get over him to reach the door. If he manages to take your life, you will start the level from the beginning. You can send it into the void by jumping on it, just like you do with spiders!DeveloperBrad Borne developed Fancy Pants.More Games Like ThisYou may also try playing Fireboy and Watergirl. You must control the Fireboy and the Watergirl in a cave. Make your way to their individual doors by overcoming the obstacles in the cave together!For further options, you may look up other online adventure games on OnlineGames.io. Please share your gaming experiences with us in the comment section below. We would be very happy to hear from you!This article was updated on July 8, 20241 Player2DAdventureArcadeAvoidCrazyEscapeFlashFreeFunFunnyLogicStickman",
  "extractedAt": "2025-06-10T05:09:42.968Z",
  "localThumbnail": "Fancy Pants_1749532182968.jpg"
}