{
  "url": "https://www.onlinegames.io/fancy-pants-3/",
  "title": "Fancy Pants 3",
  "category": "/t/adventure/",
  "thumbnail": "https://www.onlinegames.io/media/posts/775/Fancy-Pants-World-3.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/775/Fancy-Pants-World-3.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/775/responsive/Fancy-Pants-World-3-xs.jpg 384w, https://www.onlinegames.io/media/posts/775/responsive/Fancy-Pants-World-3-sm.jpg 600w, https://www.onlinegames.io/media/posts/775/responsive/Fancy-Pants-World-3-md.jpg 768w, https://www.onlinegames.io/media/posts/775/responsive/Fancy-Pants-World-3-lg.jpg 1200w",
    "alt": "Fancy Pants Play Online",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2024/flash/fancy-pants-3/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Basics of Fancy Pants 3"
      },
      {
        "type": "h3",
        "text": "Get the Royal Tub Back"
      },
      {
        "type": "h3",
        "text": "Stomp on Spiders"
      },
      {
        "type": "h2",
        "text": "Levels in Fancy Pants 3"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "More Games Like This"
      }
    ],
    "controls": [
      "Left Arrow: Move LeftRight Arrow: Move RightDown Arrow: DuckUp Arrow: Open DoorsS: JumpM: MuteSpacebar: Pause"
    ],
    "howToPlay": "",
    "tips": "",
    "developer": "Brad Borne developed Fancy Pants 3.",
    "similarGames": []
  },
  "fullContent": "Home› AdventureFancy Pants 3By OnlineGames.ioMake Game Full ScreenThe King summons our stick guy! Fancy Pants 3 is a 2D adventure game and the third title in the popular video game series.The Fancy Pants Adventure. Angry Bathtub Pirates are trying to seize the King's Royal Tub in the game.Set out and fight with the pirates to reclaim the Royal Tub for him. However, Angry Bathtub Pirates may try to hurt you by kidnapping your sister in this arcade game. Do your best, get the bathtub and save your sister!ControlsLeft Arrow: Move LeftRight Arrow: Move RightDown Arrow: DuckUp Arrow: Open DoorsS: JumpM: MuteSpacebar: PauseBasics of Fancy Pants 3One day, the Mayor wakes you up from your sleep. And he gives you bad news.The King's Royal Tub has been stolen. He needs your help. You need to get it back!Bobble Head will take you through a short tutorial. He needs to ensure you are fit before you set off to get the Royal Tub back.The real adventure will begin in this escape game when you complete the tutorial.You must overcome all the obstacles at each level and find the exit room. Strive to survive from the spiders and snails on the way!Get the Royal Tub BackTo get the bathtub back, you need to go to Squiggleville. On the way, you will encounter many dangers and obstacles. You must climb over the walls, pass the buildings and find the exit room. From time to time, there will be coils. You can use them to jump high altitudes.Stomp on SpidersOn your way to the Royal Tub, you need to deal with many spiders, snails, crabs and mice with guns. You must learn how to defeat them. You can stomp on them to crash them. Alternatively, you can get rid of them by ducking under them. You should especially watch for the mice as they may shoot you once they see you. Don't forget that Fancy Pants Man has 3 lives in total!Levels in Fancy Pants 3There are nine levels in this adventure game.SquigglevilleThe Royal TubOuter SquigglevilleCanopy ForestBummin' It BeachPirate CovePiratey Princess ShipMisplaced CaveIsland ExpressDeveloperBrad Borne developed Fancy Pants 3.More Games Like ThisIf you have not tried the other games of the Fancy Pants World 1, and Fancy Pants World 2 try playing it!You need to guide The Fancy Pants man in a maze. Make him move forward, climb over the hills and stomp on the evil creatures!You may look up the online adventure games tag on OnlineGames.io for more options. Please share your gaming experiences with us in the comment section below! We want to know which level was the most challenging for you.This article was updated on November 13, 20241 Player2DAdventureArcadeAvoidCrazyEscapeFlashFreeFunFunnyLogicStickman",
  "extractedAt": "2025-06-10T05:08:40.545Z",
  "localThumbnail": "Fancy Pants 3_1749532120546.jpg"
}