{
  "url": "https://www.onlinegames.io/fancy-pants-2/",
  "title": "Fancy Pants 2",
  "category": "/t/adventure/",
  "thumbnail": "https://www.onlinegames.io/media/posts/770/Fancy-Pants-World-2.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/770/Fancy-Pants-World-2.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/770/responsive/Fancy-Pants-World-2-xs.jpg 384w, https://www.onlinegames.io/media/posts/770/responsive/Fancy-Pants-World-2-sm.jpg 600w, https://www.onlinegames.io/media/posts/770/responsive/Fancy-Pants-World-2-md.jpg 768w, https://www.onlinegames.io/media/posts/770/responsive/Fancy-Pants-World-2-lg.jpg 1200w",
    "alt": "Fancy Pants Play Online",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2024/flash/fancy-pants-2/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "How to Play Fancy Pants"
      },
      {
        "type": "h2",
        "text": "Change Your Pants"
      },
      {
        "type": "h2",
        "text": "Explore Bonus Levels"
      },
      {
        "type": "h2",
        "text": "Key Features"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "More Adventure Games"
      }
    ],
    "controls": [
      "Run: Left and right arrow keysJump: S keyEnter Door: Up ArrowDuck, slide and roll: Down ArrowPause: SpaceExit to Menu: Space + QToggle Moving Background: BToggle Music: M"
    ],
    "howToPlay": "A bunny steals Fancy Pants' ice cream cone. Go after it.The aim is to find hidden doors to open and collect squiggles on your way.Run, jump, slide, roll and explore all over the level by going leftward and rightward.You can use your arrow keys to run, S to jump, and down arrow to roll or slide.In the Fancy Pants Adventures: World 2, there are 6 trophies to collect and 6 colors to unlock. That means there 6 main levels and 6 secret levels to unlock, summing up to 12 doors to find.You may encounter spiders, shooters, and snails on your way. Avoid touching them from the sides at all costs. However, you can jump on them and fly higher.Stand in front of springboards to read them. The boards will give you clues and have funny stories in them.When you find a door, press the up arrow key to open and enter. Good luck in your adventures!",
    "tips": "",
    "developer": "Brad Borne drew, animated, and programmed Fancy Pants 2.",
    "similarGames": []
  },
  "fullContent": "Home› AdventureFancy Pants 2By OnlineGames.ioMake Game Full ScreenStep into 2010s nostalgia by playing Fancy Pants again. One of the most popular Flash games, Fancy Pants, came back to life with the Flash emulator program Ruffle. In this sequel, the hand-drawn stick figure, wearing fancy pants, embarks on new adventures in a number of vibrant environments. In the  Fancy Pants Adventures World 2, a bunny steals the stickman's trophy, which is actually an ice cream cone. The stick guy will run, jump, slide and seek a way to find the bunny for clearance. Little did he know, he'd encounter new enemies, monsters and collectibles on the way. So, go grab your pants and start playing!ControlsRun: Left and right arrow keysJump: S keyEnter Door: Up ArrowDuck, slide and roll: Down ArrowPause: SpaceExit to Menu: Space + QToggle Moving Background: BToggle Music: MHow to Play Fancy PantsA bunny steals Fancy Pants' ice cream cone. Go after it.The aim is to find hidden doors to open and collect squiggles on your way.Run, jump, slide, roll and explore all over the level by going leftward and rightward.You can use your arrow keys to run, S to jump, and down arrow to roll or slide.In the Fancy Pants Adventures: World 2, there are 6 trophies to collect and 6 colors to unlock. That means there 6 main levels and 6 secret levels to unlock, summing up to 12 doors to find.You may encounter spiders, shooters, and snails on your way. Avoid touching them from the sides at all costs. However, you can jump on them and fly higher.Stand in front of springboards to read them. The boards will give you clues and have funny stories in them.When you find a door, press the up arrow key to open and enter. Good luck in your adventures!Change Your PantsAs you unlock new colors in levels, you can change the color of the pants. To do that, go to the main menu and head over to Trophies and Colors. 4 colors come by default: orange, green, red and blue. You need to unlock the rest of the colors by playing.Explore Bonus LevelsBesides 6 primary levels, there are 6 bonus levels in the game. They are short and fun levels, bringing extra fun and a sense of exploration. Seek for hidden doors to play these levels.The SwainTommy LMAfro NinjaLouisAdam PhilipsNegative OneKey FeaturesFluid AnimationHand-Drawn GraphicsFunny Sound EffectsFunny NarrativeExploration Based GameplayCollectibles and SecretsDeveloperBrad Borne drew, animated, and programmed Fancy Pants 2.More Adventure GamesIf you haven't played Fancy Pants Adventure: World 1, go explore all the levels.If you gobbled up all the levels of both worlds of Fancy Pants and are looking for a similar game, we have another adventure game with secrets, hidden gems and a grand narrative: Poptropica. Solve mysteries for islanders and be the hero of the town! Let us know your opinions in the comments section!This article was updated on July 8, 20241 Player2DAdventureArcadeAvoidCrazyEscapeFlashFreeFunFunnyLogicStickman",
  "extractedAt": "2025-06-10T05:11:29.981Z",
  "localThumbnail": "Fancy Pants 2_1749532289981.jpg"
}