{
  "url": "https://www.onlinegames.io/fireboy-and-watergirl-2-light-temple/",
  "title": "Fireboy and Watergirl 2: Light Temple",
  "category": "/t/arcade/",
  "thumbnail": "https://www.onlinegames.io/media/posts/686/Fireboy-and-Watergirl.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/686/Fireboy-and-Watergirl.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/686/responsive/Fireboy-and-Watergirl-xs.jpg 384w, https://www.onlinegames.io/media/posts/686/responsive/Fireboy-and-Watergirl-sm.jpg 600w, https://www.onlinegames.io/media/posts/686/responsive/Fireboy-and-Watergirl-md.jpg 768w, https://www.onlinegames.io/media/posts/686/responsive/Fireboy-and-Watergirl-lg.jpg 1200w",
    "alt": "Fireboy and Watergirl 2 Online Game",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://html5.gamedistribution.com/383ad09b92c7446b9113cccc29630517/?gd_sdk_referrer_url=https://www.onlinegames.io/fireboy-and-watergirl-2-light-temple",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Our Review"
      },
      {
        "type": "h2",
        "text": "Basics of Fireboy and Watergirl: Light Temple"
      },
      {
        "type": "h3",
        "text": "To Bend Lights"
      },
      {
        "type": "h3",
        "text": "The Mirror Slider"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "What is Next?"
      }
    ],
    "controls": [
      "Desktops and Laptops",
      "WASD Keys: To move WatergirlArrow Keys: To move Fireboy",
      "Mobile Devices",
      "Use the arrows on the touchscreen to move the heroes.Switch between Fireboy and Watergirl by tapping on them."
    ],
    "howToPlay": "",
    "tips": "",
    "developer": "Oslo Albet created Fireboy and Watergirl: Light Temple.",
    "similarGames": []
  },
  "fullContent": "Home› Co-OpFireboy and Watergirl 2: Light TempleBy OnlineGames.ioMake Game Full ScreenWelcome to the second edition of the Fireboy and Watergirl series! Fireboy and Watergirl: Light Temple is a 2D puzzle platform game. In the game, you will bend lights and use mirrors a lot. To overcome the obstacles, you need to take control of the reflections. Direct the beams and take action with a fellow. Enjoy moving through labyrinths in this two-player game!Our Review“Fireboy and Watergirl: Light Temple is a challenging escape game. You must overcome many obstacles to get Fireboy and Watergirl to their gates. The way to the gates is to direct the lights with mirrors. Controlling the lights will enable them to pass doors and move elevators. The players must use their logic before making any movement. And, to get the victory, they need to act together.” - OnlineGames Editor.Basics of Fireboy and Watergirl: Light TempleThe game has 40 challenging levels. The goal is to get the lights to the detectors, which can be done by passing the levels.They will activate platforms on a labyrinth. No objects should be before the detectors; otherwise, they will fail to work properly.When the light is fully received, the platforms move. To direct the lights, you will use boxes.They have mirrors at the edges. These mirrors will enable you to bend the beams.You and your mate can move through the maze by activating the platforms and other devices.Manipulate the lights and overcome all the obstacles on your way in this cooperative game.Remember to collect the diamonds at the temple. Fireboy can collect the red diamonds, and Watergirl can collect the blue ones.In addition, both of the heroes can take up the green diamonds.To Bend LightsThe main aim of this adventure game is to make the Fireboy and Watergirl reach their gates. To achieve this task, they must join their forces and act together. The ancient temple has many elevator platforms. To activate them, you need to pull the levers to rotate boxes, flip the switches, and press the buttons. You can also move the mirrored boxes to bend lights to activate the platforms.The Mirror SliderBesides the switches, detectors, and levers, the temple has sliding buttons. These buttons, the mirror sliders, let you move the more accurate mirrors with four edges. The standard mirror can only be moved at a 90-degree angle.When you slide the mirror sliders, they will start to rotate in the direction you move. This way, you direct the mirror and send the light to the detectors. You must make sure that light passes clearly through both detectors.ControlsDesktops and LaptopsWASD Keys: To move WatergirlArrow Keys: To move FireboyMobile DevicesUse the arrows on the touchscreen to move the heroes.Switch between Fireboy and Watergirl by tapping on them.DeveloperOslo Albet created Fireboy and Watergirl: Light Temple.What is Next?If you enjoy moving through labyrinths, play the original game Fireboy and Watergirl: Forest Temple. Try to pass lakes, lavas, and green goo areas to make the fire and water reach their gates. To achieve success in the game, you must move forward cooperatively.View the other Co-Op games online on OnlineGames.io. The site offers many free online games and is constantly trying to expand its range. Please contact us if you have any suggestions or wishlists!This article was updated on March 17, 20242 Player2DArcadeBrainCo-OpCuteEscapeFreeKidsLogicMobilePuzzleWater",
  "extractedAt": "2025-06-10T05:15:54.884Z",
  "localThumbnail": "Fireboy and Watergirl 2_ Light Temple_1749532554886.jpg"
}