{
  "url": "https://www.onlinegames.io/fireboy-and-watergirl/",
  "title": "Fireboy and Watergirl",
  "category": "/t/adventure/",
  "thumbnail": "https://www.onlinegames.io/media/posts/377/Fireboy-and-Watergirl-Online.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/377/Fireboy-and-Watergirl-Online.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/377/responsive/Fireboy-and-Watergirl-Online-xs.jpg 384w, https://www.onlinegames.io/media/posts/377/responsive/Fireboy-and-Watergirl-Online-sm.jpg 600w, https://www.onlinegames.io/media/posts/377/responsive/Fireboy-and-Watergirl-Online-md.jpg 768w, https://www.onlinegames.io/media/posts/377/responsive/Fireboy-and-Watergirl-Online-lg.jpg 1200w",
    "alt": "Fireboy and Watergirl Play For Free",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://html5.gamedistribution.com/a55c9cc9c21e4fc683c8c6857f3d0c75/?gd_sdk_referrer_url=https://www.onlinegames.io/fireboy-and-watergirl",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "How to Play Fireboy and Watergirl?"
      },
      {
        "type": "h2",
        "text": "Lakes, Flames, and Green Goos"
      },
      {
        "type": "h2",
        "text": "Buttons, Levers, and Boxes"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "Similar Games"
      }
    ],
    "controls": [],
    "howToPlay": "Fireboy and Watergirl is initially released as a multiplayer game. It would be much easier and more fun to play with a friend. However, you can challenge yourself to play on your own with two hands on the keyboard.You can control Fireboy with the arrow keys and move Watergirl with the AWD keys. Fireboy and Watergirl's love is so deep that if one of them dies, you have to start over on that level.Bring Fireboy and Watergirl to their individual doors to complete a stage. The doors might be apart from each other in some cases. One of them might arrive at their gate first. The door will open when the right character stands in front. However, Watergirl and Fireboy will wait for each other to exit and finish a stage.If you think you made a mistake while playing, you can always retry that level from the beginning by clicking the pause button on the top right.",
    "tips": "",
    "developer": "Fireboy and Watergirl was created by Oslo Albet.",
    "similarGames": []
  },
  "fullContent": "Home› AdventureFireboy and WatergirlBy OnlineGames.ioMake Game Full ScreenHave you heard the saying \"Opposites attract\"? We want to introduce you two best friends that can never be together: Fireboy and Watergirl. Fireboy is hydrophobic and can only pass through flames. Watergirl loves to be wet and evaporate when she touches fire. Fireboy and Watergirl: Forest Temple is a popular arcade-style game that can be played on your browser without downloading. The game mechanics might look simple at first but will get challenging at the end of the 30+ levels. How to Play Fireboy and Watergirl?Fireboy and Watergirl is initially released as a multiplayer game. It would be much easier and more fun to play with a friend. However, you can challenge yourself to play on your own with two hands on the keyboard.You can control Fireboy with the arrow keys and move Watergirl with the AWD keys. Fireboy and Watergirl's love is so deep that if one of them dies, you have to start over on that level.Bring Fireboy and Watergirl to their individual doors to complete a stage. The doors might be apart from each other in some cases. One of them might arrive at their gate first. The door will open when the right character stands in front. However, Watergirl and Fireboy will wait for each other to exit and finish a stage.If you think you made a mistake while playing, you can always retry that level from the beginning by clicking the pause button on the top right.Lakes, Flames, and Green GoosWhile moving Fireboy, be sure that this little hot man does not touch a single drop of water. And protect Watergirl from fires in case she burns. Also, avoid all green lakes since both sinks in green goo. Buttons, Levers, and Boxes Before starting a stage, look through all the obstacles and buttons, and plan your moves ahead before acting. On some levels, it is essential to schedule which buttons to push and where and when to use the elevators. The use of levers is also a critical element while playing. The levers will remain as you leave them and don't move. As it is impossible to use the lever and be on the elevator at the same time, Fireboy and Watergirl will assist each other to elevate to different floors. There will be some levels that you will have limited time to press a button or certain buttons to avoid entirely.Unlike levers, buttons will not stay pressed as you leave. You have to hold the button to keep the position of the switch-connected elevator.Watergirl can push the boxes for different purposes. You can make use of boxes to climb on higher floors. If you come across lakes or flames that are too long to jump over, turn boxes into little islands that Fireboy and Watergirl can use as a waypoint. Other than that, you can use the boxes to hold a button.Collect as much as diamonds and rings. You will need them to reach certain stages. Blue diamonds can only be taken by Watergirl, while red ones are collectible by Fireboy. Be creative. There might be more than one way of passing a level. Enjoy FireBoy and Watergirl online with a friend! It is one best multiplayer games online. DeveloperFireboy and Watergirl was created by Oslo Albet.Similar GamesIf you liked this game, we suggest you browse our Arcade Games tag to find more options. Great platformer adventures await you at OnlineGames.io!This article was updated on February 28, 20242 Player2DAdventureArcadeCo-OpCuteEscapeFreeLogicWater",
  "extractedAt": "2025-06-10T05:06:53.306Z",
  "localThumbnail": "Fireboy and Watergirl_1749532013307.jpg"
}