{
  "url": "https://www.onlinegames.io/fireboy-and-watergirl-3-ice-temple/",
  "title": "Fireboy and Watergirl 3: Ice Temple",
  "category": "/t/arcade/",
  "thumbnail": "https://www.onlinegames.io/media/posts/797/Fireboy-and-Watergirl-2.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/797/Fireboy-and-Watergirl-2.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/797/responsive/Fireboy-and-Watergirl-2-xs.jpg 384w, https://www.onlinegames.io/media/posts/797/responsive/Fireboy-and-Watergirl-2-sm.jpg 600w, https://www.onlinegames.io/media/posts/797/responsive/Fireboy-and-Watergirl-2-md.jpg 768w, https://www.onlinegames.io/media/posts/797/responsive/Fireboy-and-Watergirl-2-lg.jpg 1200w",
    "alt": "Fireboy and Watergirl 3 Online Game",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://html5.gamedistribution.com/f3a6e1ac0a77412289cbac47658b2b68/?gd_sdk_referrer_url=https://www.onlinegames.io/fireboy-and-watergirl-3-ice-temple/",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "How to Play Fireboy and Watergirl?"
      },
      {
        "type": "h2",
        "text": "What's New in Ice Temple?"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "What is Next?"
      }
    ],
    "controls": [
      "Desktops and Laptops",
      "WASD Keys: Move WatergirlArrow Keys: Move Fireboy",
      "Mobile Devices",
      "Use the arrows on the touchscreen to move the heroes.Switch between elements by tapping on them."
    ],
    "howToPlay": "Control Fireboy with the arrow keys and move Watergirl with the AWD keys.The aim is to arrive at the gate together.In the rooms of Ice Temple, there are flames, lakes, and green goos, as in previous games.Fireboy cannot touch water, while Watergirl cannot touch flames. And both sink in green goos.Jump over the obstacles, use buttons and levers, wait for each other and arrive at the gate.If one of the elements dies, both must start over from that level. One for all, all for one!Explore the ice temple up and over and find the exit from this labyrinth!",
    "tips": "",
    "developer": "Oslo Albet created Fireboy and Watergirl: Ice Temple.",
    "similarGames": []
  },
  "fullContent": "Home› Co-OpFireboy and Watergirl 3: Ice TempleBy OnlineGames.ioMake Game Full ScreenFireboy and Watergirl series steam ahead with a new challenge. This time, these two cuties are stuck in an ice temple, making it even more challenging for both characters. Cooperate, solve puzzles and escape from rooms one by one.Fireboy and Watergirl 3: Ice Temple is the third game of the two-player puzzle platformer game series. There are two characters of opposite elements: fire and water. One's strength is making up for the other's weaknesses. Cooperation is the key! Grab your friend, choose your element, and start solving 36 new levels in Ice Temple together!ControlsDesktops and LaptopsWASD Keys: Move WatergirlArrow Keys: Move FireboyMobile DevicesUse the arrows on the touchscreen to move the heroes.Switch between elements by tapping on them.How to Play Fireboy and Watergirl?Control Fireboy with the arrow keys and move Watergirl with the AWD keys.The aim is to arrive at the gate together.In the rooms of Ice Temple, there are flames, lakes, and green goos, as in previous games.Fireboy cannot touch water, while Watergirl cannot touch flames. And both sink in green goos.Jump over the obstacles, use buttons and levers, wait for each other and arrive at the gate.If one of the elements dies, both must start over from that level. One for all, all for one!Explore the ice temple up and over and find the exit from this labyrinth!What's New in Ice Temple?Freezing Waters and Snow: Freezing water is the biggest new challenge in this game. Fireboy can slide on the snow. However, snow slows Watergirl. Additionally, neither can jump on the ice.To melt the ice into the water, use the red light buttons.To freeze the water into ice, use the blue light buttons.Switches: Elements use these special switches to open doors, build bridges and change the environment. In this third game, new types of switches are added to the gameplay: timed buttons. These work for a few seconds, and you need to hurry up before the button loses its function.Increasing Complexity: Ice Temple brings a new level of complexity to puzzles. The challenges add to the fun, sense of accomplishment and gaming skills.DeveloperOslo Albet created Fireboy and Watergirl: Ice Temple.What is Next?If you haven't played the first game yet, you should definitely go for it: Fireboy and Watergirl. Pass the lakes, lavas, and lots of obstacles while solving escape puzzles.View the other Co-Op games online on OnlineGames.io. We offer many free online games and constantly try to expand our library.This article was updated on July 9, 20242 Player2DArcadeBrainCo-OpCuteEscapeFreeHTML5KidsLogicMobilePuzzleWater",
  "extractedAt": "2025-06-10T05:17:16.336Z",
  "localThumbnail": "Fireboy and Watergirl 3_ Ice Temple_1749532636336.jpg"
}