{
  "url": "https://www.onlinegames.io/fireboy-and-watergirl-4-crystal-temple/",
  "title": "Fireboy and Watergirl 4: Crystal Temple",
  "category": "/t/arcade/",
  "thumbnail": "https://www.onlinegames.io/media/posts/872/fireboy-and-watergirl-4.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/872/fireboy-and-watergirl-4.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/872/responsive/fireboy-and-watergirl-4-xs.jpg 384w, https://www.onlinegames.io/media/posts/872/responsive/fireboy-and-watergirl-4-sm.jpg 600w, https://www.onlinegames.io/media/posts/872/responsive/fireboy-and-watergirl-4-md.jpg 768w, https://www.onlinegames.io/media/posts/872/responsive/fireboy-and-watergirl-4-lg.jpg 1200w",
    "alt": "Fireboy and Watergirl 4 Online Game",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://html5.gamedistribution.com/3790681b69584409b7f681a8e400102d/?gd_sdk_referrer_url=https://www.onlinegames.io/fireboy-and-watergirl-4-crystal-temple/",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "How to Play Fireboy and Watergirl 4: Crystal Temple"
      },
      {
        "type": "h2",
        "text": "Collecting Diamonds"
      },
      {
        "type": "h3",
        "text": "Can I play Fireboy and Watergirl 4 alone?"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "More Co-op Games"
      }
    ],
    "controls": [
      "Fireboy: Use the arrow keys to move and jump.Watergirl: Use the WASD keys to move and jump."
    ],
    "howToPlay": "Each level is a maze of fun and frustration, requiring both characters to work together.Fireboy activates fire-related mechanisms, and Watergirl does the same for water-related ones.This fourth installment of the series introduces teleporters that can swap the characters' positions.Navigate through the Cyristal temple, which is filled with traps, switches, levers, and doors that require perfect timing and probably a bit of sibling-like bickering to figure out.",
    "tips": "",
    "developer": "This game is developed by Oslo Albet.",
    "similarGames": []
  },
  "fullContent": "Home› Co-OpFireboy and Watergirl 4: Crystal TempleBy OnlineGames.ioMake Game Full ScreenFireboy and Watergirl 4: Crystal Temple is a cooperative puzzle game where fire and water combine for fun, physics-based challenges. Fire Boy is full of heat and energy and cannot touch water, while Water Girl is a cool and calm counterpart who can't stand fire. She's like a serene lake, but one that can move and solve puzzles. Together, they'll need to solve tricky puzzles, avoid hazards, and use their unique abilities to reach the goal. Teamwork is a must! Now, let's get going with controls and how to play this epic game.ControlsFireboy: Use the arrow keys to move and jump.Watergirl: Use the WASD keys to move and jump.How to Play Fireboy and Watergirl 4: Crystal TempleEach level is a maze of fun and frustration, requiring both characters to work together.Fireboy activates fire-related mechanisms, and Watergirl does the same for water-related ones.This fourth installment of the series introduces teleporters that can swap the characters' positions.Navigate through the Cyristal temple, which is filled with traps, switches, levers, and doors that require perfect timing and probably a bit of sibling-like bickering to figure out.Collecting DiamondsIn Fire Boy and Water Girl 4: Crystal Temple, you'll need to collect three types of diamonds as you navigate through each level: white, red, and blue. Fire Boy can only pick up red diamonds, while Water Girl is tasked with collecting blue ones. Both characters can grab the white diamonds. While collecting red and blue diamonds isn't required to complete a level, gathering the white diamonds is essential for unlocking new levels. These gems are scattered across the levels, and reaching them often requires a bit of puzzle-solving. To improve your rating, be sure to collect every diamond you find on your journey!Can I play Fireboy and Watergirl 4 alone?Playing the game with a friend offers the best experience. You can play the game solo, controlling both characters. However, it will be a challenge, like trying to pat your head and rub your stomach simultaneously.DeveloperThis game is developed by Oslo Albet.More Co-op GamesIf you love the teamwork and puzzle-solving in Fireboy and Watergirl 4, next play the fifth installment of the series Fireboy and Watergirl 5: Elements. Conquer elemental temples one by one with your mate!This article was updated on November 19, 20242 Player2DArcadeBrainCo-OpCuteEscapeFreeHTML5KidsLogicMobilePuzzleWater",
  "extractedAt": "2025-06-10T05:16:47.248Z",
  "localThumbnail": "Fireboy and Watergirl 4_ Crystal Temple_1749532607249.jpg"
}