{
  "url": "https://www.onlinegames.io/fire-and-water/",
  "title": "Fire and Water",
  "category": "/t/adventure/",
  "thumbnail": "https://www.onlinegames.io/media/posts/469/Fire-and-Water.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/469/Fire-and-Water.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/469/responsive/Fire-and-Water-xs.jpg 384w, https://www.onlinegames.io/media/posts/469/responsive/Fire-and-Water-sm.jpg 600w, https://www.onlinegames.io/media/posts/469/responsive/Fire-and-Water-md.jpg 768w, https://www.onlinegames.io/media/posts/469/responsive/Fire-and-Water-lg.jpg 1200w",
    "alt": "Fire and Water Play Online",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2023/construct/179/fire-and-water/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "How to Play Fire and Water"
      },
      {
        "type": "h3",
        "text": "Co-operative Gameplay"
      },
      {
        "type": "h3",
        "text": "Obstacles to Overcome in Fire and Water"
      },
      {
        "type": "h3",
        "text": "Reaching the Doors"
      },
      {
        "type": "h3",
        "text": "Helpful Tips to Master in Fire and Water"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h3",
        "text": "Fire Controls:"
      },
      {
        "type": "h3",
        "text": "Water Controls:"
      },
      {
        "type": "h2",
        "text": "Explore More Options"
      }
    ],
    "controls": [],
    "howToPlay": "There are 30 challenging levels in Fire and Water. Decide which character you will play with and move forward in the temple. You need to progress according to which character you choose. On the track, you will see puddles and lava lakes in some places. Water should not enter the lava lake, and fire should not come into contact with puddles. Here, each character must act according to their nature. Otherwise, you will be back to your starting point.",
    "tips": "Before beginning a stage, review all the buttons and barriers, and plan your actions before acting. It's important to plan which buttons to press and where and when to use the elevators on some floors.Leverage use is another crucial aspect of the game. The levers won't change once you leave them in that position. Since using the lever and riding in the elevator at the same time is not possible, Fire and Water will help one another ascend to different floors.Unlike levers, buttons won't remain pressed after you depart. To maintain the position of the switch-connected elevator, you must continue pressing the button.",
    "developer": "",
    "similarGames": []
  },
  "fullContent": "Home› 2 PlayerFire and WaterBy OnlineGames.ioMake Game Full Screen Fire and Water is a challenging two-player game where you and your mate try to overcome all the obstacles in a temple, as in the most popular web browser game of the 2000s: Fireboy and Watergirl. It draws inspiration from the beloved game. Play as Fire and Water and collect all the stars in the game. For the gamers who finished all the versions of the original Fireboy and Watergirl game series and still hungry for further levels Fire and Water is your cup of tea.How to Play Fire and WaterThere are 30 challenging levels in Fire and Water. Decide which character you will play with and move forward in the temple. You need to progress according to which character you choose. On the track, you will see puddles and lava lakes in some places. Water should not enter the lava lake, and fire should not come into contact with puddles. Here, each character must act according to their nature. Otherwise, you will be back to your starting point.Co-operative GameplayFire and Water is a team game. When one of the characters does not move in the direction they should and cannot reach the final door, it becomes meaningless for the other character to have fulfilled its duty. Therefore, acting together is the basic principle in this game.Obstacles to Overcome in Fire and WaterApart from lava lakes and water puddles, which are obstacles to opposing elements, you will encounter lasers and rotating tracks. You need to act together, especially to overcome laser obstacles. Because it needs to be turned off by pressing the laser button. And while one holds down this button, the other must move forward.Reaching the DoorsIn order to end the game, both Fire and Water must fulfill their duties and finally reach their own door in the level. The game is thus completed, and the characters move to the next level.Helpful Tips to Master in Fire and WaterBefore beginning a stage, review all the buttons and barriers, and plan your actions before acting. It's important to plan which buttons to press and where and when to use the elevators on some floors.Leverage use is another crucial aspect of the game. The levers won't change once you leave them in that position. Since using the lever and riding in the elevator at the same time is not possible, Fire and Water will help one another ascend to different floors.Unlike levers, buttons won't remain pressed after you depart. To maintain the position of the switch-connected elevator, you must continue pressing the button.ControlsFire Controls:Use the A and D keys to move.Use the W key to jump.Water Controls:Use the Left and Right arrow keys to move.Use the Upper arrow key to jump.Explore More OptionsConsider playing the original Fireboy and Watergirl if you want to keep your gaming experience nostalgic. Or you can explore other online 2 player games on OnlineGames.io for more options.Embed URL:https://www.onlinegames.io/games/2023/construct/179/fire-and-water/index.htmlThis article was updated on February 28, 20242 Player2DAdventureArcadeCo-OpEmbeddableEscapeFreeLogicWater",
  "extractedAt": "2025-06-10T05:09:50.448Z",
  "localThumbnail": "Fire and Water_1749532190448.jpg"
}