{
  "url": "https://www.onlinegames.io/five-nights-at-cat-freddy/",
  "title": "Five Nights At Cat Freddy",
  "category": "/t/action/",
  "thumbnail": "https://www.onlinegames.io/media/posts/850/cat-freddy.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/850/cat-freddy.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/850/responsive/cat-freddy-xs.jpg 384w, https://www.onlinegames.io/media/posts/850/responsive/cat-freddy-sm.jpg 600w, https://www.onlinegames.io/media/posts/850/responsive/cat-freddy-md.jpg 768w, https://www.onlinegames.io/media/posts/850/responsive/cat-freddy-lg.jpg 1200w",
    "alt": "Five Nights At Cat Freddy Play Online",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://playhop.com/app/219368?utm_source=distrib&is-united-page=1&skip-guard=1&header=no&utm_medium=cristian-ovidiu&clid=8531463",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h3",
        "text": "Step-by-Step Guide to Five Nights at Cat Freddy"
      },
      {
        "type": "h3",
        "text": "Game Levels"
      },
      {
        "type": "h3",
        "text": "Tips and Tricks"
      },
      {
        "type": "h2",
        "text": "More Escape Games"
      }
    ],
    "controls": [
      "Move: WASDInteract: ELeave Item: BLook around: Move mouse"
    ],
    "howToPlay": "",
    "tips": "Always be on the lookout for hidden items that can aid your escape.Craft wisely using your resources to create powerful tools.Don't forget to take care of Freddy; neglecting him can lead to scary consequences!",
    "developer": "",
    "similarGames": []
  },
  "fullContent": "Home› HorrorFive Nights At Cat FreddyBy OnlineGames.ioMake Game Full ScreenMeet Freddy the Cat, an adorable feline who needs your help! Freddy is no ordinary kitty; he comes from a haunted pet shop. So you better keep him happy by providing enough food and water in his bowl, a cozy bed, and plenty of playtime. If Freddy isn't cared for properly, he transforms into a terrifying monster, and your nights turn into a spooky survival game. In Five Nights at Cat Freddy, your mission is to survive through spooky nights where you'll solve puzzles and sneak past Freddy's monster form. In the meantime, you will figure out how to escape from this house on the fourth night. The night that is both adorable and thrilling awaits you. Outsmart Freddy the cat monster and make it to freedom!Five Nights at Cat Freddy is a spin-off version of the popular game Five Nights at Freddy's (FNaF), but with a twist of cats instead of animatronics. ControlsMove: WASDInteract: ELeave Item: BLook around: Move mouseStep-by-Step Guide to Five Nights at Cat FreddyGet ready to jump into the action! Here's how to play, along with a step-by-step guide to help you succeed:Start your adventure by searching for money hidden in piggy banks, closets, drawers, or safe boxes. Move around the house using the WASD keys. Look for items you can interact with and use the E key to engage with them.When you have enough money, order your cat from the computer in your bedroom. Select either black Freddy or white Tom as your companion.Your cat will arrive in a box at the front door. Open the box and meet him. He might look just as usual as any other cat in the beginning.He will be hungry and thirsty soon. Order essential supplies like a cat bowl, cat food, toys, and a bed using your computer again.Feed him with the cat food you bought, and don't forget about water! If the faucet is broken, repair it first. Once it's fixed, find an empty bottle, fill it with water, and pour it into Freddy's bowl.Use items to solve puzzles and craft new to us at the bench. You can use the recipes in your crafting book. (yes, finding that is another challenge)Your ultimate goal is to make it through to the fourth day without being caught by Freddy's monstrous form. Take care of your pet, and keep him happy to avoid his transformation. When he transforms press R to run away from him. But remember, running will consume more energy.Energy is only filled via consuming food or drinks. When you finish all the food in the house, you can order from the internet once a day.  Pay attention to your surroundings and, and remember where you left each tool.You can hide in closets when monster Freddy gets too close. Be strategic and use the items you've gathered to escape from this house!Game LevelsIn the beginning, you can select the Level of difficulty:Ghost Level: Freddy is completely unaware of your presence. Your energy drains slowly, and traps will not affect you. You carry a backpack with three sections for item storage.  Easy Level: Freddy moves at a slow pace and is less vigilant. Your energy decreases gradually while running, but remember that losing a life reduces your maximum energy level. You have eight chances to escape, along with a backpack that has three sections.  Normal Level: Freddy becomes faster and more perilous. Your energy heavily depends on stored food reserves and the number of lives you have lost. You have four escape opportunities, with a backpack that includes three sections.  Hard Level: Freddy poses a serious threat! Your energy decreases rapidly, and dying will greatly reduce your maximum energy capacity. You have merely two opportunities to get away, and your backpack has only one compartment.Tips and TricksAlways be on the lookout for hidden items that can aid your escape.Craft wisely using your resources to create powerful tools.Don't forget to take care of Freddy; neglecting him can lead to scary consequences!More Escape GamesIf you like escape puzzle challenges, next play The House. It offers at least scary game experience as Five Nights at Cat Freddy but harder puzzles to solve. You can play many other escape games on OnlineGames.io. This article was updated on March 7, 20251 Player3DActionAnimalAvoidCatCrazyEscapeFreeHorrorPetSimulatorSurvivalUnity",
  "extractedAt": "2025-06-10T05:04:15.143Z",
  "localThumbnail": "Five Nights At Cat Freddy_1749531855143.jpg"
}