{
  "url": "https://www.onlinegames.io/five-nights-at-candys/",
  "title": "Five Nights At Candy's",
  "category": "/new-games/",
  "thumbnail": "https://www.onlinegames.io/media/posts/895/five-nights-at-candys.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/895/five-nights-at-candys.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/895/responsive/five-nights-at-candys-xs.jpg 384w, https://www.onlinegames.io/media/posts/895/responsive/five-nights-at-candys-sm.jpg 600w, https://www.onlinegames.io/media/posts/895/responsive/five-nights-at-candys-md.jpg 768w, https://www.onlinegames.io/media/posts/895/responsive/five-nights-at-candys-lg.jpg 1200w",
    "alt": "Five Nights At Candy's Play Online",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://playhop.com/app/369698?utm_source=distrib&is-united-page=1&skip-guard=1&header=no&utm_medium=cristian-ovidiu&clid=8531463",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "How to Play Five Nights at Candy's"
      },
      {
        "type": "h2",
        "text": "More Scary Games"
      }
    ],
    "controls": [
      "Left Click: Select and view cameras.Double Click: Activate or deactivate the infrared mode on the selected camera."
    ],
    "howToPlay": "The restaurant is pitch black at night, but you have infrared technology to assist you. Click on a camera to view its feed and click again to activate infrared mode. This allows you to monitor the surroundings and detect any unusual movements.You can move between any cameras equipped with infrared. Turn it off by clicking the camera again when you're finished.Cameras CAM-04 and CAM-06 are positioned across from each door. Use infrared to keep a close eye on any activity near the doors and react quickly to potential threats.Each door has a button to shut them down and a corresponding power meter. Closing a door consumes energy, and the longer a door remains shut, the more energy it drains. Monitor the power levels to ensure you don't run out and get trapped!",
    "tips": "",
    "developer": "",
    "similarGames": []
  },
  "fullContent": "Home› HorrorFive Nights At Candy'sBy OnlineGames.ioMake Game Full ScreenEnter the eerie world of Five Nights at Candy's, where a seemingly innocent restaurant hides terrifying secrets. After the thrills of Freddy Fazbear's fade, a new job opportunity at Candy's Burgers emerges: a night shift security guard position. You spot the ad in the newspaper and think, \"What could possibly go wrong? This seems easy enough.\"HELP WANTED!Candy's Burgers & FriesFamily restaurant seeking nightshift security guard. Hours: 12 AM to 6 AMMonitor security camerasEnsure safety of the facility, equipment, and animatronic charactersNot responsible for any injuries or disappearances$100.50 per weekTo apply, call: 1-888-CAT-CANDYThe job seems simple... until night falls. What begins as a typical security gig soon turns into a nightmare. With the restaurant cloaked in darkness, you'll need to use infrared cameras to monitor the bizarre and unsettling happenings around you. Can you survive the shift? Or will the sinister forces lurking in the shadows claim you as their next victim? The terror escalates with every passing hour; jumpscares are a step away...ControlsLeft Click: Select and view cameras.Double Click: Activate or deactivate the infrared mode on the selected camera.How to Play Five Nights at Candy'sThe restaurant is pitch black at night, but you have infrared technology to assist you. Click on a camera to view its feed and click again to activate infrared mode. This allows you to monitor the surroundings and detect any unusual movements.You can move between any cameras equipped with infrared. Turn it off by clicking the camera again when you're finished.Cameras CAM-04 and CAM-06 are positioned across from each door. Use infrared to keep a close eye on any activity near the doors and react quickly to potential threats.Each door has a button to shut them down and a corresponding power meter. Closing a door consumes energy, and the longer a door remains shut, the more energy it drains. Monitor the power levels to ensure you don't run out and get trapped!More Scary GamesIf you're into the chilling atmosphere and intense survival challenges of Five Nights at Candy's, you might want to try Five Nights at Freddy's 3. It's another terrifying job at a haunted location, but this time, the danger comes from the deteriorating animatronics in a rundown attraction. If you're ready for more creepy nights, horror games online will keep you on the edge of your seat.This article was updated on December 13, 20241 Player2DActionAvoidCrazyFreeHorrorMobileMouseSurvival",
  "extractedAt": "2025-06-10T06:04:58.078Z",
  "localThumbnail": "Five Nights At Candy's_1749535498078.jpg"
}