{
  "url": "https://www.onlinegames.io/five-nights-at-freddys-2/",
  "title": "Five Nights At Freddy's 2",
  "category": "/t/action/",
  "thumbnail": "https://www.onlinegames.io/media/posts/771/FNaF-2.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/771/FNaF-2.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/771/responsive/FNaF-2-xs.jpg 384w, https://www.onlinegames.io/media/posts/771/responsive/FNaF-2-sm.jpg 600w, https://www.onlinegames.io/media/posts/771/responsive/FNaF-2-md.jpg 768w, https://www.onlinegames.io/media/posts/771/responsive/FNaF-2-lg.jpg 1200w",
    "alt": "FNAF 2 Play Online",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2024/w1/five-nights-at-freddys-2/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "What is the story of Five Nights at Freddy's?"
      },
      {
        "type": "h2",
        "text": "How to Play FNAF 2"
      },
      {
        "type": "h3",
        "text": "Stay Alive"
      },
      {
        "type": "h3",
        "text": "Manage Resources"
      },
      {
        "type": "h3",
        "text": "Get Ready for Jumpscares!"
      }
    ],
    "controls": [
      "Desktops",
      "Interact with lights: MouseTurn on flashlight: Hold SpaceWear a mask and access cameras: Hover the Mouse Over Two Panels"
    ],
    "howToPlay": "Take on the role of a night security guard. You must survive five consecutive shifts at Freddy Fazbear's Pizzeria, working from 12 AM to 6 AM.You may not feel nervous now, but this place gets very dark at night. Remember the rumors about the haunted animatronics? It's best to keep an eye on the security cameras to ensure none are approaching your location.",
    "tips": "",
    "developer": "",
    "similarGames": []
  },
  "fullContent": "Home› HorrorFive Nights At Freddy's 2By OnlineGames.ioMake Game Full ScreenFive Nights at Freddy's 2 (FNaF 2) is a popular horror game with a spooky environment and a thrilling narrative. If you have the courage for it, play it now for free on OnlineGames.io!ControlsDesktopsInteract with lights: MouseTurn on flashlight: Hold SpaceWear a mask and access cameras: Hover the Mouse Over Two PanelsWhat is the story of Five Nights at Freddy's?Freddy Fazbear's Pizzeria opened with wild enthusiasm. The initial aim was to serve delicious pizzas and entertain customers' children with animatronics. However, the opening was followed by a series of tragic events. Reports of missing children after visits to Fazbear's Pizza began to surface. These reports caused widespread concern among the residents. Rumors about murders and horror stories started spreading. Some people claimed that the animatronics were haunted and even bit children to death.In one incident, an animatronic bit a security guard, resulting in his death. These rumors led to the closure of the restaurant, and the missing children were never found.In the sequel, Five Nights at Freddy's 2, the pizzeria reopens and needs new staff. They quickly find waiters and chefs but struggle to fill the night security guard position. No one wants to work the night shift in a haunted restaurant. But here you are on this singular page. Perhaps thinking, \"What could go wrong? These must be just rumors. I need to pay my bills, and this job pays very well. I'll give this place a chance.\"Welcome to your new job: night shift security guard at Fazbear's Pizza. Keep your eyes open, we're beginning! Let's give you an onboarding before the mission!How to Play FNAF 2Take on the role of a night security guard. You must survive five consecutive shifts at Freddy Fazbear's Pizzeria, working from 12 AM to 6 AM.You may not feel nervous now, but this place gets very dark at night. Remember the rumors about the haunted animatronics? It's best to keep an eye on the security cameras to ensure none are approaching your location.Stay AliveYour aim is to survive for five nights. The main threat is the animatronics, which can attack if you're not careful. Use the security cameras to track their movements. They can only move when you're not watching, so stay on alert.Manage ResourcesYou have a flashlight, but its battery is limited. Use it wisely and only when necessary.Get Ready for Jumpscares!While monitoring the cameras, an animatronic might suddenly appear right in front of you. Prepare yourself for jump scares and play safely in this thrilling horror game!This article was updated on February 24, 20251 Player2DActionAvoidCrazyFreeHorrorSurvival",
  "extractedAt": "2025-06-10T04:12:00.408Z",
  "localThumbnail": "Five Nights At Freddy's 2_1749528720408.jpg"
}