{
  "url": "https://www.onlinegames.io/five-nights-at-freddys/",
  "title": "Five Nights At Freddys",
  "category": "/t/action/",
  "thumbnail": "https://www.onlinegames.io/media/posts/761/Play-FNAF-Online.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/761/Play-FNAF-Online.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/761/responsive/Play-FNAF-Online-xs.jpg 384w, https://www.onlinegames.io/media/posts/761/responsive/Play-FNAF-Online-sm.jpg 600w, https://www.onlinegames.io/media/posts/761/responsive/Play-FNAF-Online-md.jpg 768w, https://www.onlinegames.io/media/posts/761/responsive/Play-FNAF-Online-lg.jpg 1200w",
    "alt": "FNAF Play Online",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2024/w1/five-nights-at-freddys/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "About FNAF"
      },
      {
        "type": "h3",
        "text": "Monitor Animatronics"
      },
      {
        "type": "h3",
        "text": "Use the Power Properly"
      },
      {
        "type": "h2",
        "text": "What is More?"
      }
    ],
    "controls": [
      "Desktops and Laptops",
      "Mouse: Look AroundLeft-Click: Interact with Lights and DoorsHover the Mouse Over (at the bottom of the screen): Open the Camera Panel",
      "Mobile Devices",
      "Use the touchscreen to play the game."
    ],
    "howToPlay": "",
    "tips": "",
    "developer": "",
    "similarGames": []
  },
  "fullContent": "Home› HorrorFive Nights At FreddysBy OnlineGames.ioMake Game Full ScreenFreddy Fazbear's Pizza restaurant opens its doors to the customers! They needed a night watchman and you got the job. Five Nights at Freddy's (FNAF) is a 2D action game where you work as the security guard of this legendary restaurant.You must be on duty for five consecutive nights from midnight to 6 am. However, you need to be careful! The animatronics are wandering around the lobbies in this survival game!ControlsDesktops and LaptopsMouse: Look AroundLeft-Click: Interact with Lights and DoorsHover the Mouse Over (at the bottom of the screen): Open the Camera PanelMobile DevicesUse the touchscreen to play the game.About FNAFWARNING!This horror game contains flashing lights, loud noises and lots of jumpscares!The legendary restaurant has opened and will start serving. They need a security guard who will work between 12 am and 6 am. And now you got that job. You will be responsible for the safety of Freddy Fazbear's Pizza restaurant.But this won't be easy. Because when night comes, animatronic characters will start wandering in the lobbies. Watch them on camera, and close the doors when they approach. Don't let the sounds startle you.Monitor AnimatronicsThere are four animatronics in this horror game. Their names are Freddy Fazbear, Bonnie, Chica and Foxy.They will wander around the restaurant at night. You must avoid getting in touch with them as they can easily jumpscare you.If you jumpscare, you will restart from the beginning. Ensure that they can't reach you!To survive, you must monitor the security cameras from the camera panel. There are eleven cameras to check.And you need to keep checking them one by one frequently until your watch is over. Turn off the doors and lights when they approach you!Use the Power ProperlyTo guard yourself from the animatronics, you need to keep the doors shut. You will also need to use lights from time to time. But they work with power. If the battery reaches zero it will not be possible to use them.Just a reminder to use the power responsibly in the restaurant. Only use it when needed to save energy. You can keep an eye on the battery level in the lower left corner of the screen.What is More?You may also try playing Horror Granny if you enjoy playing this action game. You need to run from the eyes of the Granny to survive. Will you be able to escape from her and the demonic spirits?For additional options, you may look online horror games on OnlineGames.io. If you have any suggestions or a wishlist, please do not hesitate to contact us! We would be very happy to hear from you.This article was updated on June 6, 20241 Player2DActionAvoidCrazyFreeHorrorMobileMouseSurvival",
  "extractedAt": "2025-06-10T04:11:30.712Z",
  "localThumbnail": "Five Nights At Freddys_1749528690712.jpg"
}