{
  "url": "https://www.onlinegames.io/fleeing-the-complex/",
  "title": "Fleeing the Complex",
  "category": "/new-games/",
  "thumbnail": "https://www.onlinegames.io/media/posts/978/fleeing-complex.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/978/fleeing-complex.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/978/responsive/fleeing-complex-xs.jpg 384w, https://www.onlinegames.io/media/posts/978/responsive/fleeing-complex-sm.jpg 600w, https://www.onlinegames.io/media/posts/978/responsive/fleeing-complex-md.jpg 768w, https://www.onlinegames.io/media/posts/978/responsive/fleeing-complex-lg.jpg 1200w",
    "alt": "Henry Stickmin Fleeing the Complex Play Online",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://cloud.onlinegames.io/games/2025/flash/fleeing-the-complex/index-og.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "How to Play Fleeing the Complex"
      },
      {
        "type": "h2",
        "text": "Who Made Fleeing the Complex?"
      },
      {
        "type": "h2",
        "text": "All Henry Stickmin Games Online"
      }
    ],
    "controls": [
      "Mouse click to choose actions and make decisions"
    ],
    "howToPlay": "Watch the short intro cutscene. Henry has just arrived at The Wall.When a decision point appears, pick one of the available options.Each choice takes the story in a different direction. Some paths lead to freedom, others to funny fail moments of Henry.If you fail, no worries! You can go back and try a different choice without restarting the whole game.Keep experimenting with different choices to unlock all five main endings: Ghost Inmate, Convict Allies, Presumed Dead, International Rescue Operative, and The Betrayed. Plus, there are over 60 funny fail moments to discover along the way.",
    "tips": "",
    "developer": "",
    "similarGames": []
  },
  "fullContent": "Home› FunnyFleeing the ComplexBy OnlineGames.ioMake Game Full ScreenHenry Stickmin: Fleeing the Complex is a funny adventure story game packed with action, humor, and loads of unexpected twists. It’s the fifth game in the Henry Stickmin series and continues right after Infiltrating the Airship. This time, things get more intense as Henry wakes up inside The Wall (no, not the one on Game of Thrones, but similar concepts)  It’s a cold, high-security prison set in the snowy mountains of Canada. This place isn't just any prison. It's where the world’s most dangerous criminals are locked away, and guess what? Henry's just joined them. Honestly, what did he expect? After breaking into a bank, escaping from prison, and stealing a priceless Tunisian diamond, he wasn’t exactly headed for a beach vacation. A cold, heavily-guarded prison complex? Yeah… that sounds about right. But it’s Henry. He cannot wait, hands tied. He must find a way to flee from the complex. And that’s where you start to guide him and determine his fate with your choices. Let’s take a look at how this fifth game starts: The warden, Dmitri J. Petrov, sees Henry as a serious threat in the complex. So he and his right-hand man Grigori toss him into a transfer cell. That’s when the fun begins. With nothing to lose, Henry must figure out how to escape. You, the player, get to make every key decision. Will Henry tackle guards, play dead, call in some big favors, or maybe team up with fellow inmate Ellie Rose? Every choice you make could lead to success... or complete failure (with funny results).ControlsMouse click to choose actions and make decisionsHow to Play Fleeing the ComplexWatch the short intro cutscene. Henry has just arrived at The Wall.When a decision point appears, pick one of the available options.Each choice takes the story in a different direction. Some paths lead to freedom, others to funny fail moments of Henry.If you fail, no worries! You can go back and try a different choice without restarting the whole game.Keep experimenting with different choices to unlock all five main endings: Ghost Inmate, Convict Allies, Presumed Dead, International Rescue Operative, and The Betrayed. Plus, there are over 60 funny fail moments to discover along the way.Who Made Fleeing the Complex?Fleeing the Complex was created by PuffballsUnited, the same developer behind the entire Henry Stickmin series. The game later became part of The Henry Stickmin Collection on PC and consoles, but you can still play this version free online on your browser without flash plugins!All Henry Stickmin Games OnlineIf you want to experience the full Henry Stickmin saga, here’s the official game order. Each game builds on the last, with returning characters, fun callbacks, and evolving storylines based on your choices.Breaking the Bank Where it all begins. Henry tries (and fails) to rob a bank. It’s short, simple, and sets the tone for the series' funny trial-and-error style.Escaping the Prison: After getting caught, Henry finds himself behind bars. Your choices will help him break out.Stealing the Diamond: With freedom comes ambition. Henry sets out to steal a huge diamond from a museum. Expect ridiculous gadgets and even more ridiculous outcomes.Infiltrating the Airship: Henry is hired by the government to take down a group of air pirates. Will he succeed or betray them? You decide.Fleeing the Complex (You're here): Captured again and locked away in a frozen prison fortress, Henry must plan his boldest escape yet.All of these were later combined in The Henry Stickmin Collection for PC, which includes a final sixth game, Completing the Mission, only available in the paid collection. It ties together all your previous choices into one big, action-packed finale. But if you're just looking to play the classic flash games for free, you're in luck! The first five Henry Stickmin games are available to play online for free right here on OnlineGames.io. No download, no cost, just pure chaotic fun. Whether you're here for the crazy escape plans, the funny animations, or just want to see all the ways things can go wrong, Fleeing the Complex is one of the best online games to play for free. Try every path and see if you can help Henry pull off the perfect escape!This article was updated on April 3, 20251 Player2DCrashCrazyDestroyFlashFreeFunFunnyStickman",
  "extractedAt": "2025-06-10T06:03:28.588Z",
  "localThumbnail": "Fleeing the Complex_1749535408589.jpg"
}