{
  "url": "https://www.onlinegames.io/football-king/",
  "title": "Football King",
  "category": "/t/2-player/",
  "thumbnail": "https://www.onlinegames.io/media/posts/739/Football-King.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/739/Football-King.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/739/responsive/Football-King-xs.jpg 384w, https://www.onlinegames.io/media/posts/739/responsive/Football-King-sm.jpg 600w, https://www.onlinegames.io/media/posts/739/responsive/Football-King-md.jpg 768w, https://www.onlinegames.io/media/posts/739/responsive/Football-King-lg.jpg 1200w",
    "alt": "Football King Play Online",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2024/construct/226/football-king/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "About Football King"
      },
      {
        "type": "h3",
        "text": "Select Your Favorite Stadium"
      },
      {
        "type": "h3",
        "text": "Perform Super Shoots"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "What is More?"
      }
    ],
    "controls": [
      "Single Player",
      "WASD Keys: MoveSpacebar: ShootB: Super Shoot",
      "Two Players",
      "Player 1",
      "WASD Keys: MoveV: ShootB: Super Shoot",
      "Player 2",
      "Arrow Keys: MoveK: ShootL: Super Shoot",
      "Mobile Devices",
      "Use the buttons on the screen to move, jump and shoot."
    ],
    "howToPlay": "",
    "tips": "",
    "developer": "FreezeNova developed Football King.",
    "similarGames": []
  },
  "fullContent": "Home› SoccerFootball KingBy OnlineGames.ioMake Game Full ScreenAre you ready to shake things up in unique stadiums? Football King is a 2D sports game in which you direct your football player and try to score as many goals as you can. In the two-player mode, you can challenge your friend on the field.Or, play against the CPU in the single-player mode. Feel free to participate in quick matches or tournaments in each mode. All the choices are yours in this arcade game! Show your best footballer skills to your rivals.ControlsSingle PlayerWASD Keys: MoveSpacebar: ShootB: Super ShootTwo PlayersPlayer 1WASD Keys: MoveV: ShootB: Super ShootPlayer 2Arrow Keys: MoveK: ShootL: Super ShootMobile DevicesUse the buttons on the screen to move, jump and shoot.About Football KingThe first thing to do in this sports game is to choose the game mode you want to engage in. You can play against the CPU in the single-player mode.On the other hand, you can duel with a friend in the two-player mode. Or, both of you can team up and play against the CPU-controlled footballers.After the game mode selection, choose the team you want to play on behalf of in the stadium. You can also change your footballer from the customization section.Next, decide if you wish to play in the quick matches or the tournaments. In quick matches, you can engage in 1v1 against the CPU, 2v2 against the CPU or 1v1, 2v2 and Co-Op 2v2 games.Select Your Favorite StadiumIn each mode, you can choose between five unique stadiums to play on.Standard Stadium: A regular football field with big lights.Neighborhood Stadium: Located in a lively neighborhood.Desert Stadium: Play under the sun in a desert setting.Atlantic Stadium: Located near the Atlantic Ocean.Beach Stadium: Surrounded by palm trees on a beach.Perform Super ShootsYour main objective in this soccer game is to defend your goal post while trying to score as many goals as possible. Use your super shots to perform magnetic shots. You will see an icon with a flame in the lower-left corner of the screen.When this icon is fulfilled, you are free to perform super shoots. They will enable your footballer to shoot the ball fiercely! Compared to the regular shot, the super shot is more difficult for the opponent to block.DeveloperFreezeNova developed Football King.What is More?You may also enjoy playing Basket Random. Your basketball player is a ragdoll that can only lean forward and backward. Master controlling the ragdoll and dunk the ball as many as you can!For further options, look for other online World Cup games on OnlineGames.io. Our community is constantly trying to expand its online game range. Please come back to discover more!Embed URL:https://www.onlinegames.io/games/2024/construct/226/football-king/index.htmlThis article was updated on June 11, 20242 Player2DArcadeArenaBallCo-OpCrazyEmbeddableFreeFunFunnyHTML5MobileSoccerSportsWorld Cup",
  "extractedAt": "2025-06-10T05:36:41.186Z",
  "localThumbnail": "Football King_1749533801186.jpg"
}