{
  "url": "https://www.onlinegames.io/football-legends/",
  "title": "Football Legends",
  "category": "/t/2-player/",
  "thumbnail": "https://www.onlinegames.io/media/posts/478/Football-Legends.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/478/Football-Legends.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/478/responsive/Football-Legends-xs.jpg 384w, https://www.onlinegames.io/media/posts/478/responsive/Football-Legends-sm.jpg 600w, https://www.onlinegames.io/media/posts/478/responsive/Football-Legends-md.jpg 768w, https://www.onlinegames.io/media/posts/478/responsive/Football-Legends-lg.jpg 1200w",
    "alt": "Football Legends Play Online",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://html5.gamedistribution.com/ecd138ae69cf4e92b5f5cdd328b6b62e/?gd_sdk_referrer_url=https://www.onlinegames.io/football-legends",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "How to Play Football Legends"
      },
      {
        "type": "h3",
        "text": "Tournament or a Friendly Match"
      },
      {
        "type": "h3",
        "text": "Match Modes"
      },
      {
        "type": "h3",
        "text": "Using Fireball or Teleporting"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Discover More Soccer Games"
      }
    ],
    "controls": [
      "1 Player",
      "Use arrow keys to control your footballer.Press Z for a supershot.Tap X to shoot the ball.",
      "2 Player",
      "Utilize WASD keys to move your footballer.Hit K for a supershot.Press L to shoot the ball."
    ],
    "howToPlay": "You can play Football Legends alone against the computer or with a friend with the 2-player option. It's entirely your choice. You also have the option to join the tournament here. After deciding how you will play, it is time to choose the club you will play for. Will you play for Barca or Die Bullen?",
    "tips": "",
    "developer": "",
    "similarGames": []
  },
  "fullContent": "Home› SoccerFootball LegendsBy OnlineGames.ioMake Game Full Screen You can find everything you are looking for in this soccer game! Football Legends is a thrilling sports game where you can match with a friend or against a computer. There will be very spectacular matches as legends will compete here! Football Legends provides you prominent football clubs and their famous players. Choose whichever you want and start the match next to them.How to Play Football LegendsYou can play Football Legends alone against the computer or with a friend with the 2-player option. It's entirely your choice. You also have the option to join the tournament here. After deciding how you will play, it is time to choose the club you will play for. Will you play for Barca or Die Bullen?Tournament or a Friendly MatchIf you want to take part in the championship for the FIFA World Cup, you can differentiate your gaming experience by adjusting the difficulty level of the match according to your own wish before starting the tournament. Or you can be in a friendly match where there are no championships but a regular match. Simply select your beloved football club and get into the match!Match ModesYou may play Football Legends in various match modes, including 1vs1, 1vs2 or 2vs2. As you can see, everything in this game is according to your wishes. It is your freedom to decide how you will play with, who you will play with, and how many people you will play with. If you want to make things a little more complicated and test yourself, we highly recommend you try the 1vs2 mode.Using Fireball or TeleportingPlayers in different clubs may have distinct abilities, like teleporting and sending out a solid fireball. Using these abilities during the match allows you to outshine your opponent. You can use your unique ability when the icon in the lower-left corner of the screen is full by tapping the Z key.Controls1 PlayerUse arrow keys to control your footballer.Press Z for a supershot.Tap X to shoot the ball.2 PlayerUtilize WASD keys to move your footballer.Hit K for a supershot.Press L to shoot the ball.Discover More Soccer GamesTry Football Soccer World Cup, a 3D sports game where matches occur inside a genuine stadium if you enjoy Football Legends. For additional choices, check out more collections of sports and soccer games on OnlineGames.io. And in the comment section below, please share your gaming experiences with us!This article was updated on May 9, 20242 Player2DBallCo-OpFreeFunHTML5MobileSoccerSportsWorld Cup",
  "extractedAt": "2025-06-10T05:36:07.161Z",
  "localThumbnail": "Football Legends_1749533767160.jpg"
}