{
  "url": "https://www.onlinegames.io/foot-doctor/",
  "title": "Foot Doctor",
  "category": "/new-games/",
  "thumbnail": "https://www.onlinegames.io/media/posts/627/Foot-Doctor.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/627/Foot-Doctor.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/627/responsive/Foot-Doctor-xs.jpg 384w, https://www.onlinegames.io/media/posts/627/responsive/Foot-Doctor-sm.jpg 600w, https://www.onlinegames.io/media/posts/627/responsive/Foot-Doctor-md.jpg 768w, https://www.onlinegames.io/media/posts/627/responsive/Foot-Doctor-lg.jpg 1200w",
    "alt": "Foot Doctor Free Online Game",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://html5.gamedistribution.com/e08a70cdb5554371b96157b9dde66811/?gd_sdk_referrer_url=https://www.onlinegames.io/foot-doctor",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "How to Play Foot Doctor"
      },
      {
        "type": "h3",
        "text": "Choose Your Patient"
      },
      {
        "type": "h3",
        "text": "Injured Feet"
      },
      {
        "type": "h3",
        "text": "Avoid Infections"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "What is More?"
      }
    ],
    "controls": [
      "Use your mouse to pick objects and cure your patients"
    ],
    "howToPlay": "Many patients come from different countries and suffer from their feet. They know your reputation. Some of them flew for kilometers and came to you with solid faith. The first thing to do is examine them. Determine what procedure you will follow. You have all the medical equipment you need. Then, start operating them and send them to their country happily!",
    "tips": "",
    "developer": "Foot Doctor was developed by FreezeNova.",
    "similarGames": []
  },
  "fullContent": "Home› DoctorFoot DoctorBy OnlineGames.ioMake Game Full ScreenFoot Doctor is a 2D doctor game where you have many patients with injured feet. They are waiting for you to cure them as soon as possible because they are hurting! You must take care of them with caution. They believe you will heal them. Take them to your clinic one by one and start to heal them using your medical stuff in this simulator game!How to Play Foot DoctorMany patients come from different countries and suffer from their feet. They know your reputation. Some of them flew for kilometers and came to you with solid faith. The first thing to do is examine them. Determine what procedure you will follow. You have all the medical equipment you need. Then, start operating them and send them to their country happily!Choose Your PatientBegin with deciding on which patient you will take your clinic first. There is a blonde girl with stunning beauty, an American boy, and even Santa Claus. All of them are here for you to heal their injuries. Pick your favorite patient and make a diagnosis. Then, you can start your operations. Approach them with care, and we don't want them to get hurt!Injured FeetIt is possible that you will encounter many kinds of cases. You will deal with broken foot bones, glass cuts, open wounds and swollen toes. Use your X-ray device to detect the broken bones. Remove glass fragments with tweezers. Stitch open wounds and apply a compress with ice to swollen toes.Avoid InfectionsYou must prevent your patient's feet from becoming infected in any way. The area in which you treat your patients needs to be highly sterile. Otherwise, things may get worse. Avoid these kinds of infections using your medical experience. You are a renowned doctor, and everything you do must be perfect. Use the relevant medical spray and ointment to the wounded areas when necessary.ControlsUse your mouse to pick objects and cure your patientsDeveloperFoot Doctor was developed by FreezeNova.What is More?If you are a fan of Foot Doctor, you may also try My Dentist. Your main task in the game is to perform dental procedures for your patients. They have oral health diseases and are waiting for your treatments. Do your examinations, operate on their mouth and send them to their home with a happy smile!For further options, you may look up the doctor games tag on OnlineGames.io by following the link. If you have any suggestions or wishlist, do not hesitate to contact us!This article was updated on May 9, 20241 Player2DCrazyDoctorFreeFunHospitalKidsSimulatorUnity",
  "extractedAt": "2025-06-10T06:13:35.614Z",
  "localThumbnail": "Foot Doctor_1749536015616.jpg"
}