{
  "url": "https://www.onlinegames.io/forcez-io/",
  "title": "ForceZ.io",
  "category": "/t/io-games/",
  "thumbnail": "https://www.onlinegames.io/media/posts/1/ForceZ.io.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/1/ForceZ.io.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/1/responsive/ForceZ.io-xs.jpg 384w, https://www.onlinegames.io/media/posts/1/responsive/ForceZ.io-sm.jpg 600w, https://www.onlinegames.io/media/posts/1/responsive/ForceZ.io-md.jpg 768w, https://www.onlinegames.io/media/posts/1/responsive/ForceZ.io-lg.jpg 1200w",
    "alt": "ForceZ.io Free",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://unblocked-games.s3.amazonaws.com/games/forcez-io/index2.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Online PvP Mode"
      },
      {
        "type": "h2",
        "text": "ForceZ.io Game Modes"
      },
      {
        "type": "h2",
        "text": "Missions"
      },
      {
        "type": "h2",
        "text": "Armor Section in ForceZ.io"
      },
      {
        "type": "h2",
        "text": "ForceZ.io Display"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Developer"
      }
    ],
    "controls": [
      "WASD or arrow keys to moveLeft click to shootRight click to aimR to reload1, 2, 3 .. 9 or Mouse wheel to cycle through weaponsSpace to jumpTab to toggle pause menuPress T to open chat"
    ],
    "howToPlay": "",
    "tips": "",
    "developer": "ForceZ.io is created by FreezeNova.\n",
    "similarGames": []
  },
  "fullContent": "Home› io GamesForceZ.ioBy OnlineGames.ioMake Game Full ScreenIn ForceZ.io the most important thing is the strategy that will be tested first. The game action will bring you the adrenaline as you shoot and run after the enemies. Jump, hide, hunt and find the best moment shoot with your weapon.The missions are getting harder as you upgrade your skills but you will never be bored.Before starting the game let's see the details for online pvp, missions, armor and profile. Online PvP ModeIn online PvP mode, a player can choose either to create a room or join an existing room. When creating a room, you get to choose the level and mode to play from. You can select speedx2, jump forcex2, armorx2 and the maximum players (16).ForceZ.io Levels are:• Isaneya• Sanctum• Sumerra• Androli• AchillesForceZ.io Game Modes• FFA (Free For All)• Teams • DoomsdayMissionsYou are offered a variety of missions with different objectives. In level 1, you have 3 active missions to choose from.Mission 1 is to win a death match; in this mission 6 players are deployed to battle and the first player with 15 kills wins the match.Mission 2 is to eliminate 3 enemies; in this mission, your objective is to eliminate 3 enemies to pass the mission. However, if your player kills 2 enemies and gets knocked down, you must restart the mission. So ensure you get that 3 kill streak to complete the mission.Mission 3 is to survive for 50 seconds; in this mission you have to survive for 50 seconds and the player’s movement and speed is reduced. To survive, either you take down your enemies or you find cover for 50 seconds.Armor Section in ForceZ.io In the armor section, you are provided with a range of purchasable equipment that propects you from the bullet attacks:• Watchdog Armor • Hellbound Armor • Undefeated Armor• Night Armor• Supreme Armor • Death Mask • Cataclysm Mask • Doom Squad Mask• Unforgiven Mask • Vanquisher Mask In the profile section you will be able to see what level you have, Xp, the kills, money and the save code.ForceZ.io Display• Kill feed (displayed on the top left)• Leading team (displayed on the top center)• HP and ammo (displayed on the bottom right)• Radar (displayed on the top right)ControlsWASD or arrow keys to moveLeft click to shootRight click to aimR to reload1, 2, 3 .. 9 or Mouse wheel to cycle through weaponsSpace to jumpTab to toggle pause menuPress T to open chatDeveloperForceZ.io is created by FreezeNova. This article was updated on December 7, 20243DActionArmorBattleBattle RoyaleFirst Person ShooterFreeGunio GamesMultiplayerShootingWeapon",
  "extractedAt": "2025-06-10T05:33:38.935Z",
  "localThumbnail": "ForceZ.io_1749533618935.jpg"
}