{
  "url": "https://www.onlinegames.io/fortress-defense/",
  "title": "Fortress Defense",
  "category": "/t/strategy/",
  "thumbnail": "https://www.onlinegames.io/media/posts/683/Fortress-Defense.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/683/Fortress-Defense.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/683/responsive/Fortress-Defense-xs.jpg 384w, https://www.onlinegames.io/media/posts/683/responsive/Fortress-Defense-sm.jpg 600w, https://www.onlinegames.io/media/posts/683/responsive/Fortress-Defense-md.jpg 768w, https://www.onlinegames.io/media/posts/683/responsive/Fortress-Defense-lg.jpg 1200w",
    "alt": "Fortress Defense Game",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2022/unity/fortress-defense/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Fortress Defense Overview"
      },
      {
        "type": "h3",
        "text": "Upgrade Your Archers"
      },
      {
        "type": "h3",
        "text": "Strong Walls and Fighters"
      },
      {
        "type": "h3",
        "text": "Boosters and Power-ups in Fortress Defense"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "Search for More"
      }
    ],
    "controls": [
      "Computers and Desktops",
      "Mouse: Place Archers/Activate Boosters and Power-ups",
      "Mobile Devices",
      "Use the touchscreen to place archers and activate boosters and power-ups."
    ],
    "howToPlay": "",
    "tips": "",
    "developer": "FreezeNova developed Fortress Defense.",
    "similarGames": []
  },
  "fullContent": "Home› Tower DefenseFortress DefenseBy OnlineGames.ioMake Game Full ScreenPosition your archery men on the top of your castle as the monsters are coming for you! Fortress Defense is a tower defense game where you must protect your sanctuary.Fortunately, you have the best troops. Let them take their places on the roof. They will attack enemy knights with arrows. Prepare your attack plan well and send the bad creatures where they come from in the strategy game!Fortress Defense OverviewThe action game has 10 distinct world maps, each with 10 levels. Start with the first level.The first thing to do is to add archers on the top of the fortress. You can place five archers.You will see many warriors coming towards your sanctuary in waves. Your archers will shoot arrows at them from the roof.Stand for your tower no matter what. Resist their attacks until your archers eliminate them all one by one.When you see that the bar in the left corner of the screen is totally red, it means they are over!Upgrade Your ArchersAs you eliminate the enemies, you will gain EXPs. Use them to upgrade your troop. In later levels, you will need more power during a battle since the attacks get harder. When you get enough experience points, you will see an arrow pointing up at your men.Click on which archers you want to upgrade. They will level up in this way, and their damage power will increase. There are five upgrade levels, meaning five unique archers. Each comes with its special powers.Strong Walls and FightersYou can also enhance your fortress's walls to make them more resistant to attacks. In the \"Shop\" section, acquire the \"Strong Wall,\" which costs 2000 coins and makes your tower more durable.On the other hand, you have the option to upgrade your fighter's features here, too. You can see those five archers side by side. Acquiring upgrades will increase their damage rate and critical hit percentage.Boosters and Power-ups in Fortress DefenseTo help you defend your castle, you can use boosters and power-ups. You can get boosters from the \"Shop\" section. There are Double Arrow, Poison and Freeze as boosters. They cost 50 coins, 75 coins and 100 coins respectively. Tap on the two-swords icon to use them.You have three power-ups: Frost, Lava, and Lightning. For 30 seconds, they will freeze, burn, or strike lightning in the area you choose.ControlsComputers and DesktopsMouse: Place Archers/Activate Boosters and Power-upsMobile DevicesUse the touchscreen to place archers and activate boosters and power-ups.DeveloperFreezeNova developed Fortress Defense.Search for MoreYou may also try Siegius. You will act as Caesar in the game and give command to your legionnaire. Your soldiers will try to defend Ancient Rome by attacking the Gallic.Visit tower defense games online to engage in other gaming experiences. On OnlineGames.io, you can find dozens of browser games. We recommend bookmarking this website to access new ones easily!This article was updated on March 13, 20241 Player2DArcheryArenaArmorBattleCombatDefenseFantasyFreeMobileMouseStrategyTower DefenseUnityWar",
  "extractedAt": "2025-06-10T05:57:22.163Z",
  "localThumbnail": "Fortress Defense_1749535042163.jpg"
}