{
  "url": "https://www.onlinegames.io/fort-drifter/",
  "title": "Fort Drifter",
  "category": "/t/car/",
  "thumbnail": "https://www.onlinegames.io/media/posts/592/Fort-Drifter-Keyboard-Controls.webp",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/592/Fort-Drifter-Keyboard-Controls.webp",
    "srcset": "https://www.onlinegames.io/media/posts/592/responsive/Fort-Drifter-Keyboard-Controls-xs.webp 384w, https://www.onlinegames.io/media/posts/592/responsive/Fort-Drifter-Keyboard-Controls-sm.webp 600w, https://www.onlinegames.io/media/posts/592/responsive/Fort-Drifter-Keyboard-Controls-md.webp 768w, https://www.onlinegames.io/media/posts/592/responsive/Fort-Drifter-Keyboard-Controls-lg.webp 1200w",
    "alt": "Fort Drifter Keyboard Controls",
    "width": 750,
    "height": 224,
    "className": "is-loaded",
    "parentClass": "post__image post__image--center is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2022/unity3/fort-drifter/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "How to Play Fort Drifter"
      },
      {
        "type": "h3",
        "text": "Crazy Vehicles of Fort Drifter"
      },
      {
        "type": "h3",
        "text": "Building Tracks"
      },
      {
        "type": "h3",
        "text": "Drive through Green Halos"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "What is More?"
      }
    ],
    "controls": [
      "To steer your vehicle, use the WASD or the Arrow keys.Press the Space key to use the booster.Press the Q key to create your tracks.Use the E key to change your car.To pause or go to the menu, press the ESC key."
    ],
    "howToPlay": "The game challenges you to be the best Fortnite nitro drifter! You feel like driving a car on the red sands of the planet Mars. The game map contains the craziest roads and tracks you will ever see.Try each track and get the highest point by drifting and jumping with your vehicle.The game also allows you to craft your own tracks on the map. Ignite your vehicle's engine and dive into the drifters' adventure.",
    "tips": "",
    "developer": "",
    "similarGames": []
  },
  "fullContent": "Home› DriftFort DrifterBy OnlineGames.ioMake Game Full Screen Fort Drifter is a drift game where you can steer crazy cars on a platform full of jumping ramps, highway roads in different shapes, and castles. You will love the game's impressive graphics, reminding you of the Fortnite Drift. The game allows you to build tracks on the platform as you wish. It means that you can create your ramps and roads and drive on them in this splendid car game!How to Play Fort DrifterThe game challenges you to be the best Fortnite nitro drifter! You feel like driving a car on the red sands of the planet Mars. The game map contains the craziest roads and tracks you will ever see.Try each track and get the highest point by drifting and jumping with your vehicle.The game also allows you to craft your own tracks on the map. Ignite your vehicle's engine and dive into the drifters' adventure.Crazy Vehicles of Fort DrifterThere are 10 mighty vehicles at your service. Each car has magnificent designs. You can access various styles of sports cars, monster trucks, and even trailer trucks.Press the E key to change your vehicle; using the left and the right arrows will make you switch between vehicles. You don't need to unlock them, and they are all accessible.Building TracksThe best part of this game is it enables you to create your own path.You will see track icons in the lower right corner of the screen. You can build your platforms by using these tracks in different shapes.Create a long route for yourself by joining these tracks together.Press the Q key to open the tracks section, and by using the WASD keys, you can select your preferred track.Press the Space key to build.Drive through Green HalosThe green halos help you to get teleported. These halos send you to another part of the map. As it is a vast land, it will be a surprise where you show up.Drive your car, jump from the high places and make acrobatic movements. But also, do not skip trying these halos. They will be enjoyable.ControlsTo steer your vehicle, use the WASD or the Arrow keys.Press the Space key to use the booster.Press the Q key to create your tracks.Use the E key to change your car.To pause or go to the menu, press the ESC key.What is More?Try Drift Rider if you like playing Fort Drifter. You can customize your vehicle and then hit the road and start drifting on among 5 racetracks in the game. You may drive on a highway or in the streets of a city. Take control of your vehicle and test your driving skills!Or, you may look for other drift games on OnlineGames.io for more gaming options. If you stay tuned, you will always find new amazing driving games on our platform!Embed URL:https://www.onlinegames.io/games/2022/unity3/fort-drifter/index.htmlThis article was updated on September 2, 20241 Player3DCarCrazyDriftDrivingEmbeddableFreeSandboxSimulatorSpeedStuntUnity",
  "extractedAt": "2025-06-10T05:25:37.055Z",
  "localThumbnail": "Fort Drifter_1749533137056.jpg"
}