{
  "url": "https://www.onlinegames.io/fortnite-z/",
  "title": "Fortnite Z",
  "category": "/t/adventure/",
  "thumbnail": "https://www.onlinegames.io/media/posts/599/Fortnite-Z.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/599/Fortnite-Z.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/599/responsive/Fortnite-Z-xs.jpg 384w, https://www.onlinegames.io/media/posts/599/responsive/Fortnite-Z-sm.jpg 600w, https://www.onlinegames.io/media/posts/599/responsive/Fortnite-Z-md.jpg 768w, https://www.onlinegames.io/media/posts/599/responsive/Fortnite-Z-lg.jpg 1200w",
    "alt": "Fortnite Z Free Online Game",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://turbowarp.org/897549844/embed?autoplay&addons=remove-curved-stage-border",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "How to Play Fortnite Z?"
      },
      {
        "type": "h3",
        "text": "Exploration Mode"
      },
      {
        "type": "h3",
        "text": "Online Playground"
      },
      {
        "type": "h3",
        "text": "Battle Royale GO!"
      },
      {
        "type": "h3",
        "text": "Get New Skins and Gliders"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "Similar Scratch Games"
      }
    ],
    "controls": [
      "To move, use the WASD keys.To look around, use the mouse.To shoot, use the mouse click.To pick up things, use the E key.To build shelter, use the F key."
    ],
    "howToPlay": "There are 3 game modes in Fortnite Z: Exploration Mode, Online Playground and Battle Royale. Each comes with unique features. Choose the game mode you want to play, and go have fun! When you start to play, you will be flying over the game map you choose in the Tac-Z. Press the Space key to leave the Tac-Z and land somewhere on the ground using your glider.",
    "tips": "",
    "developer": "Fortnite Z is created by FunnyAnimatorJimTV.",
    "similarGames": [
      {
        "title": "Getting Over It",
        "url": "https://www.onlinegames.io/getting-over-it/"
      }
    ]
  },
  "fullContent": "Home› SurvivalFortnite ZBy OnlineGames.ioMake Game Full Screen Fortnite Z is a survival game where you collect weapons, bullets and other useful stuff on the ground to stay alive in the battle royale mode. You can even build a shelter with wood to protect yourself. Gather the necessary things from the playground and try to survive in this scratch game version of the popular Fortnite! Or hang out on the Exploration and Online Playground maps freely. 🗡️How to Play Fortnite Z?There are 3 game modes in Fortnite Z: Exploration Mode, Online Playground and Battle Royale. Each comes with unique features. Choose the game mode you want to play, and go have fun! When you start to play, you will be flying over the game map you choose in the Tac-Z. Press the Space key to leave the Tac-Z and land somewhere on the ground using your glider.Exploration ModeIf this is your first time playing Fortnite Z, this is the perfect place to start. Exploration mode enables you to act freely as there are no enemies. You do not need to protect yourself here. Explore the cartoonish game map, weapons and other tools. Be acquainted with the game in this mode.Online PlaygroundYou are playing with other players in this mode, but there is no battling here. Make new friends in the Online Playground mode, and act together to have fun. Send emojis to each other by pressing the Z key. Collect lollipops on the map. Go into the huts and see what's inside.Battle Royale GO!Things are going to get intense here. It is the arena where the big fight takes place.You need to be fast in order to find weapons and ammo; otherwise, the other players will not let you get the things that will keep you alive!Search the buildings to find useful stuff, and open the chests to get ammo. You may find some chests locked. Open them by using your gun.Eliminate enemies one by one with your weapons when you encounter them. But be careful not to die.Check your health bar in the upper right corner. If this bar drops to zero, you will be eliminated.If you get hit, use the fish and fruits to replenish your health.Using wood, you can turn some areas in the map into a shelter. You must chop logs with a sword or hammer to do that. Press the F key to build a shelter when you find a proper place.Remember that you can not stay in the purple zone. Your health drops in this area. Avoid this zone as much as possible.Get New Skins and GlidersWhen you play well in the game, you will get Z coins. Use these coins to style your avatar. You will find 25 skins and 10 gliders in the Shop section. Buy the ones you love the most. Our favorite skin is the Oreo-shaped avatar. You can find other skins like an ice cube, 8-ball or a lightbulb.You can also renew the glide you use to land on the game maps from this section. You may find a Raven glider, a Mini Tac-Z, a Gold Bar, and other creative gliders at your disposal. You have the option to sell your purchased outfits.ControlsTo move, use the WASD keys.To look around, use the mouse.To shoot, use the mouse click.To pick up things, use the E key.To build shelter, use the F key.DeveloperFortnite Z is created by FunnyAnimatorJimTV.Similar Scratch GamesIf you are a fan of Fortnite Z, you will love Getting Over It. Grab a trusty hammer and help the cat climb up the game's obstacles. This cat does not have legs. So, make him move forward by controlling the hammer.For more game options, you may look up the scratch games on OnlineGames.io. You can access many thrilling games easily and for free on this website!This article was updated on February 13, 20242DAdventureBattleBattle RoyaleCrazyFreeGunHTML5MultiplayerSandboxScratchShootingSurvivalWeapon",
  "extractedAt": "2025-06-10T05:08:08.176Z",
  "localThumbnail": "Fortnite Z_1749532088176.jpg"
}