{
  "url": "https://www.onlinegames.io/funny-blade-and-magic/",
  "title": "Funny Blade and Magic",
  "category": "/t/action/",
  "thumbnail": "https://www.onlinegames.io/media/posts/989/funny-blade-and-magic-game.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/989/funny-blade-and-magic-game.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/989/responsive/funny-blade-and-magic-game-xs.jpg 384w, https://www.onlinegames.io/media/posts/989/responsive/funny-blade-and-magic-game-sm.jpg 600w, https://www.onlinegames.io/media/posts/989/responsive/funny-blade-and-magic-game-md.jpg 768w, https://www.onlinegames.io/media/posts/989/responsive/funny-blade-and-magic-game-lg.jpg 1200w",
    "alt": "Funny Blade and Magic Free Online Game",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://html5.gamedistribution.com/9f994d6bf74c4decae5cb4a60f357d93/?gd_sdk_referrer_url=https://www.onlinegames.io/funny-blade-and-magic/",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "How to Play Funny Blade and Magic"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "More Funny Action Games to Play Next"
      }
    ],
    "controls": [
      "Move: WASDRun: ShiftJump: SpacebarDash: WASD + CAttack: Left Click or ZThrow Axe: Right Click or RUse Ability: FOpen Ability Menu: TabSelect Abilities: Keys 1–6"
    ],
    "howToPlay": "You start off as a betrayed goblin warrior an ex-king with nothing but your axe and a thirst for revenge. Explore wild levels filled with enemies, bosses, and magical energy. Eliminate all the enemies to complete levels. As you progress, collect weapons like swords, axes, and giant hammers. Then unlock awesome magical powers, think teleportation, time-slowing, and more.\n\nYour goal is to survive each fight, collect gear, and defeat unique bosses who all have their own tricks. Between battles, you’ll unlock story cutscenes that reveal the truth behind your betrayal. It’s like an action movie, but with goblins and goofy jokes.",
    "tips": "",
    "developer": "Funny Blade and Magic was made by GoGoMan who loves combining action, humor, and fantasy into one chaotic ride.",
    "similarGames": []
  },
  "fullContent": "Home› FunnyFunny Blade and MagicBy OnlineGames.ioMake Game Full ScreenLet's say, you’re a goblin hero, betrayed by your greedy uncle and kicked out of your rightful legacy. The godmother gifts you an axe and teaches you a little magic. What do you do? You’d start fighting your way back, goblin-style, right?Funny Blade and Magic is a first-person action game packed with fast-paced melee combat, crazy spells, and ridiculous enemies. One minute you’re swinging an axe, the next you’re freezing time and teleporting behind your enemies like a boss (or a goblin to be accurate). The graphics are goofy but cool, the action is nonstop, and the storyline? Totally wild, with cinematic cutscenes that actually make you care about your little green guy. ControlsMove: WASDRun: ShiftJump: SpacebarDash: WASD + CAttack: Left Click or ZThrow Axe: Right Click or RUse Ability: FOpen Ability Menu: TabSelect Abilities: Keys 1–6How to Play Funny Blade and MagicYou start off as a betrayed goblin warrior an ex-king with nothing but your axe and a thirst for revenge. Explore wild levels filled with enemies, bosses, and magical energy. Eliminate all the enemies to complete levels. As you progress, collect weapons like swords, axes, and giant hammers. Then unlock awesome magical powers, think teleportation, time-slowing, and more.Your goal is to survive each fight, collect gear, and defeat unique bosses who all have their own tricks. Between battles, you’ll unlock story cutscenes that reveal the truth behind your betrayal. It’s like an action movie, but with goblins and goofy jokes.DeveloperFunny Blade and Magic was made by GoGoMan who loves combining action, humor, and fantasy into one chaotic ride.More Funny Action Games to Play NextFunny Blade and Magic hits that perfect mix of chaos, comedy, and cool powers. Whether you’re slicing enemies with a rusty sword or blasting them into another dimension, it’s always a good time. Perfect for quick sessions or longer binging, just don't blame us if you spend your whole lunch break trying to beat that next boss. If you liked Funny Blade and Magic, you’ll love our other funny games. For example, try Funny Shooter 2 next. There is no magic, but still funny! Crazy weapons and even crazier enemies await you there!This article was updated on April 17, 20253DActionArmorBattleBattle RoyaleCombatCrazyFreeFunFunnyUnityWeapon",
  "extractedAt": "2025-06-10T04:12:21.037Z",
  "localThumbnail": "Funny Blade and Magic_1749528741037.jpg"
}