{
  "url": "https://www.onlinegames.io/funny-shooter-2/",
  "title": "Funny Shooter 2",
  "category": "/t/action/",
  "thumbnail": "https://www.onlinegames.io/media/posts/630/Funny-Shooter-2.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/630/Funny-Shooter-2.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/630/responsive/Funny-Shooter-2-xs.jpg 384w, https://www.onlinegames.io/media/posts/630/responsive/Funny-Shooter-2-sm.jpg 600w, https://www.onlinegames.io/media/posts/630/responsive/Funny-Shooter-2-md.jpg 768w, https://www.onlinegames.io/media/posts/630/responsive/Funny-Shooter-2-lg.jpg 1200w",
    "alt": "Funny Shooter 2 Free Online Game",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://html5.gamedistribution.com/a1b7ac4025214a5cb0bd01a4f675513a/?gd_sdk_referrer_url=https://www.onlinegames.io/funny-shooter-2",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "How to Play Funny Shooter 2"
      },
      {
        "type": "h3",
        "text": "Weapon Shop"
      },
      {
        "type": "h3",
        "text": "Visit Upgrades Section"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "Explore Other Games"
      }
    ],
    "controls": [
      "WASD Keys: MoveR Key: ReloadG Key: GrenadeShift Key: RunSpace Key: JumpTab Key: PauseMouse: Look AroundLeft-Click: ShootRight-Click: AimMouse Scroller: Next Weapon1 - 7 Number Keys: Weapon Hotkeys"
    ],
    "howToPlay": "Don't let their absurdity be sweet to you. The red men are not friends. They have an urge to hurt you. Avoid their assaults while trying to wipe them off.You will fight them in a highly ludicrous arena. There are even giant hamburgers that you can come across. You will be in a different place at each level.Each enemy you eliminate will earn you coins. To collect coins, you must go over them.Unlock new weapons by using your money from the Weapon Shop. This way, you will strengthen your hand and resist their attacks with more power.There are ten levels, and each gets more challenging as you make progress. The hardest part is you will face the Big Boss in the final level. Gather all your strength and attack him in the end!",
    "tips": "",
    "developer": "Funny Shooter 2 was developed by GoGoMan.",
    "similarGames": []
  },
  "fullContent": "Home› ShootingFunny Shooter 2By OnlineGames.ioMake Game Full ScreenFunny Shooter 2 is a fun FPS game where you deal with many bizarre creatures. Intense battles with these red-colored enemies will take place. They will run to you and try to attack. Don't give them what they want. Dodge their assaults and shoot on their heads to get rid of them. Use your earned coins to buy new advanced arsenals in this funny shooting game!How to Play Funny Shooter 2Don't let their absurdity be sweet to you. The red men are not friends. They have an urge to hurt you. Avoid their assaults while trying to wipe them off.You will fight them in a highly ludicrous arena. There are even giant hamburgers that you can come across. You will be in a different place at each level.Each enemy you eliminate will earn you coins. To collect coins, you must go over them.Unlock new weapons by using your money from the Weapon Shop. This way, you will strengthen your hand and resist their attacks with more power.There are ten levels, and each gets more challenging as you make progress. The hardest part is you will face the Big Boss in the final level. Gather all your strength and attack him in the end!Weapon ShopEnter the Weapon Shop to see your arsenal options in the section. More than 15 weapons are at your disposal, each with a unique strength. You will find automatic rifles, a grenade launcher, pistols and snipers among them. They will be available when you unlock them with your earned coins. Additionally, you can customize your weapons by attaching scopes, silencers and lasers to them.Visit Upgrades SectionYour character has limited health power, a coin magnet scale, and grenades. But don't worry! You can upgrade these features of your character and increase the number of grenades from this section. Performing upgrades is a must for you to eliminate the Big Boss at the end. Otherwise, you will be powerless against him.ControlsWASD Keys: MoveR Key: ReloadG Key: GrenadeShift Key: RunSpace Key: JumpTab Key: PauseMouse: Look AroundLeft-Click: ShootRight-Click: AimMouse Scroller: Next Weapon1 - 7 Number Keys: Weapon HotkeysDeveloperFunny Shooter 2 was developed by GoGoMan.Explore Other GamesIf you like playing Funny Shooter 2, you may also try the first version of the sequel Funny Shooter. Here, as always, you will encounter red men and their attacks. They will throw bombs and forks at you. Dodge their invasions and try to survive!For further game options, you may look up other online FPS games on OnlineGames.io by following the link. If you have any suggestions or wishlist, please do not hesitate to contact us!This article was updated on May 9, 20243DActionArmorBattleBattle RoyaleCrazyFirst Person ShooterFreeFunFunnyGunShootingUnityWarWeapon",
  "extractedAt": "2025-06-10T04:15:07.750Z",
  "localThumbnail": "Funny Shooter 2_1749528907751.jpg"
}