{
  "url": "https://www.onlinegames.io/geometry-jump/",
  "title": "Geometry Jump",
  "category": "/t/arcade/",
  "thumbnail": "https://www.onlinegames.io/media/posts/845/Geometry-Jump.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/845/Geometry-Jump.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/845/responsive/Geometry-Jump-xs.jpg 384w, https://www.onlinegames.io/media/posts/845/responsive/Geometry-Jump-sm.jpg 600w, https://www.onlinegames.io/media/posts/845/responsive/Geometry-Jump-md.jpg 768w, https://www.onlinegames.io/media/posts/845/responsive/Geometry-Jump-lg.jpg 1200w",
    "alt": "Geometry Jump Play Online",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://html5.gamedistribution.com/9b634d67ddd6407c95effd409b947a76/?gd_sdk_referrer_url=https://www.onlinegames.io/games/geometry-jump/",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "How to Play Geometry Jump"
      },
      {
        "type": "h2",
        "text": "Stages Overview"
      },
      {
        "type": "h3",
        "text": "Unlockable Characters"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "Quick Reminder"
      },
      {
        "type": "h2",
        "text": "More Dash Games"
      }
    ],
    "controls": [
      "Jump: Tap, click or press spacebar to jump over obstacles"
    ],
    "howToPlay": "Start the game and choose your level among 15 levels.As you progress, stay alert for obstacles in lots of shapes.Use quick taps to jump and avoid crashing into them.Keep practicing to learn how you can use portals, jump orbs, jump pads, spaceships and other game objects.",
    "tips": "",
    "developer": "GM Media created Geometry Jump.",
    "similarGames": []
  },
  "fullContent": "Home› AvoidGeometry JumpBy OnlineGames.ioMake Game Full ScreenFor those players who are obsessed with Geometry Dash, we have another spin-off that will drive you mad! In Geometry Jump game, stop counting your attempts and focus on the rhythm instead. Break into the a world with all kinds of geometric shapes, spikes, chainsaws, rocket ships and many more. Seemingly, you have one job, and that's jumping! But it's hard to master. Let's see if you can handle this hurdle of obstacles!ControlsJump: Tap, click or press spacebar to jump over obstaclesHow to Play Geometry JumpStart the game and choose your level among 15 levels.As you progress, stay alert for obstacles in lots of shapes.Use quick taps to jump and avoid crashing into them.Keep practicing to learn how you can use portals, jump orbs, jump pads, spaceships and other game objects.Stages OverviewPreamble: Start off easy and get a feel for the game mechanics. Here, you'll learn how to jump over basic obstacles such as single, double and triple spikes.Let's Go!: Step it up as you race through colorful blocks that need quick reactions.Gravitational: Experience jumps that feel like you're bending gravity. You can fly over tricky gaps using orbs and pads.Drought: In this desert-themed level, new jump patterns are introduced, testing your ability to adapt.Data After Data: A futuristic world filled with bright neon lights and little blocks.Never Give Up: This is a motivational stage and it's all about keeping at it. Don't get discouraged and keep moving forward.Step Jump: Time your jumps just right to hop up shifting platforms that add an extra challenge.Teleporter: Use teleportation devices (mirror portals) to zip between sections quickly while avoiding obstacles that come your way.Circulation: You will go upside down with a spaceship.Xpart: Tricky level with new complex obstacle patterns.Indiscriminate: Expect the unexpected in this stage full of randomly generated obstacles.Truth: Discover hidden secrets in the Geometry world as you tackle tough jumps that help reveal the game's backstory.Space Exploration: Explore a cosmic landscape filled with asteroids and alien structures that you'll navigate with the spaceship.Associations: Jump through levels that connect obstacles in clever ways.Planet Hunt: Wrap up your journey by chasing after planets while dodging space debris and going for high scores!Unlockable CharactersExplore the in-game shop to discover 45 unlockable characters in Geometry Jump! Each character has a unique design and adds a fun twist to your gameplay. Collect them all as you progress through levels and customize your experience!DeveloperGM Media created Geometry Jump.Quick ReminderGeometry Jump is a great game to sharpen reflexes and improve spatial awareness and quick adaptation. But the difficult gameplay requires both intense focus and hand-eye coordination. So, we suggest you take breaks at least every 10 minutes to reduce the possibility of burnout and eye strain.More Dash GamesIf you enjoy Geometry Jump, you might also enjoy other obstacle games on OnlineGames.io. One alternative is Geometry Rash. Play it online, and let us know what you think in the comments section below!This article was updated on January 28, 20251 Player2DArcadeAvoidCrazyFreeMouseParkourSkill",
  "extractedAt": "2025-06-10T05:16:40.120Z",
  "localThumbnail": "Geometry Jump_1749532600120.jpg"
}