{
  "url": "https://www.onlinegames.io/geometry-rash/",
  "title": "Geometry Rash",
  "category": "/t/running/",
  "thumbnail": "https://www.onlinegames.io/media/posts/616/Geometry-Rash.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/616/Geometry-Rash.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/616/responsive/Geometry-Rash-xs.jpg 384w, https://www.onlinegames.io/media/posts/616/responsive/Geometry-Rash-sm.jpg 600w, https://www.onlinegames.io/media/posts/616/responsive/Geometry-Rash-md.jpg 768w, https://www.onlinegames.io/media/posts/616/responsive/Geometry-Rash-lg.jpg 1200w",
    "alt": "Geometry Rash Free Online Game",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2023/construct/279/geometry-rash/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "How to Play Geometry Rash"
      },
      {
        "type": "h2",
        "text": "All About Timing"
      },
      {
        "type": "h2",
        "text": "The Square Comes in Various Skins"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Who developed Geometry Rash?"
      },
      {
        "type": "h2",
        "text": "More Games Like This"
      }
    ],
    "controls": [
      "Use left-click, spacebar, W or up arrow key to jump."
    ],
    "howToPlay": "The dash immediately starts after you hit the play button, launching the little square into action. So get your fingertips ready.You can use space, W, up arrow or left-click to jump. All these keys will do the same work.You need to jump over triangles; any collision with them will bring you back to the starting point.You can jump on flat surfaces, but do not hit them on the side.Collect stars on your way, and always keep an eye on the right to see what obstacles are coming along.The game will be more challenging as you progres. You will face different kinds of obstacles and a higher speed run.Give yourself some time to adjust to Geometry Rash since your first ride may not go as you expected. After a couple of trials, most players start to run better and enjoy the game.",
    "tips": "",
    "developer": "",
    "similarGames": []
  },
  "fullContent": "Home› ParkourGeometry RashBy OnlineGames.ioMake Game Full Screen The little square loves to dance! Dangerous obstacles keep coming on his way. Follow the rhythm, let him jump over the obstacles, and keep him out of trouble! It may sound simple, but Geometry Rash is a 2D action platformer game requiring very fast response. Sound on and put your reflexes to a high-stakes test in this game inspired by Geometry Dash!Enjoy the challenge, and see how far you can go in Geometry Rash! Share your high scores with us in the comment section below.How to Play Geometry RashThe dash immediately starts after you hit the play button, launching the little square into action. So get your fingertips ready.You can use space, W, up arrow or left-click to jump. All these keys will do the same work.You need to jump over triangles; any collision with them will bring you back to the starting point.You can jump on flat surfaces, but do not hit them on the side.Collect stars on your way, and always keep an eye on the right to see what obstacles are coming along.The game will be more challenging as you progres. You will face different kinds of obstacles and a higher speed run.Give yourself some time to adjust to Geometry Rash since your first ride may not go as you expected. After a couple of trials, most players start to run better and enjoy the game. All About TimingSince Geometry Rash is a one-button game, there is only one aspect you should pay close attention to when to jump.Jumping too early will make your square fall on spikes. If you wait too long before moving, then you will hit an obstacle.The game will speed up as you progress. You should be constantly adjusting to speed and various kinds of obstacles.The Square Comes in Various SkinsYou can customize the square character as you like. There are 20 different skins that you can unlock. Each one costs 50 stars. You can collect while running.What you will unlock is a surprise. But here is a little secret for you. You may even come across a Spiderman square.ControlsUse left-click, spacebar, W or up arrow key to jump.Who developed Geometry Rash?Freezenova developed Geometry Rash.More Games Like ThisIf you're a fan of the popular Geometry Dash game, check out the Scratch version of it: Geometry Dash Scratch, which is another exciting running game. In this game, you'll find yourself in a universe filled with obstacles that you'll need to overcome.The game also features a rhythm-based setting that adds to the overall challenge and excitement. If you're looking for more running games online, head over to running games tag, where you'll find a variety of options to choose from.Don't forget to visit us again, as we're constantly updating our selection of web games with new and captivating titles!Embed URL:https://www.onlinegames.io/games/2023/construct/279/geometry-rash/index.htmlThis article was updated on January 28, 20251 Player2DActionArcadeAvoidCrazyEmbeddableFreeHTML5MobileParkourRunningSkill",
  "extractedAt": "2025-06-10T05:51:10.736Z",
  "localThumbnail": "Geometry Rash_1749534670737.jpg"
}