{
  "url": "https://www.onlinegames.io/getting-over-it/",
  "title": "Getting Over It",
  "category": "/new-games/",
  "thumbnail": "https://www.onlinegames.io/media/posts/563/Getting-Over-It.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/563/Getting-Over-It.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/563/responsive/Getting-Over-It-xs.jpg 384w, https://www.onlinegames.io/media/posts/563/responsive/Getting-Over-It-sm.jpg 600w, https://www.onlinegames.io/media/posts/563/responsive/Getting-Over-It-md.jpg 768w, https://www.onlinegames.io/media/posts/563/responsive/Getting-Over-It-lg.jpg 1200w",
    "alt": "Getting Over It Free Online Game",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://unblocked-games.s3.amazonaws.com/games/2023/scratch/getting-over-it-scratch/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "How to Play Getting Over It"
      },
      {
        "type": "h3",
        "text": "Mastering the Hammer"
      },
      {
        "type": "h3",
        "text": "The parkour of Getting Over It"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "Other Scratch Games"
      }
    ],
    "controls": [
      "Use your mouse to move the cat in the pot."
    ],
    "howToPlay": "Getting Over It is such an extraordinary game that you will have a lot of fun playing it. There is a parkour built on the sea here. You will face many obstacles in this parkour. In order to overcome them, you need to acquire the mastery of using the hammer in the most correct way. After achieving this mastery, you can overcome any obstacle you may encounter.",
    "tips": "",
    "developer": "Getting Over It was created by Griffpatch.",
    "similarGames": []
  },
  "fullContent": "Home› PhysicsGetting Over ItBy OnlineGames.ioMake Game Full ScreenGetting Over It is an arcade game where the player tries to climb up the cat through parkour using a trusty hammer. You need to help the cat to overcome many obstacles. Strategically manipulate the hammer and move forward. Overcoming the challenges will be a very difficult course. If you are confident in your control abilities, let's get started!How to Play Getting Over ItGetting Over It is such an extraordinary game that you will have a lot of fun playing it. There is a parkour built on the sea here. You will face many obstacles in this parkour. In order to overcome them, you need to acquire the mastery of using the hammer in the most correct way. After achieving this mastery, you can overcome any obstacle you may encounter.Mastering the HammerWhen you start the game, you will see a pot on the parkour and a cat inside it. Since this cat can not move its legs, you must move it with a hammer.So how do you do this? With your mouse, you can use the hammer in the cat's hand in any direction.When the hammer comes into contact with any object, it will receive a force to move the pot. In this way, you need to move it along the parkour.To move the cat forward, hook the hammer to an object and pull the cat towards the hammer.Conversely, if you want to move the cat backward, you must push against the hammer instead of pulling.The parkour of Getting Over ItThe parkour in the game is a parkour with ups and downs, created by bringing random shapes together.Along with the parkour, you will come across not only random shapes but also brooms, giant apples and bananas, and milk packages from time to time. Sometimes, you can skip a large section and crash back to sea level just as you think you've passed. But don't give up! Try again and again.ControlsUse your mouse to move the cat in the pot.DeveloperGetting Over It was created by Griffpatch.Other Scratch GamesIf you like playing Getting Over It, you may give a chance to Swing Monkey. You swing the monkey between rings by tapping and holding the mouse button in this amusing skill game. Your main goal here is to get the monkey through the rings and to the finish line. As you get the monkey to the finish line, you will advance to the next level.For further game options, you may look up the Scratch games tag on OnlineGames.io. You can access dozens of enjoyable games that may interest you for free. If you have any suggestions or requests, reach out to us via e-mail!This article was updated on January 28, 20252DAnimalArcadeCatCrazyFreeFunnyHTML5MouseParkourPhysicsScratchSkill",
  "extractedAt": "2025-06-10T06:16:53.439Z",
  "localThumbnail": "Getting Over It_1749536213440.jpg"
}