{
  "url": "https://www.onlinegames.io/gigga-io/",
  "title": "Gigga io",
  "category": "/t/io-games/",
  "thumbnail": "https://www.onlinegames.io/media/posts/792/Gigga-io.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/792/Gigga-io.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/792/responsive/Gigga-io-xs.jpg 384w, https://www.onlinegames.io/media/posts/792/responsive/Gigga-io-sm.jpg 600w, https://www.onlinegames.io/media/posts/792/responsive/Gigga-io-md.jpg 768w, https://www.onlinegames.io/media/posts/792/responsive/Gigga-io-lg.jpg 1200w",
    "alt": "Gigga.io Online Game",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://cloud.onlinegames.io/games/2024/more/gigga-io/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "How to Play Gigga io"
      },
      {
        "type": "h3",
        "text": "Slippery Shapes"
      },
      {
        "type": "h3",
        "text": "Other Tank Pilots"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "Discover More Games"
      }
    ],
    "controls": [
      "WASD or the Arrow Keys: Steer the TankLeft-Click or the Spacebar: ShootMouse: Look Around and Aim"
    ],
    "howToPlay": "The first thing to do is to determine which game mode you want to play. There are three unique game modes: Free For All, 2 Team Deathmatch and Domination.After all is set, you will find yourself on a dynamic battlefield. Your main objective in this io game is to direct your basic tank in this field and shoot the geometric shapes and projectiles to advance it up.Each shape and projectile you destroy will bring you upgrade points. Use them to enhance your tank's features and dominate the field!",
    "tips": "",
    "developer": "Gigga io was developed by Diep.io fans.",
    "similarGames": []
  },
  "fullContent": "Home› io GamesGigga ioBy OnlineGames.ioMake Game Full ScreenIt's an intense battle between tanks and geometric shapes! Gigga io is a 2D io game where you try to advance your tank by shooting various geometric shapes and projectiles. It is the fan-made version of Diep.io!In the meantime, there will be other tank pilots to deal with in the arena. Level up and enhance your tank's features to dominate the playing field in this strategy game! Enjoy playing each of the three modes.ControlsWASD or the Arrow Keys: Steer the TankLeft-Click or the Spacebar: ShootMouse: Look Around and AimHow to Play Gigga ioThe first thing to do is to determine which game mode you want to play. There are three unique game modes: Free For All, 2 Team Deathmatch and Domination.After all is set, you will find yourself on a dynamic battlefield. Your main objective in this io game is to direct your basic tank in this field and shoot the geometric shapes and projectiles to advance it up.Each shape and projectile you destroy will bring you upgrade points. Use them to enhance your tank's features and dominate the field!Slippery ShapesShooting the shapes will not be that easy! Because they are slippery, they will begin sliding when you shoot them. You must develop precise aiming skills to clear them away from the playing field.Small ones are harder to target but easier to destroy. On the other hand, you can easily target larger ones, but it takes time to destroy them. Fortunately, each shape you destroy will earn you upgrade points.Other Tank PilotsThere will also be other tank pilots on the battlefield. However, you should be careful! Not everyone may be friendly. Especially those who have a more advanced tank than yours have a high probability of destroying you. That's why it's important to upgrade your tank. You can increase its health, damage, speed, body damage, bullet damage and more… You must dominate the field for ultimate joy!DeveloperGigga io was developed by Diep.io fans.Discover More GamesFor further options, you may look for the io games online tag on OnlineGames.io. We are constantly trying to expand our game range. If you have any suggestions or a wishes, please contact us!This article was updated on December 7, 20242DActionArenaBattleBattle RoyaleFreeio GamesMultiplayerShootingTankWarWeapon",
  "extractedAt": "2025-06-10T05:34:14.365Z",
  "localThumbnail": "Gigga io_1749533654366.jpg"
}