{
  "url": "https://www.onlinegames.io/granny-2/",
  "title": "Granny 2",
  "category": "/t/action/",
  "thumbnail": "https://www.onlinegames.io/media/posts/901/Granny-2-online.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/901/Granny-2-online.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/901/responsive/Granny-2-online-xs.jpg 384w, https://www.onlinegames.io/media/posts/901/responsive/Granny-2-online-sm.jpg 600w, https://www.onlinegames.io/media/posts/901/responsive/Granny-2-online-md.jpg 768w, https://www.onlinegames.io/media/posts/901/responsive/Granny-2-online-lg.jpg 1200w",
    "alt": "Granny 2 free online horror game",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://playhop.com/app/307198?utm_source=distrib&is-united-page=1&skip-guard=1&header=no&utm_medium=cristian-ovidiu&clid=8531463",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Escape the Haunted House"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "How to Play Granny 2"
      },
      {
        "type": "h2",
        "text": "Difficulty Levels"
      },
      {
        "type": "h3",
        "text": "Practice mode"
      },
      {
        "type": "h3",
        "text": "Easy mode"
      },
      {
        "type": "h3",
        "text": "Normal mode"
      },
      {
        "type": "h3",
        "text": "Hard Mode"
      },
      {
        "type": "h3",
        "text": "Extreme Mode"
      },
      {
        "type": "h2",
        "text": "More Jumpscare Games"
      }
    ],
    "controls": [
      "WASD: MoveMouse: Look aroundE: InteractC: Sit/StandR: HideSpace: Throw itemsHold F key: Escape traps"
    ],
    "howToPlay": "As you did in the first game of Granny, your objective is to escape the house within 5 days.Check every room for useful items, and be strategic with your choices. Search for items to unlock the main door or use the sewer to escape via the boat.Avoid making noise—Granny and Grandpa will hear you and come after you.Hide under beds or in wardrobes if they get too close. Use hiding spots wisely—if you're caught, it's game over.Watch out for traps—they can slow you down or leave you vulnerable. If you fall for a bear trap, hold the F key to to get away from it.Use weapons to temporarily stop them, but they'll recover quickly.Solve puzzles to progress and unlock new areas. You can restart your attempts after each failed night, but the house only gets harder the longer you stay.",
    "tips": "",
    "developer": "",
    "similarGames": []
  },
  "fullContent": "Home› EscapeGranny 2By OnlineGames.ioMake Game Full ScreenGet ready for another scary adventure in Granny 2 where the fear and suspense are amped up in a new, eerie location. You wake up in a dark, damp room in Grandpa's house, disoriented and with a headache. The house is filled with traps, mysterious items, and the constant threat of Granny and Grandpa. While Granny's hearing is as sharp as ever, Grandpa is a bit slower, but his eyesight is just as deadly. If he spots you, you better run fast!Escape the Haunted HouseThe main door is locked with multiple locks, and you must explore the house to find clues and items that will help you escape. If you make a sound by dropping something or stepping on a creaky floorboard, Granny will come running. Be sure to hide under beds or in wardrobes, but remember, they can still spot you if you're not careful!In addition to escaping the main door, there's another way out through the house's basement. A rusty boat lies waiting in the sewer, and if you can start it and unlock the gate, you might make your escape that way.You can also protect yourself with weapons you find around the house. These can temporarily stop Granny and Grandpa, giving you a brief window to move forward, but don't rely on them too long—they only buy you time.You have five days to escape, but the longer you stay, the harder it gets. Each night, the house becomes more dangerous, and by the second night, you'll start limping. Can you escape before time runs out?ControlsWASD: MoveMouse: Look aroundE: InteractC: Sit/StandR: HideSpace: Throw itemsHold F key: Escape trapsHow to Play Granny 2As you did in the first game of Granny, your objective is to escape the house within 5 days.Check every room for useful items, and be strategic with your choices. Search for items to unlock the main door or use the sewer to escape via the boat.Avoid making noise—Granny and Grandpa will hear you and come after you.Hide under beds or in wardrobes if they get too close. Use hiding spots wisely—if you're caught, it's game over.Watch out for traps—they can slow you down or leave you vulnerable. If you fall for a bear trap, hold the F key to to get away from it.Use weapons to temporarily stop them, but they'll recover quickly.Solve puzzles to progress and unlock new areas. You can restart your attempts after each failed night, but the house only gets harder the longer you stay.Difficulty LevelsGranny 2 offers five difficulty levels: Extreme, Hard, Normal, Easy, and Practice.Practice modeThis mode lets you explore without the danger of Granny and Grandpa, giving you a chance to plan your escape. But be warned, the house is never entirely safe, even in this mode.Easy modeIn this mode, Granny and Grandpa are a little slower, making it easier to outrun them. You also don't have to worry about creaky floors, which means you can move around the house without triggering Granny's hearing. While this mode still offers a challenge, it's more forgiving than the others, giving you a bit more breathing room. Perfect if you want to enjoy the puzzle-solving without too much stress.Normal modeNormal mode is the baseline for Granny 2. Here, Granny and Grandpa move at their usual pace, making the game a true test of your stealth, strategy, and quick thinking. Creaking floors will be a constant threat, so every step matters. This mode is ideal for players looking for a balanced experience.Hard ModeIn Hard mode, Granny and Grandpa step up their game. They move faster, which means you'll need to be quick on your feet and think fast to avoid being caught. The added difficulty doesn't stop there, though—there's an extra lock on the main door, making your escape even more challenging. If you're up for a real test of your survival instincts, this is the mode to choose.Extreme ModeExtreme mode is not for the faint-hearted. Granny and Grandpa move faster than you, and they'll relentlessly pursue you throughout the house. On top of that, there are two extra locks on the main door, adding even more pressure to your escape. This mode is designed for experienced players who thrive under intense pressure and want to push their nerves and survival skills to the limit.More Jumpscare GamesIf you love Granny 2 and want to keep testing your survival skills, check out more of our free horror games. Each game will push your wits and nerves to the limit, with new challenges to overcome. Let us know which one scares you the most in the comments!This article was updated on March 11, 20251 Player3DActionCrazyEscapeFreeHorrorSurvivalUnity",
  "extractedAt": "2025-06-10T04:15:26.822Z",
  "localThumbnail": "Granny 2_1749528926823.jpg"
}