{
  "url": "https://www.onlinegames.io/gt-cars-city-racing/",
  "title": "GT Cars City Racing",
  "category": "/t/car/",
  "thumbnail": "https://www.onlinegames.io/media/posts/1019/gt-cars-city-racing.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/1019/gt-cars-city-racing.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/1019/responsive/gt-cars-city-racing-xs.jpg 384w, https://www.onlinegames.io/media/posts/1019/responsive/gt-cars-city-racing-sm.jpg 600w, https://www.onlinegames.io/media/posts/1019/responsive/gt-cars-city-racing-md.jpg 768w, https://www.onlinegames.io/media/posts/1019/responsive/gt-cars-city-racing-lg.jpg 1200w",
    "alt": "GT Cars City Racing Online Game",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://html5.gamedistribution.com/60a97d022db7432eb82dd30fa7938e03/?gd_sdk_referrer_url=https://www.onlinegames.io/gt-cars-city-racing/",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Game Modes Explained"
      },
      {
        "type": "h3",
        "text": "Toy City"
      },
      {
        "type": "h3",
        "text": "Face to Face Race Mode"
      },
      {
        "type": "h3",
        "text": "Mega Ramps"
      },
      {
        "type": "h2",
        "text": "Customize Your Ride"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "More 3D Driving Games Online"
      }
    ],
    "controls": [
      "Player 1:",
      "Move: WASDNitro: ShiftRepair: RCamera: C",
      "Player 2:",
      "Move: Arrow KeysNitro: NRepair: UCamera: K"
    ],
    "howToPlay": "",
    "tips": "",
    "developer": "GT Cars City Racing is created by GameVGames, known for bright, accessible, and over-the-top driving games.",
    "similarGames": []
  },
  "fullContent": "Home› CarGT Cars City RacingBy OnlineGames.ioMake Game Full ScreenGT Cars City Racing is a fun 3D driving game where you can race solo or compete with a friend in split-screen mode. The game packs up everything you love in car games: super sport GT cars, a sandbox mode with a great playground, head-to-head races and robot wars!In the sandbox mode, which is called Toy City, you drive through a colorful sandbox filled with fun mini-games like knocking over bowling pins, smashing robots, or jumping into pools. Face to Face is a competitive race mode where your car changes every lap, challenging you to adapt quickly and finish all five laps before your rivals. Mega Ramps throws you into a time-based race where a giant robot tries to destroy your car as you speed down massive ramps. GT Cars City Racing also lets you customize your GT car with different colors and effects. You can even paint the rims! With its bright 3D visuals, wild stunts, quick load times and fun challenges, GT Cars City Racing will be your next obsession!ControlsPlayer 1:Move: WASDNitro: ShiftRepair: RCamera: CPlayer 2:Move: Arrow KeysNitro: NRepair: UCamera: KGame Modes ExplainedThere are three different game modes + customization garage in the GT Cars City Racing. Toy CityThis is where the real fun begins. Toy City is a sandbox-style mode full of short missions and mini-games. The entire map feels like a giant toy playset! Each mission in Toy City is designed to be quick, fun, and physics-based. These missions are all about experimenting, having fun, and earning money while doing fun stunts. You can play them at your own pace and replay your favorites. It's the perfect mode if you want to take a break from racing and just goof around in a fun, colorful world. Here's what you can expect:Destroy the Robot: You aim your car at a giant toy robot and slam into it until it breaks apart. Parts go flying everywhere!Jump into the Pool: There's a big ramp that sends your car soaring into a pool. If you land it right, you get a splashy reward. It's one of the funnier missions.Knock Over Buildings: Some missions have you crash into huge bouncy balls that knock over blocky toy buildings like dominoes.Collect Diamonds: You'll drive through paths filled with glowing, floating diamonds. The more you collect, the more in-game money you earn to customize your ride.Fly Through Rings: These rainbow-colored hoops are floating in the air. Use ramps to launch your car and steer through the rings in mid-air.Scatter Balloons: Hit special crates that explode with balloons when your car smashes into them. It's chaotic and colorful!Bowling Challenge: Try to push giant balls into bowling pins or just drive straight into them yourself. Either way, the goal is to knock them all down.Face to Face Race ModeReady for a proper race? In this mode, you'll speed toward the finish line, and once you reach it, you'll switch cars (like a truck, mini SUV, or sports car), and your next lap begins instantly. You'll go through 5 vehicle swaps. First to complete all 5 wins!Mega RampsIn this time trial race mode, you drive down massive ramps while a giant robot tries to stop you. It might throw stuff at you or damage your car directly. If your health bar hits zero, your car falls off the edge or time runs out, you're out! Can you survive this madness and cross the finish line?Customize Your RideIf you want a fiery red GT over a glowing blue sports car with neon rims, it's all here. Now, head to the Customize tab on main menu and make your car look exactly how you want. You can:Change body paint, rim color, windows, and lightsPick cool nitro effects and flashy tail colorsWatch ads to unlock gems or cash for upgradesDeveloperGT Cars City Racing is created by GameVGames, known for bright, accessible, and over-the-top driving games. More 3D Driving Games OnlineIf you're into stunt driving and arcade-style races, you'll love Crazy Car Arena. It features massive jumps, tricky obstacle tracks, and weirdly fun cars to unlock. Perfect for fans of Mega Ramps or Toy City mayhem! With fun toylike maps, lots of game modes, and two player split-screen feature, GT Cars City Racing is your new go-to browser game for laughs, races, and stunt madness. So buckle up, customize your ride, and play it free now on OnlineGames.io!This article was updated on May 30, 20252 Player3DCarCrazyDrivingFreeFunRacingSimulatorSpeedStuntUnity",
  "extractedAt": "2025-06-10T05:19:52.702Z",
  "localThumbnail": "GT Cars City Racing_1749532792702.jpg"
}