{
  "url": "https://www.onlinegames.io/guerrillas-io/",
  "title": "Guerrillas io",
  "category": "/t/action/",
  "thumbnail": "https://www.onlinegames.io/media/posts/423/Guerillas-Io-Keyboard-Controls.webp",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/423/Guerillas-Io-Keyboard-Controls.webp",
    "srcset": "https://www.onlinegames.io/media/posts/423/responsive/Guerillas-Io-Keyboard-Controls-xs.webp 384w, https://www.onlinegames.io/media/posts/423/responsive/Guerillas-Io-Keyboard-Controls-sm.webp 600w, https://www.onlinegames.io/media/posts/423/responsive/Guerillas-Io-Keyboard-Controls-md.webp 768w, https://www.onlinegames.io/media/posts/423/responsive/Guerillas-Io-Keyboard-Controls-lg.webp 1200w",
    "alt": "Guerillas Io Keyboard Controls",
    "width": 750,
    "height": 224,
    "className": "is-loaded",
    "parentClass": "post__image post__image--center is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2023/unity2/guerrillas-io/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "How to Play Guerrillas io?"
      },
      {
        "type": "h2",
        "text": "Game Modes"
      },
      {
        "type": "h2",
        "text": "Customization"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "Similar Games"
      }
    ],
    "controls": [
      "Use the WASD keys or the Arrow keys to moveUse the Left mouse click to fireUse the Right mouse click to aimUse the Space key to jumpUse the Q key to slide while runningUse the Left Shift to runUse 1, 2, 3 to change weaponUse the E or F key to interact/pick up a weaponUse the G key to throw available grenadesUse the H key to use an available medkitUse the T key to chatUse the L key to toggle the cursor lockUse the C key to crouchUse the Hold Tab to show the scoreboardUse the ESC to pause"
    ],
    "howToPlay": "Guerrillas io offers you an online battling environment. You participate in a game by joining one of the available rooms or by creating a new room in the online option. On the left side of the menu screen, you will see a box called \"Rooms.\" You can see available rooms or open a new one when you click here. By creating a new room, you can choose how many players can join the battle, the game mode, the road time, the goal, the bots and the map. All is up to your vision!Also, from the menu, you can see and adjust your equipment by entering the \"Armoury\" section, obtain power-ups from the \"Perks\" section, or decide what to give as a death message from the \"Kill Message.\"",
    "tips": "",
    "developer": "Guerrillas io was created by FreezeNova.",
    "similarGames": [
      {
        "title": "Masked Special Forces",
        "url": "https://www.onlinegames.io/masked-special-forces/"
      }
    ]
  },
  "fullContent": "Home› ShootingGuerrillas ioBy OnlineGames.ioMake Game Full ScreenYou are a particular elite team member and are called into battle. Your weapons are ready, and your equipment is prepared. All your team needs is you. Guerrillas io is a multiplayer battling game that you can play online. Game maps are inspired by Counter-Strike, the best-known video game, and may look familiar to you! Time is running out. If you are ready, let's start!How to Play Guerrillas io?Guerrillas io offers you an online battling environment. You participate in a game by joining one of the available rooms or by creating a new room in the online option. On the left side of the menu screen, you will see a box called \"Rooms.\" You can see available rooms or open a new one when you click here. By creating a new room, you can choose how many players can join the battle, the game mode, the road time, the goal, the bots and the map. All is up to your vision!Also, from the menu, you can see and adjust your equipment by entering the \"Armoury\" section, obtain power-ups from the \"Perks\" section, or decide what to give as a death message from the \"Kill Message.\"Game ModesBefore we start, we need to choose a game mode. Game modes are as follows:Team Deathmatch: The players are divided into 2 teams in which they are battling against each other.Free for All: In this game mode, all players are alone. Create your own strategy to survive.Capture the Flag: This is, again, a teamwork gameplay. You must take the flag from the enemy's base and return it to your location.Gun Game: This game mode is a mode that allows new weapons to be unlocked. You start with the simplest weapon and continue by updating the weapons.Arcade Doom: You are invincible in Arcade Doom, as you can possess guns and grenade launchers.CustomizationGuerrillas io gives you the option to customize your weapons. You can view your guns by clicking the \"Armoury\" section from the menu. Choose the weapon you want to customize and start strengthening it. You can buy new weapons here and change the appearance and scope of your existing weapon. You can also get a silencer if you want.ControlsUse the WASD keys or the Arrow keys to moveUse the Left mouse click to fireUse the Right mouse click to aimUse the Space key to jumpUse the Q key to slide while runningUse the Left Shift to runUse 1, 2, 3 to change weaponUse the E or F key to interact/pick up a weaponUse the G key to throw available grenadesUse the H key to use an available medkitUse the T key to chatUse the L key to toggle the cursor lockUse the C key to crouchUse the Hold Tab to show the scoreboardUse the ESC to pauseDeveloperGuerrillas io was created by FreezeNova.Similar GamesYou may try another io game, Masked Special Forces, where you are a masked soldier who needs to beat the opponents if you enjoy playing Guerrillas io. You can also look up the io Games tag on OnlineGames.io for more free online shooting game alternatives.Embed URL:https://www.onlinegames.io/games/2023/unity2/guerrillas-io/index.htmlThis article was updated on February 22, 20243DActionArmyBattle RoyaleEmbeddableFirst Person ShooterFreeio GamesShooting",
  "extractedAt": "2025-06-10T04:13:48.092Z",
  "localThumbnail": "Guerrillas io_1749528828092.jpg"
}