{
  "url": "https://www.onlinegames.io/halloween-survival/",
  "title": "Halloween Survival",
  "category": "/t/shooting/",
  "thumbnail": "https://www.onlinegames.io/media/posts/450/Halloween-Survival.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/450/Halloween-Survival.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/450/responsive/Halloween-Survival-xs.jpg 384w, https://www.onlinegames.io/media/posts/450/responsive/Halloween-Survival-sm.jpg 600w, https://www.onlinegames.io/media/posts/450/responsive/Halloween-Survival-md.jpg 768w, https://www.onlinegames.io/media/posts/450/responsive/Halloween-Survival-lg.jpg 1200w",
    "alt": "Halloween Survival Play Online",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://html5.gamedistribution.com/0cd221dc4ef1428db6d884ba9ba9796e/?gd_sdk_referrer_url=https://www.onlinegames.io/halloween-survival",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "How to Play Halloween Survival?"
      },
      {
        "type": "h3",
        "text": "Multiplayer"
      },
      {
        "type": "h3",
        "text": "Singleplayer"
      },
      {
        "type": "h3",
        "text": "Weapons"
      },
      {
        "type": "h3",
        "text": "Armors and Masks"
      },
      {
        "type": "h3",
        "text": "Attacking Creatures"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Similar Games"
      }
    ],
    "controls": [
      "Use the WASD or the Arrow keys to moveUse the Left-click to shootUse the C key to crouchUse the R key to reloadUse the F key to pick up a gunUse the 1, 2 , 3 to change weaponUse the Space key to jumpUse the P key to go to the menu"
    ],
    "howToPlay": "Halloween Survival is a shooting game where you battle at midnight. Your view is limited. You have to fight monsters that try to attack you to survive.",
    "tips": "",
    "developer": "",
    "similarGames": [
      {
        "title": "ArmedForces.io",
        "url": "https://www.onlinegames.io/armedforces-io/"
      }
    ]
  },
  "fullContent": "Home› ShootingHalloween SurvivalBy OnlineGames.ioMake Game Full Screen Hunting season is opening! All the bats, mummies, and butchers with knives were released. Halloween Survival is a multiplayer game where you battle bad creatures in a misty place at midnight. You can play Halloween Survival with your friends by creating a room. Or, you can click on \"Quick Playing\" and join one of the available rooms.How to Play Halloween Survival?Halloween Survival is a shooting game where you battle at midnight. Your view is limited. You have to fight monsters that try to attack you to survive.MultiplayerHalloween Survivals offers you a multiplayer game option. You can play with your friends or connect with other players worldwide. You must create a room or enter an available one by tapping \"Play Online\" from the menu.SingleplayerYou can also hang out alone if you don't want to play with others. When you tap the \"Play Offline\" from the menu, a screen opens where you can select the game mode, Survival or Doomsday. Choose whichever you want and start to play.WeaponsYou can buy new weapons or upgrade the equipped ones from the \"Weapons\" section. You will earn money as you level up. And you can use these coins to strengthen your weapons and armor. Some weapons can only be unlocked at certain levels. You have only 3 weapon slots, so you must use them with the proper guns efficiently.Armors and MasksYou can customize your character's appearance by purchasing new armor and masks. You can access them from the \"Armor\" section of the menu.Attacking CreaturesHere, you will be attacked by different kinds of creatures. Some of these will be stinky mummies, while others will be bats. You may even encounter wicked witches and Frankenstein himself.ControlsUse the WASD or the Arrow keys to moveUse the Left-click to shootUse the C key to crouchUse the R key to reloadUse the F key to pick up a gunUse the 1, 2 , 3 to change weaponUse the Space key to jumpUse the P key to go to the menuSimilar GamesTry ArmedForces.io, another multiplayer shooting game with a range of equipment options that you may like if you enjoy playing Halloween Survival. Look for other shooting and action for more game options on OnlineGames.io.This article was updated on December 20, 20233DActionCrazyFirst Person ShooterFreeGunHorrorMultiplayerShootingSurvivalUnityWeaponZombie",
  "extractedAt": "2025-06-10T05:42:04.572Z",
  "localThumbnail": "Halloween Survival_1749534124572.jpg"
}