{
  "url": "https://www.onlinegames.io/head-basketball/",
  "title": "Head Basketball",
  "category": "/t/sports/",
  "thumbnail": "https://www.onlinegames.io/media/posts/486/Head-Basketball.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/486/Head-Basketball.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/486/responsive/Head-Basketball-xs.jpg 384w, https://www.onlinegames.io/media/posts/486/responsive/Head-Basketball-sm.jpg 600w, https://www.onlinegames.io/media/posts/486/responsive/Head-Basketball-md.jpg 768w, https://www.onlinegames.io/media/posts/486/responsive/Head-Basketball-lg.jpg 1200w",
    "alt": "Head Basketball Play Online",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2022/unity/head-basketball/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "How to Play Head Basketball"
      },
      {
        "type": "h3",
        "text": "Customization in Head Basketball"
      },
      {
        "type": "h3",
        "text": "Game Options in Head Basketball"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Discover More Games Like Head Basketball"
      }
    ],
    "controls": [
      "Use the WASD or the arrow keys to move your player.Use the Space key to shoot the ball."
    ],
    "howToPlay": "Head Basketball is a straightforward game to play, and it offers you a wide range of customization options. You can choose your best-known basketball player in the NBA and decide which jersey and shoe to wear among several in a match. You can make your game funny and even have the most famous NBA player play a basketball game in high heels!",
    "tips": "",
    "developer": "",
    "similarGames": []
  },
  "fullContent": "Home› BasketballHead BasketballBy OnlineGames.ioMake Game Full ScreenAre you ready for a basketball match with the most famous players in the NBA? Head Basketball is a one-on-one basketball game where you play as a renowned basketball player. You must send the balls to your opponent's basket and make successful hits before your rival gets ahead of you.How to Play Head BasketballHead Basketball is a straightforward game to play, and it offers you a wide range of customization options. You can choose your best-known basketball player in the NBA and decide which jersey and shoe to wear among several in a match. You can make your game funny and even have the most famous NBA player play a basketball game in high heels!Customization in Head BasketballYou may make some customizations before starting the basketball match. Once you decide which player you will play with, you also have the options to choose the type of basketball and the basketball court you will play on.Game Options in Head BasketballYou can determine what time of day the basketball match will take place. You may play during the day or at night if you want.Besides deciding which part of the day you will play, you may make a decision on under which weather conditions you will play. You can play on a sunny day or when it's raining.You can decide the match time yourself and organize matches that will last a minimum of 60 seconds and a maximum of 300 seconds.Here, you will compete against artificial intelligence. You can control the difficulty level of your game.ControlsUse the WASD or the arrow keys to move your player.Use the Space key to shoot the ball.Discover More Games Like Head BasketballTry Head Soccer Football, where you pick your favorite football player among the famous football players and compete if you love playing Head Basketball. Alternatively, you may look up other free Basketball game collections on OnlineGames.io for further options. Please tell us about your gaming experience in the comment section below!Embed URL:https://www.onlinegames.io/games/2022/unity/head-basketball/index.htmlThis article was updated on May 9, 20242DArcadeArenaBallBasketballCrazyEmbeddableFreeFunKidsMobilePhysicsSports",
  "extractedAt": "2025-06-10T05:53:32.030Z",
  "localThumbnail": "Head Basketball_1749534812031.jpg"
}