{
  "url": "https://www.onlinegames.io/head-soccer-2022/",
  "title": "Head Soccer 2022",
  "category": "/t/arcade/",
  "thumbnail": "https://www.onlinegames.io/media/posts/624/Head-Soccer-2022.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/624/Head-Soccer-2022.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/624/responsive/Head-Soccer-2022-xs.jpg 384w, https://www.onlinegames.io/media/posts/624/responsive/Head-Soccer-2022-sm.jpg 600w, https://www.onlinegames.io/media/posts/624/responsive/Head-Soccer-2022-md.jpg 768w, https://www.onlinegames.io/media/posts/624/responsive/Head-Soccer-2022-lg.jpg 1200w",
    "alt": "Head Soccer 2022 Free Online Game",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2023/construct/280/head-soccer-2022/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "How to Play Head Soccer 2022"
      },
      {
        "type": "h3",
        "text": "The Heads of the Football Players"
      },
      {
        "type": "h3",
        "text": "A Match with the CPU"
      },
      {
        "type": "h3",
        "text": "Duello with a Friend"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Can I play Head Soccer 2022 on my mobile?"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "Similar Sports Games"
      }
    ],
    "controls": [
      "1P Arcade",
      "Arrow Keys: MoveZ and X Keys: Shoot",
      "2P Versus",
      "Player 1",
      "WASD Keys: MoveN and M Keys: Shoot",
      "Player 2",
      "Arrow Keys: Move1 and 2 Number Keys: Shoot",
      "Mobile Devices",
      "Touchscreen Buttons: Move and Shoot"
    ],
    "howToPlay": "Begin with determining which game mode you want to play in. You will see two modes on the menu: 1 Player and 2 Player. If you're going to play against the CPU, use the single-player option. Or, you can make football duels with a friend in 2 Player mode. After deciding on the game mode, it's time to choose your favorite football player. Then, you are all set to go!",
    "tips": "",
    "developer": "Head Soccer 2022 was developed by FreezeNova.",
    "similarGames": [
      {
        "title": "Head Basketball",
        "url": "https://www.onlinegames.io/head-basketball/"
      }
    ]
  },
  "fullContent": "Home› SoccerHead Soccer 2022By OnlineGames.ioMake Game Full ScreenHead Soccer 2022 is a 2D sports game in which you engage in football matches with a friend or against the CPU. The first thing to do is choose your beloved football player. You will take part in matches in his shoes! Be the one who scores the most and get your World Cup in this thrilling arcade game!⚽How to Play Head Soccer 2022Begin with determining which game mode you want to play in. You will see two modes on the menu: 1 Player and 2 Player. If you're going to play against the CPU, use the single-player option. Or, you can make football duels with a friend in 2 Player mode. After deciding on the game mode, it's time to choose your favorite football player. Then, you are all set to go!The Heads of the Football PlayersWhichever game mode you decide to play on, you have to choose the football player you will play with! Renowned players from Argentina, America, Brazil, Spain and many more are waiting for you to play with them. You will see their giant heads on a table before going to the football field. In 1P mode, use your mouse click to choose. Use the WASD and arrow keys to select the characters in 2P mode.A Match with the CPUPractice with matches against the CPU. Don't just call it a computer; it might be hard on you! The CPU will automatically choose its character. Remember that the challenging levels will increase in phases as you win matches. You have 45 seconds in the mode. Try to score as many goals as possible in this short period.Duello with a FriendPlaying with a buddy will be very enjoyable! Once you both choose your football player, you are ready for a match. You have 60 seconds in the 2P mode. The one who scores the most is the winner!Controls1P ArcadeArrow Keys: MoveZ and X Keys: Shoot2P VersusPlayer 1WASD Keys: MoveN and M Keys: ShootPlayer 2Arrow Keys: Move1 and 2 Number Keys: ShootMobile DevicesTouchscreen Buttons: Move and ShootCan I play Head Soccer 2022 on my mobile?Yes, you can play Head Soccer 2022 on your mobile devices. However, some of the models may only support 1 player mode.DeveloperHead Soccer 2022 was developed by FreezeNova.Similar Sports GamesIf you enjoy playing Head Soccer 2022, you may also like playing Head Basketball. Choose your favorite NBA basketball player in the game, customize your game settings as you wish and go to the basketball court. Shoot as many baskets as you can!For more game options, you may look for other sports games on OnlineGames.io by following the link. Bookmark this website to access new games easily!Embed URL:https://www.onlinegames.io/games/2023/construct/280/head-soccer-2022/index.htmlThis article was updated on May 9, 20242 Player2DArcadeArenaBallCrazyEmbeddableFreeFunFunnyHTML5KidsMobileSoccerSportsWorld Cup",
  "extractedAt": "2025-06-10T05:16:33.061Z",
  "localThumbnail": "Head Soccer 2022_1749532593062.jpg"
}