{
  "url": "https://www.onlinegames.io/highway-racer-2/",
  "title": "Highway Racer 2",
  "category": "/t/car/",
  "thumbnail": "https://www.onlinegames.io/media/posts/323/Highway-Racer-2.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/323/Highway-Racer-2.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/323/responsive/Highway-Racer-2-xs.jpg 384w, https://www.onlinegames.io/media/posts/323/responsive/Highway-Racer-2-sm.jpg 600w, https://www.onlinegames.io/media/posts/323/responsive/Highway-Racer-2-md.jpg 768w, https://www.onlinegames.io/media/posts/323/responsive/Highway-Racer-2-lg.jpg 1200w",
    "alt": "Highway Racer 2 Play Online",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2022/unity2/highway-racer-2/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "How to Play Highway Racer 2?"
      },
      {
        "type": "h2",
        "text": "What is Highway Racer 2?"
      },
      {
        "type": "h2",
        "text": "Game Modes"
      },
      {
        "type": "h2",
        "text": "Upgrades and Modifications"
      },
      {
        "type": "h2",
        "text": "Similar Games"
      }
    ],
    "controls": [],
    "howToPlay": "Playing Highway Racer 2 is no different from playing other car games. You can find the controls below:\n\nUse WASD or the Arrow keys to steer the carUse the Left Shift to boost your carUse the Space key to use the handbrakeUse the C key to change the camera view",
    "tips": "",
    "developer": "",
    "similarGames": [
      {
        "title": "Highway Traffic",
        "url": "https://www.onlinegames.io/highway-traffic/"
      }
    ]
  },
  "fullContent": "Home› DrivingHighway Racer 2By OnlineGames.ioMake Game Full ScreenAre you ready to raise clouds of dust on the highway? Highway Racer 2 is a 3D car driving game where your main goal is passing by sharp maneuvers as close as possible to the sides of cars on the highway. I know this is very dangerous, but it makes your adrenaline skyrocket!How to Play Highway Racer 2?Playing Highway Racer 2 is no different from playing other car games. You can find the controls below:Use WASD or the Arrow keys to steer the carUse the Left Shift to boost your carUse the Space key to use the handbrakeUse the C key to change the camera viewWhat is Highway Racer 2?Highway Racer 2 is an online car game you can play on OnlineGames.io freely. You earn money for every vehicle you get past very closely in this game. With the money you make, you can unlock new cars or upgrade existing vehicles. You have given 6 different car options in the beginning. You can choose whichever you want and start to wander on the highway.Game ModesAfter selecting your car on the menu, you must choose the game mode you want to play. Highway Racer 2 offers you 5 different modes. These are:One Way: As the name suggests, the highway is one-way in the One Way mode. All cars move in the same direction.Two Way: In the Two Way mode, cars move in both directions. So you have to think twice when driving on the two-way highway.Time Attack: In the Time Attack mode, you are given a certain amount of time and have to pass as close to the vehicle as you can during this time.Speed Bomb: In the Speed Bomb mode, a speed bomb is attached to the car. If you hit a vehicle, the health of the bomb will decrease, and if it reaches zero, it will explode... You need to be careful!Multiplayer: In the Multiplayer mode, you can play the game with more than one person. To do this, you only have to set up a room or enter an existing one.Upgrades and ModificationsHighway Racer 2 allows you to tune your car as you wish. You can increase the torque power of the car, change its color, and strengthen the brake settings. You can change the color of your vehicle and add a spoiler to it and more... All is up to you!Similar GamesIf you enjoy Highway Racer 2, try playing Racing Horizon, Drift Hunters Pro and Highway Traffic. Embed URL:https://www.onlinegames.io/games/2022/unity2/highway-racer-2/index.htmlThis article was updated on February 22, 20243DCarCrazyDrivingEmbeddableFreeMultiplayerRacingSimulatorSpeedTraffic",
  "extractedAt": "2025-06-10T05:28:41.816Z",
  "localThumbnail": "Highway Racer 2_1749533321816.jpg"
}