{
  "url": "https://www.onlinegames.io/hill-climb-racing-scratch/",
  "title": "Hill Climb Racing Scratch",
  "category": "/t/car/",
  "thumbnail": "https://www.onlinegames.io/media/posts/748/Hill-Climb-Racing.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/748/Hill-Climb-Racing.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/748/responsive/Hill-Climb-Racing-xs.jpg 384w, https://www.onlinegames.io/media/posts/748/responsive/Hill-Climb-Racing-sm.jpg 600w, https://www.onlinegames.io/media/posts/748/responsive/Hill-Climb-Racing-md.jpg 768w, https://www.onlinegames.io/media/posts/748/responsive/Hill-Climb-Racing-lg.jpg 1200w",
    "alt": "Hill Climb Racing Scratch Play Online",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://turbowarp.org/897552162/embed?autoplay&addons=remove-curved-stage-border",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Overview of Hill Climb Racing Scratch"
      },
      {
        "type": "h3",
        "text": "Rotate in the Air"
      },
      {
        "type": "h3",
        "text": "Take Gasoline Cans"
      },
      {
        "type": "h3",
        "text": "What is the best car in Hill Climb Racing Scratch?"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "What is More?"
      }
    ],
    "controls": [
      "Right Arrow Key: Accelerate or Rotate counterclockwiseLeft Arrow Key: Brake or Rotate ClockwiseV Key: Swap Vehicles and Level"
    ],
    "howToPlay": "",
    "tips": "",
    "developer": "Griffpatch developed Hill Climb Racing Scratch.",
    "similarGames": []
  },
  "fullContent": "Home› CarHill Climb Racing ScratchBy OnlineGames.ioMake Game Full ScreenAre you ready to tackle steep hills? Hill Climb Racing Scratch is a 2D driving game where you are in charge of controlling a car on a track with many ups and downs. You must steer your vehicle artfully on this bumpy road.Your vehicle can be a blue motorcycle or a red car. Choose your favorite one among your two options and hit the road, Jack! Collect the score points to be the top driver on the leaderboard in this car game.ControlsRight Arrow Key: Accelerate or Rotate counterclockwiseLeft Arrow Key: Brake or Rotate ClockwiseV Key: Swap Vehicles and LevelOverview of Hill Climb Racing ScratchThis racing game will test your car driving skills to the utmost with its difficult roads. No matter what, you can't let any hill or pothole affect your steering ability! If you lose your control, your driver's neck can be broken by hitting the ground.Your first duty is to drive in a controlled manner to move safely on the road. The second one is to collect the score points on the way. Strive to break your highest record each time you set off the track in this driving game!Rotate in the AirIf you drive through any pothole or hill too fast, your car will tend to rotate. You can flip over vehicle by steering left or right while in the air. You must learn how to balance your vehicle to master performing rotations.If you manage to flip over successfully, you will get bonus points. However, keep in mind that you can't let your driver's neck get broken while trying to take all these actions. Otherwise, you will get back to the beginning!Take Gasoline CansYou must also be careful not to run out of gas in your car in order to take the longest distance in these difficult conditions. Keep checking the green fuel bar on the upper left corner of the screen.But don't worry! You will come across many gasoline cans on the road. When you take them, you will see that the fuel bar will fill up. Don't pass by without taking any petrol that you see.What is the best car in Hill Climb Racing Scratch?There are two vehicles to pick at your disposal: a blue motorcycle and a red car. You don't need to unlock any of them. Both are available, and they have the same power. Press the V key to switch between them.DeveloperGriffpatch developed Hill Climb Racing Scratch.What is More?You may also try playing Crazy Karts. You need to drive your kart vehicle in an arena full of other karts. Collect the gift boxes and get the necessary weapons to shoot your rivals, whether real players or AI bots.For additional options, look for other car games on OnlineGames.io. Please share your gaming experiences with us in the comment section below! We want to hear from you.This article was updated on May 26, 20241 Player2DCarCrazyDrivingEndlessFreePhysicsRacingScratchTrial",
  "extractedAt": "2025-06-10T05:27:58.714Z",
  "localThumbnail": "Hill Climb Racing Scratch_1749533278715.jpg"
}