{
  "url": "https://www.onlinegames.io/hook-wars/",
  "title": "Hook Wars",
  "category": "/new-games/",
  "thumbnail": "https://www.onlinegames.io/media/posts/610/Hook-Wars.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/610/Hook-Wars.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/610/responsive/Hook-Wars-xs.jpg 384w, https://www.onlinegames.io/media/posts/610/responsive/Hook-Wars-sm.jpg 600w, https://www.onlinegames.io/media/posts/610/responsive/Hook-Wars-md.jpg 768w, https://www.onlinegames.io/media/posts/610/responsive/Hook-Wars-lg.jpg 1200w",
    "alt": "Hook Wars Free Online Game",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2023/unity3/hook-wars/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "How to Play Hook Wars"
      },
      {
        "type": "h3",
        "text": "Sending the Hook"
      },
      {
        "type": "h3",
        "text": "Do Not Get Hooked"
      },
      {
        "type": "h3",
        "text": "Scoring in the Hook Wars"
      },
      {
        "type": "h3",
        "text": "Avoid Taking the Curse"
      },
      {
        "type": "h3",
        "text": "Red Boxing Glove"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "What is More?"
      }
    ],
    "controls": [
      "To move, use the WASD or the Arrow keys.To hook the avatars, use your left-click.Alternatively, you can also use the space key to hook."
    ],
    "howToPlay": "You will find yourself in an arena divided into two by a river.Many monsters are spawning on the other side.You must get them to your side by hooking them up one by one.Use your precise aiming skills to pull the avatars; the hook must touch them.To get more combo scores, try to hunt them faster.",
    "tips": "",
    "developer": "",
    "similarGames": []
  },
  "fullContent": "Home› CrazyHook WarsBy OnlineGames.ioMake Game Full Screen Hook Wars is a 3D battle game where you need to avoid being hooked by the avatars across the river. In the meantime, you will try to hook them and get them to your side. Precise aiming is crucial here. Challenge yourself to achieve the highest scores each time you try in this action game!How to Play Hook WarsYou will find yourself in an arena divided into two by a river.Many monsters are spawning on the other side.You must get them to your side by hooking them up one by one.Use your precise aiming skills to pull the avatars; the hook must touch them.To get more combo scores, try to hunt them faster.Sending the HookThey will be in motion while you are trying to hook the avatars. So, you must calculate their movements before sending the hook. You must have control over every movement to achieve success in this game.Do Not Get HookedLike you are trying to hunt them, they also take their chances to hook you. You must avoid getting hooked; otherwise, you will fail the game. The challenge is that the number of avatars increases as you advance in the game.Scoring in the Hook WarsEvery monster you hook earns you a +1 score.Hooking the Boss monsters will get you +3 scores. But, hooking the Bosses will be challenging as they are giant creatures.You must send hooks repeatedly until the blue bar on top of them drops to zero.Avoid Taking the CurseYou will see powerups on the ground from time to time while battling with minions and bosses. They may benefit you a lot during gameplay. They enable you to be more powerful. But, be careful of taking the Curse, green stuff, because it will slow you down. We leave it to you to discover what these powerups provide you.HasteQuick HookImmortalLucky DiceCurseRed Boxing GloveClick on the red boxing glove and see what character options you have. There are many crazy avatars here, each with the same prize. Use your in-game coins to unlock them.ControlsTo move, use the WASD or the Arrow keys.To hook the avatars, use your left-click.Alternatively, you can also use the space key to hook.What is More?If you are a fan of Hook Wars, you may also enjoy playing Dont Fall io. You will find yourself on a platform full of hexagon tiles. When you step on them, they start to disappear. Resist not to fall into the sea to be the winner!Or, you may look for other online crazy games on OnlineGames.io for further options. Bookmark the website to access the new games easily!Embed URL:https://www.onlinegames.io/games/2023/unity3/hook-wars/index.htmlThis article was updated on May 9, 20243DActionArenaAvoidBattleCrazyEmbeddableFreeFunFunnyUnity",
  "extractedAt": "2025-06-10T06:14:26.981Z",
  "localThumbnail": "Hook Wars_1749536066982.jpg"
}