{
  "url": "https://www.onlinegames.io/hospital-doctor/",
  "title": "Hospital Doctor",
  "category": "/new-games/",
  "thumbnail": "https://www.onlinegames.io/media/posts/516/Hospital-Doctor.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/516/Hospital-Doctor.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/516/responsive/Hospital-Doctor-xs.jpg 384w, https://www.onlinegames.io/media/posts/516/responsive/Hospital-Doctor-sm.jpg 600w, https://www.onlinegames.io/media/posts/516/responsive/Hospital-Doctor-md.jpg 768w, https://www.onlinegames.io/media/posts/516/responsive/Hospital-Doctor-lg.jpg 1200w",
    "alt": "Hospital Doctor Play Online",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://html5.gamedistribution.com/2887b948261b43cea783c8209c576844/?gd_sdk_referrer_url=https://www.onlinegames.io/hospital-doctor",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "How to Play Hospital Doctor"
      },
      {
        "type": "h3",
        "text": "Examine Your Patients"
      },
      {
        "type": "h3",
        "text": "Medical Instruments"
      },
      {
        "type": "h3",
        "text": "Meet A Funny Patient: Mr. Clown"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Explore More Games"
      }
    ],
    "controls": [
      "Use your left-click button and treat your patients."
    ],
    "howToPlay": "Enter the thrilling world of Hospital Doctor, an enjoyable hospital simulator. You will play as a renowned doctor who has to treat various sick people, including a sad clown.\n\nTap to the \"Play\" button and start examining your patients. You will see them lined up here. You can begin to heal them in turn.If you press the plus button in front of the patient, you will take them to the operating room.You will find your medical instruments in the room. Hold these instruments by pressing the left-click button. Drag them to the area where you will perform the procedure on the poor guy.You will need to use some tools until you heal your people. Once you are sure they are fully recovered, send them home.",
    "tips": "",
    "developer": "",
    "similarGames": []
  },
  "fullContent": "Home› HospitalHospital DoctorBy OnlineGames.ioMake Game Full ScreenHospital Doctor is a fun hospital game where you are a prominent doctor in this hospital. Your patients are waiting for your treatments.Examine them. Make your diagnosis and apply the necessary treatment. You need to heal them as soon as possible. Grab your medical equipment and get on duty immediately!How to Play Hospital DoctorEnter the thrilling world of Hospital Doctor, an enjoyable hospital simulator. You will play as a renowned doctor who has to treat various sick people, including a sad clown.Tap to the \"Play\" button and start examining your patients. You will see them lined up here. You can begin to heal them in turn.If you press the plus button in front of the patient, you will take them to the operating room.You will find your medical instruments in the room. Hold these instruments by pressing the left-click button. Drag them to the area where you will perform the procedure on the poor guy.You will need to use some tools until you heal your people. Once you are sure they are fully recovered, send them home.Examine Your PatientsEach patient's diagnosis and treatment process will be different. You may use different methods. For some, you will need to use an X-ray device. For others, you must cast a cast on their broken bones.Get ready for a wide variety of exciting hospital experiences!Medical InstrumentsFrom time to time, patients will come to you with open wounds, sometimes with broken bones or infected internal organs. The medical equipment you will use for each is different. It is possible to see the tools given below while playing this surgery game.NeedleSutureX-rayThermometerMeet A Funny Patient: Mr. ClownOur favorite man is Mr. Clown. He is a little sick and sad about his illness. We believe that when you heal him, his face will smile. Let's make him smile a little, shall we?After healing him, don't forget to make him drink his vitamin-filled juice and send him home. We need to make sure he fully recovers. What a sacred job it is to be a doctor! ControlsUse your left-click button and treat your patients.Explore More GamesIf you like playing doctor games, you should try Cat Doctor. Cat Doctor is another hospital simulator game where you work as a vet doctor and cure cute cats. Or else, you may look up other kids games on OnlineGames.io for more game options.If you are wondering which game to play, you can have us open a random game for you.This article was updated on February 20, 20241 Player2DDoctorFreeHospitalHTML5KidsMouseSimulator",
  "extractedAt": "2025-06-10T06:19:07.402Z",
  "localThumbnail": "Hospital Doctor_1749536347402.jpg"
}