{
  "url": "https://www.onlinegames.io/ice-slushy-maker/",
  "title": "Ice Slushy Maker",
  "category": "/new-games/",
  "thumbnail": "https://www.onlinegames.io/media/posts/689/Ice-Slushy-Maker.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/689/Ice-Slushy-Maker.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/689/responsive/Ice-Slushy-Maker-xs.jpg 384w, https://www.onlinegames.io/media/posts/689/responsive/Ice-Slushy-Maker-sm.jpg 600w, https://www.onlinegames.io/media/posts/689/responsive/Ice-Slushy-Maker-md.jpg 768w, https://www.onlinegames.io/media/posts/689/responsive/Ice-Slushy-Maker-lg.jpg 1200w",
    "alt": "Ice Slushy Maker Online Game",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://html5.gamedistribution.com/3dd8af9132224b3eb9baced034faea19/?gd_sdk_referrer_url=https://www.onlinegames.io/ice-slushy-maker",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "About This Game"
      },
      {
        "type": "h3",
        "text": "Design Your Drinking Cup"
      },
      {
        "type": "h3",
        "text": "Choose Your Flavor"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "Explore Other Games"
      }
    ],
    "controls": [
      "Left Mouse Button: To pick up ingredients"
    ],
    "howToPlay": "",
    "tips": "",
    "developer": "FreezeNova developed Ice Slushy Maker.",
    "similarGames": []
  },
  "fullContent": "Home› CookingIce Slushy MakerBy OnlineGames.ioMake Game Full ScreenWho doesn't want an ice-cold frozen drink in the scorching heat? Ice Slushy Maker is a 2D simulator game where players make your drink using various ingredients. You can make slushies with mango, kiwi, blueberry, citrus or apricot. All you need to do is to decide which flavor you want to drink your frozen with. Then start preparing it in this cooking game!About This GameWhen summer comes, we all look for icy drinks for cool refreshments. A cold drink is good for each of us in the scorching heat. Well, in this simulator game, we will make our cold drinks according to our desires.We will use a freezer, ice trays, assorted fruits and a blender. Finally, we will choose one of the sweet straws. If you're ready, let's get to work without sweating anymore!Design Your Drinking CupStart with designing your plastic slush cup before preparing your drink. Choose a pattern for it among several options. From modern lines to ethnic designs, you can find many kinds of patterns.Then, you can add an emoji sticker on it if you want. You can also write your name on the cup. The choice is yours! We will also put a beautiful straw in the last stage.Choose Your FlavorIt's time to decide on which flavored slush you will drink.Your options are kiwi, apricot, blueberries, citrus, strawberry, blackberry, lemon, orange and banana.Choose your favorite one and start making your iced drink.There are different ice trays for you to create ice cubes in different shapes.You can create heart-shaped, x-shaped, triangular or pentagonal ice molds with them.Select one of them and fill it with water. Then, send it to the freezer.Once you have ice, you can start chopping your fruits.If all your ingredients are complete, put them in the blender.Mix them until they thicken, and your drink is ready!ControlsLeft Mouse Button: To pick up ingredientsDeveloperFreezeNova developed Ice Slushy Maker.Explore Other GamesSandspiel may also draw your attention. You will use elements like water, sand and fire in the game. They will let you create your unique environment. Get experimental and see what you can do with the fundamentals you have.Discover more games by looking up restaurant games on OnlineGames.io. The site offers many free browser game options. Please bookmark this website to access them easily!This article was updated on March 23, 20241 Player2DCookingFreeKidsMouseSimulatorUnityWater",
  "extractedAt": "2025-06-10T06:11:55.784Z",
  "localThumbnail": "Ice Slushy Maker_1749535915784.jpg"
}