{
  "url": "https://www.onlinegames.io/idle-craft-3d/",
  "title": "Idle Craft 3D",
  "category": "/new-games/",
  "thumbnail": "https://www.onlinegames.io/media/posts/764/idle-craft-3d.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/764/idle-craft-3d.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/764/responsive/idle-craft-3d-xs.jpg 384w, https://www.onlinegames.io/media/posts/764/responsive/idle-craft-3d-sm.jpg 600w, https://www.onlinegames.io/media/posts/764/responsive/idle-craft-3d-md.jpg 768w, https://www.onlinegames.io/media/posts/764/responsive/idle-craft-3d-lg.jpg 1200w",
    "alt": "Idle Craft Play Online",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://html5.gamedistribution.com/d1eb46064cfc41629a2b06e2a2a68a31/?gd_sdk_referrer_url=https://www.onlinegames.io/idle-craft-3d/",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "What is the story of Idle Craft 3D?"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "How to Play Idle Craft 3D"
      },
      {
        "type": "h3",
        "text": "Summon Elders to Wake Up Workers"
      },
      {
        "type": "h3",
        "text": "Summon Titan For Faster Digging"
      },
      {
        "type": "h2",
        "text": "Explore Other Maps"
      },
      {
        "type": "h2",
        "text": "Conclusion"
      },
      {
        "type": "h2",
        "text": "Explore More Idle Games"
      }
    ],
    "controls": [
      "Click or tap to control"
    ],
    "howToPlay": "In the beginning, you only have a pickaxe and a digger. As he digs, you'll get coins.Save your coins to invest in this construction business.You can use your coins to increase earnings, increase workers' speed and hire a new digger.Each purchase you make will increase the cost of new investments. So, make your decisions wisely.When you workers complete a certain portion of the work, you can add decorations such as doors, windows, roofs and gardens.",
    "tips": "",
    "developer": "",
    "similarGames": []
  },
  "fullContent": "Home› IdleIdle Craft 3DBy OnlineGames.ioMake Game Full ScreenIdle Craft 3D is more than an idle building game, it's a strategic journey where players monitor all the construction laborers and make crucial decisions to finish the building as soon as possible!What is the story of Idle Craft 3D?Middle, a determined individual, has spent years building his dream house. His sole purpose was to marry a wife and live happily ever after in that house. However, fate had other plans.An unexpected disaster, in the form of an aerolite, razed the house to the ground just as he completed construction. But Middle is not one to give up. With your invaluable assistance, he is restarting the construction.It's a journey of resilience and determination, where he needs to hire workers and dig all over the place to craft his dream house again.ControlsClick or tap to controlHow to Play Idle Craft 3DIn the beginning, you only have a pickaxe and a digger. As he digs, you'll get coins.Save your coins to invest in this construction business.You can use your coins to increase earnings, increase workers' speed and hire a new digger.Each purchase you make will increase the cost of new investments. So, make your decisions wisely.When you workers complete a certain portion of the work, you can add decorations such as doors, windows, roofs and gardens.Summon Elders to Wake Up WorkersIt's not easy to break sweat all day long. Workers may fall asleep from exhaustion. However, you'll not gain any income while they are sleeping. So wake them up. Or summon elders to supervise them.Summon Titan For Faster DiggingTitan is a super powerful worker who will quicken the construction a lot. Summon Titan to enjoy the highest digging efficiency. He'll be an example to the other workers as well.Explore Other MapsMiddle's little house in Jungle Manor is only the first step in the construction business. As you embark on other adventures, you'll discover a variety of maps to dig and craft in this game. Each map brings new surroundings and decorations.Jungle ManorSand ShelterThe Holy Land in Snow CountryDeep SandJapanese SceneryFly to MarsJoin ChristmasConclusionThis game not only provides entertainment but also helps you appreciate the hard work of anonymous laborers! It's a fun way to learn about the challenges and rewards of construction workers. Play it on OnlineGames.io for free and add some fun to your day!Explore More Idle GamesIf you enjoy playing idle constructing games, why not try your hand at being a subway manager in NY City with Subway Idle 3D? Set up a system to increase your profits and ensure the people of NY can find what they need in transportation.This article was updated on June 9, 20241 Player3DCraftingFreeIdleMinecraftMobileMouse",
  "extractedAt": "2025-06-10T06:08:34.789Z",
  "localThumbnail": "Idle Craft 3D_1749535714789.jpg"
}