{
  "url": "https://www.onlinegames.io/infiltrating-the-airship/",
  "title": "Infiltrating the Airship",
  "category": "/new-games/",
  "thumbnail": "https://www.onlinegames.io/media/posts/958/Henry-Stikmin-Infiltrating-the-Airship.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/958/Henry-Stikmin-Infiltrating-the-Airship.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/958/responsive/Henry-Stikmin-Infiltrating-the-Airship-xs.jpg 384w, https://www.onlinegames.io/media/posts/958/responsive/Henry-Stikmin-Infiltrating-the-Airship-sm.jpg 600w, https://www.onlinegames.io/media/posts/958/responsive/Henry-Stikmin-Infiltrating-the-Airship-md.jpg 768w, https://www.onlinegames.io/media/posts/958/responsive/Henry-Stikmin-Infiltrating-the-Airship-lg.jpg 1200w",
    "alt": "Henry Stickmin Infiltrating the Airship Play Online",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://cloud.onlinegames.io/games/2025/flash/infiltrating-the-airship/index-og.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "How to Play Infiltrating the Airship"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "Similar Games"
      }
    ],
    "controls": [
      "Use your mouse to select choices and interact with objects."
    ],
    "howToPlay": "At each step, you'll be presented with various choices on how to help Henry proceed.Click on an option and watch the outcome unfold.If your choice ends in failure, you can retry the previous decision or retry from beginning to explore different flows.Henry's goal is completing the mission by capturing the Toppat Clan leaders, but your goal is to have fun. So enjoy failures, laugh and explore all multiple endings.",
    "tips": "",
    "developer": "Henry Stickmin: Infiltrating the Airship was developed by PuffballsUnited, well-known for creating funny stick-figure animations with storytelling.",
    "similarGames": [
      {
        "title": "Breaking the Bank",
        "url": "https://www.onlinegames.io/breaking-the-bank/"
      },
      {
        "title": "Escaping the Prison",
        "url": "https://www.onlinegames.io/escaping-the-prison/"
      },
      {
        "title": "Stealing the Diamond",
        "url": "https://www.onlinegames.io/stealing-the-diamond/"
      }
    ]
  },
  "fullContent": "Home› FunnyInfiltrating the AirshipBy OnlineGames.ioMake Game Full ScreenHenry Stickmin: Infiltrating the Airship is the fourth exciting episode in the famous Henry Stickmin series. This time, Henry finds himself in trouble and is offered a chance to redeem himself by aiding the government in capturing the infamous Toppat Clan. It's a notorious criminal organization known for their daring heists and outrageous schemes. The Toppat Clan has taken control of a massive airship. Now, it's your job to help Henry sneak aboard the airship and put a stop to their criminal activities. You can choose to connect to a tech assistant who is having a hard time understanding your commands, leading to even funnier situations. Or go solo and meet quirky characters, and solve out clever puzzles. One thing is for sure, this free game will make you think outside of the box. Every decision you make can drastically change the flow of the story: Henry’s triumph or another epic fail So get ready to infiltrate the airship and save the day. Play Henry Stickmin: Infiltrating the Airship now and experience all the fun twists and turns!ControlsUse your mouse to select choices and interact with objects.How to Play Infiltrating the AirshipAt each step, you'll be presented with various choices on how to help Henry proceed.Click on an option and watch the outcome unfold.If your choice ends in failure, you can retry the previous decision or retry from beginning to explore different flows.Henry's goal is completing the mission by capturing the Toppat Clan leaders, but your goal is to have fun. So enjoy failures, laugh and explore all multiple endings.DeveloperHenry Stickmin: Infiltrating the Airship was developed by PuffballsUnited, well-known for creating funny stick-figure animations with storytelling.Similar GamesIf you enjoy this game and haven't played the prequels yet, you'll love the previous games in the Henry Stickmin series, including Breaking the Bank, Escaping the Prison, and Stealing the Diamond. Each of these free online games delivers the same mix of comedy, creativity, and strategic decision-making fun. Check them out and keep laughing as you play through the entire Henry Stickmin saga online at OnlineGames.io!This article was updated on March 12, 20251 Player2DCrashCrazyDestroyFlashFreeFunFunnyStickman",
  "extractedAt": "2025-06-10T06:03:46.032Z",
  "localThumbnail": "Infiltrating the Airship_1749535426033.jpg"
}