{
  "url": "https://www.onlinegames.io/jacks-village/",
  "title": "Jacks Village",
  "category": "/t/adventure/",
  "thumbnail": "https://www.onlinegames.io/media/posts/493/Jacks-Village.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/493/Jacks-Village.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/493/responsive/Jacks-Village-xs.jpg 384w, https://www.onlinegames.io/media/posts/493/responsive/Jacks-Village-sm.jpg 600w, https://www.onlinegames.io/media/posts/493/responsive/Jacks-Village-md.jpg 768w, https://www.onlinegames.io/media/posts/493/responsive/Jacks-Village-lg.jpg 1200w",
    "alt": "Jacks Village Play Online",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2021/unity/jacks-village/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "How to Play Jack's Village"
      },
      {
        "type": "h3",
        "text": "Campaign Mode"
      },
      {
        "type": "h3",
        "text": "Explore Endless Mode"
      },
      {
        "type": "h3",
        "text": "Weapons in Jack's Village"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "What is More?"
      }
    ],
    "controls": [
      "Use the WASD keys or the arrow keys to move.Use the left mouse button to fire.Use the ESC key to pause.Use the 1-5 number keys to switch the weapon.Use the Left Shift to run.Use the Ctrl to crouch."
    ],
    "howToPlay": "You can play Jack's Village in camping mode or in endless game mode to explore. There are 15 missions given to you in the campaign mode, each with its own difficulty and requirements. In the endless game mode, you have more freedom, but there will still be monsters that will follow you. That's why you have to be careful.",
    "tips": "",
    "developer": "",
    "similarGames": []
  },
  "fullContent": "Home› AdventureJacks VillageBy OnlineGames.ioWelcome to Jack's Village! Jack's Village is a 3D combat game where you, as a Jack, need to defend your village against giant creatures with the help of civilians. It is a first-person hero game in which you need to perform multiple campaigns in order to get rid of the invading creatures. Join hands with civilians and save your lands from monsters!How to Play Jack's VillageYou can play Jack's Village in camping mode or in endless game mode to explore. There are 15 missions given to you in the campaign mode, each with its own difficulty and requirements. In the endless game mode, you have more freedom, but there will still be monsters that will follow you. That's why you have to be careful.Campaign ModeIn your first mission in campaign mode, you need to kill 7 monsters. We can almost hear you say only 7 monsters. Don't underestimate it. They will give you a lot of trouble. These missions are a bit challenging. But I think you have the potential to handle them all. You only have one dagger in this mode. You can only perform melee combat. Swing your shots well!Explore Endless ModeThis mode is for you to roam freely. Here, you can wander around the village and come into contact with civilians. But don't make the mistake of thinking there won't be any monsters after you because they will chase you here, too. They see you as a big threat. They will not miss the moment when they can attack.Weapons in Jack's VillageSince the timeline of the map is medieval, the weapons Jack uses are also from that era. You can see what weapons there are below.DaggerMaceAxeSwordArrowControlsUse the WASD keys or the arrow keys to move.Use the left mouse button to fire.Use the ESC key to pause.Use the 1-5 number keys to switch the weapon.Use the Left Shift to run.Use the Ctrl to crouch.What is More?You should try Bandits Multiplayer PvP, an action game where you, as a bandit, try to survive among other cowboys in the West if you are fond of Jack's Village. As an alternative, you can look up other battle games on OnlineGames.io for more options by following the link. Keep coming back to find new browser games!Embed URL:https://www.onlinegames.io/games/2021/unity/jacks-village/index.htmlThis article was updated on January 18, 20241 Player3DActionAdventureArcheryBattleCombatDefenseEmbeddableFantasyFreeHeroHorrorUnityWarWeapon",
  "extractedAt": "2025-06-10T05:10:44.572Z",
  "localThumbnail": "Jacks Village_1749532244572.jpg"
}