{
  "url": "https://www.onlinegames.io/kick-the-dummy/",
  "title": "Kick the Dummy",
  "category": "/new-games/",
  "thumbnail": "https://www.onlinegames.io/media/posts/414/Kick-The-Dummy-Game.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/414/Kick-The-Dummy-Game.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/414/responsive/Kick-The-Dummy-Game-xs.jpg 384w, https://www.onlinegames.io/media/posts/414/responsive/Kick-The-Dummy-Game-sm.jpg 600w, https://www.onlinegames.io/media/posts/414/responsive/Kick-The-Dummy-Game-md.jpg 768w, https://www.onlinegames.io/media/posts/414/responsive/Kick-The-Dummy-Game-lg.jpg 1200w",
    "alt": "Kick the Dummy Play Online",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2022/construct/153/kick-the-dummy/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "How to Play Kick The Dummy?"
      },
      {
        "type": "h2",
        "text": "Weapons"
      },
      {
        "type": "h2",
        "text": "Suggestions"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Similar Games"
      }
    ],
    "controls": [
      "Using your mouse's left button is enough for you to enjoy Kick The Dummy."
    ],
    "howToPlay": "Kick The Dummy is a game where there are simple rules. When you tap the play button, the game will start. You will see a robot that you are going to beat badly and his bar showing the robot's durability at the bottom of the game screen. Just click the left mouse button to start slapping the robot.",
    "tips": "",
    "developer": "",
    "similarGames": [
      {
        "title": "Elastic Man",
        "url": "https://www.onlinegames.io/elastic-man/"
      }
    ]
  },
  "fullContent": "Home› CrazyKick The DummyBy OnlineGames.ioMake Game Full ScreenSometimes, the stress of daily life overwhelms you, and you feel like punching the wall. All you need at that moment is to release that stress. There is just something for you here! Kick The Dummy is an action game where you punch, shoot, bomb and crash the robotic victim. In fact, this game is such a game that you can even throw a bench at the robot. The liquids on the screen, when you hit the robot and the sounds will help you a lot in satisfying your primitive emotions. We can understand you; this game was created with this motivation. Just enjoy the game and relieve your daily stress!How to Play Kick The Dummy?Kick The Dummy is a game where there are simple rules. When you tap the play button, the game will start. You will see a robot that you are going to beat badly and his bar showing the robot's durability at the bottom of the game screen. Just click the left mouse button to start slapping the robot.WeaponsKick The Dummy provides you lots of weapons to kick the Dummy's ass. You can view your weapon options from the upper side of the game screen. There, you will see six separate icons in a row, five giving you weapon options. The last button is to drop the weapon you picked up. You can find some weapon options listed below. Choose what you want and start relieving your stress!GunAutomatic RifleBombRocketCarHandcuffsSwordsHammerSuggestionsThis game offers you so many options... You can make your game very enjoyable by following the suggestions listed below!As you beat the robot and level up, you will earn coins. Spend these to buy new weapons for yourself. At first, you can only punch the robot, but your game will become more colorful as you get new weapons. For example, when you unlock the car, a car will appear on the screen and start crushing the robot to death. Amazing!You have the opportunity to change the background of the game. It would be more fun to beat the dummy in different places, right? Unlock new playgrounds and experience different environments with the coins you earn. Press the photo gallery icon on the game screen and select the background you want from the screen that appears.If blood effects and sounds bother you while playing the game, you can turn them off from the upper right corner of the game screen. Just click on the blood and sound icon to turn them off.ControlsUsing your mouse's left button is enough for you to enjoy Kick The Dummy.Similar GamesIf you like playing Kick The Dummy, you can also try Elastic Man, another stress reliever game where you pinch an elastic man, as the game's name indicates. We also recommend checking out the Crazy Games on OnlineGames.io for more game options.Embed URL:https://www.onlinegames.io/games/2022/construct/153/kick-the-dummy/index.htmlThis article was updated on May 9, 20241 Player2DClickerCrazyDestroyEmbeddableFreeFunFunnyMobileMousePhysicsSandbox",
  "extractedAt": "2025-06-10T06:24:21.169Z",
  "localThumbnail": "Kick the Dummy_1749536661169.jpg"
}