{
  "url": "https://www.onlinegames.io/kick-the-pirate/",
  "title": "Kick The Pirate",
  "category": "/new-games/",
  "thumbnail": "https://www.onlinegames.io/media/posts/1012/Kick-The-Pirate.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/1012/Kick-The-Pirate.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/1012/responsive/Kick-The-Pirate-xs.jpg 384w, https://www.onlinegames.io/media/posts/1012/responsive/Kick-The-Pirate-sm.jpg 600w, https://www.onlinegames.io/media/posts/1012/responsive/Kick-The-Pirate-md.jpg 768w, https://www.onlinegames.io/media/posts/1012/responsive/Kick-The-Pirate-lg.jpg 1200w",
    "alt": "Kick the Pirate Play Online",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://cloud.onlinegames.io/games/2022/construct/92/kick-the-pirate/index-og.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Stress-Busting Clicker Game"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "How to Play Kick the Pirate"
      },
      {
        "type": "h2",
        "text": "Weapons to Try"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "Is Kick the Pirate Safe for Kids?"
      }
    ],
    "controls": [
      "Click or tap to attack the pirate.Use earned coins to unlock more weapons.Toggle settings in the top right for sound and blood effects."
    ],
    "howToPlay": "Start by clicking or tapping the pirate as fast (or as furiously) as you like.Each hit earns you coins, which you’ll use to buy new weapons.Your goal is to deplete the pirate’s health bar ( at the bottom) to complete each level.As you progress, the levels get tougher and the pirate gets sassier.You can swap out the ship’s background if you want a change of scene. Click on the button on the bottom left corner to shop new backgrounds.If you’d prefer less graphic visuals, use the drop icon in the corner to toggle off the blood splatter.",
    "tips": "",
    "developer": "Kick the Pirate was developed by FreezeNova with casual fun in mind. While it doesn’t take itself seriously, it delivers a surprisingly satisfying gameplay loop perfect for quick sessions or all-out pirate punishment marathons.",
    "similarGames": []
  },
  "fullContent": "Home› DestroyKick the PirateBy OnlineGames.ioMake Game Full ScreenAhoy matey! Pirates may be brave on the high seas, but they’ve never met you. In Kick the Pirate, your job is simple: turn this grumpy pirate into your personal punching bag.  He’s muttering curses or just standing there looking smug. But it’s oddly satisfying to send him flying with a cannonball. Seriously. Bad day at school? Boss annoyed you? This destroy game is the perfect way to blow off some steam without flipping a table.Stress-Busting Clicker GameSome games make you think. Others make you feel. And this one? It just lets you kick a pirate with a cannon. And honestly, that’s all we needed today. In case you still have some steam left to blow off, we have a full collection of dummy games. You can kick the alien who tries to colonize your planet with some laser guns and sci-fi weapons. Or perhaps you may want to beat an Evil Santa who keeps the gifts to himself instead of giving them away. Oh, you still need more? Write \"Kick the\" in the search bar or go and explore all destroying games we have!  ControlsClick or tap to attack the pirate.Use earned coins to unlock more weapons.Toggle settings in the top right for sound and blood effects.How to Play Kick the PirateStart by clicking or tapping the pirate as fast (or as furiously) as you like.Each hit earns you coins, which you’ll use to buy new weapons.Your goal is to deplete the pirate’s health bar ( at the bottom) to complete each level.As you progress, the levels get tougher and the pirate gets sassier.You can swap out the ship’s background if you want a change of scene. Click on the button on the bottom left corner to shop new backgrounds.If you’d prefer less graphic visuals, use the drop icon in the corner to toggle off the blood splatter.Weapons to TryThere are tons of wacky weapons to unlock, each more satisfying than the last. You can switch between weapons using the buttons at the top of the screen. The stronger your weapons, the faster you can rack up coins and complete levels.Flintlock Pistol: Classic and simple.Bone Key Gun: Looks like it came straight out of a cursed treasure chest.Battle Axe: Heavy damage and major pirate pain.Ship Anchor: Watch him go flying.Cannon: Boom! Need we say more?TNT Barrel: Great for crowd control… or pirate control.Rifle: Unlockable after a few rounds of brutal beating.DeveloperKick the Pirate was developed by FreezeNova with casual fun in mind. While it doesn’t take itself seriously, it delivers a surprisingly satisfying gameplay loop perfect for quick sessions or all-out pirate punishment marathons.Is Kick the Pirate Safe for Kids?While Kick the Pirate uses cartoon-style visuals and lets you toggle off blood effects, parents should know the core gameplay revolves around violence toward a pirate character. It’s meant to be humorous and exaggerated, not realistic. Recommended for players 10 and up with parental guidance if needed.Embed URL:https://cloud.onlinegames.io/games/2022/construct/92/kick-the-pirate/index-og.htmlThis article was updated on May 23, 20251 Player2DClickerCrazyDestroyEmbeddableFreeFunFunnyMobileMousePirateWeapon",
  "extractedAt": "2025-06-10T06:02:39.199Z",
  "localThumbnail": "Kick The Pirate_1749535359199.jpg"
}