{
  "url": "https://www.onlinegames.io/kirka-io/",
  "title": "Kirka io",
  "category": "/t/action/",
  "thumbnail": "https://www.onlinegames.io/media/posts/704/Kirka-io.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/704/Kirka-io.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/704/responsive/Kirka-io-xs.jpg 384w, https://www.onlinegames.io/media/posts/704/responsive/Kirka-io-sm.jpg 600w, https://www.onlinegames.io/media/posts/704/responsive/Kirka-io-md.jpg 768w, https://www.onlinegames.io/media/posts/704/responsive/Kirka-io-lg.jpg 1200w",
    "alt": "Kirka io Online Game",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://kirka.io/",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "About Kirka.io"
      },
      {
        "type": "h3",
        "text": "Game Modes in Kirka.io"
      },
      {
        "type": "h3",
        "text": "Customize the Loadout"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "Similar Online Games"
      }
    ],
    "controls": [
      "Desktops and Laptops",
      "WASD or Arrow Keys: MoveSpacebar: JumpP/ESC: Change Weapon MenuLeft-Click: ShootRight-Click: AimShift: CrouchE: Dash1,2,3: Switch Weapons",
      "Mobile Devices",
      "Use the virtual buttons on the screen."
    ],
    "howToPlay": "",
    "tips": "",
    "developer": "Pierre-Eli developed Kirka.io.",
    "similarGames": [
      {
        "title": "Tribals io",
        "url": "https://www.onlinegames.io/tribals-io/"
      }
    ]
  },
  "fullContent": "Home› First Person ShooterKirka ioBy OnlineGames.ioMake Game Full ScreenImagine participating in battles set in a Minecraft-inspired world. Exciting, huh? Kirka.io is a 3D io game where you will combat with online players in blocky battlefields.There are various modes and maps to choose from. Select your preferred options and enter the battlefield with your chosen loadout in this shooting game! Try to keep the highest kill score.About Kirka.ioThe first thing to do in Kirka.io is to decide on the game mode and map among many alternatives.You can play this FPS game solo or team up with other online players. Or you can choose the Parkour mode and show off your jumping skills.Moreover, you can fight your enemies using only a melee weapon in Knife Only mode.Make your choices from the Selection menu and click on the “Play” button. The game will automatically open a room for you to match your selections.Setting up your own room is also an option. Alternatively, you can join one of the available rooms in the “Servers” section.When you enter the battling field, pick up your weapon in the Change Weapon section and start facing your enemies!Game Modes in Kirka.ioThere are seven unique game modes in Kirka.io. Each comes with different objectives. We will leave you a brief information about the modes below.Solo: This is a free-for-all mode. Everyone is alone here.Team: There are two teams: Red and Blue. Fight alongside your friends.Point: Reach the flag zone and conquer the point. You must protect the zone at all costs to win.Parkour: Strive to reach the end of the parkour within a short period of time.Physics: The mode in which you violate the law of gravity. You will move faster in it.Sabotage: You must destroy your opponent team’s gems with your knife before they do.Knife Only: There are no heavy weapons here. Only melee weapons are accessible for fighting.Customize the LoadoutWhen you enter the game map, you must determine which weapon you will use to combat the online players. From five options, choose the one that best suits your playstyle.Remember that you can change your weapon whenever you want by opening the Change Weapon menu. Additionally, don’t worry about running out of bullets. You will have an infinite number of them.Vita: A Sniper RifleMac-10: A SMGWeatie: A ShotgunLAR: An Assault RifleM60: A Heavy WeaponControlsDesktops and LaptopsWASD or Arrow Keys: MoveSpacebar: JumpP/ESC: Change Weapon MenuLeft-Click: ShootRight-Click: AimShift: CrouchE: Dash1,2,3: Switch WeaponsMobile DevicesUse the virtual buttons on the screen.DeveloperPierre-Eli developed Kirka.io.Similar Online GamesTribals io may also catch your attention. In the game, you play as a caveman on an island with nothing in your hands. You must gather the necessary stuff to survive!Look up other free io games on OnlineGames.io for more alternatives. There are dozens of free online games on the site. To access them easily, please bookmark this website!This article was updated on April 5, 20243DActionBattleBattle RoyaleBlockCrazyDefenseFirst Person ShooterFreeGunHTML5io GamesMinecraftMobileMultiplayerPixelShootingWeapon",
  "extractedAt": "2025-06-10T05:02:19.664Z",
  "localThumbnail": "Kirka io_1749531739666.jpg"
}