{
  "url": "https://www.onlinegames.io/krunker-io/",
  "title": "Krunker io",
  "category": "/t/io-games/",
  "thumbnail": "https://www.onlinegames.io/media/posts/393/Krunker-io-2.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/393/Krunker-io-2.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/393/responsive/Krunker-io-2-xs.jpg 384w, https://www.onlinegames.io/media/posts/393/responsive/Krunker-io-2-sm.jpg 600w, https://www.onlinegames.io/media/posts/393/responsive/Krunker-io-2-md.jpg 768w, https://www.onlinegames.io/media/posts/393/responsive/Krunker-io-2-lg.jpg 1200w",
    "alt": "Krunker io Play For Free",
    "width": 256,
    "height": 256,
    "className": "",
    "parentClass": "post__featured-image"
  },
  "gameFrame": "https://krunker.io/",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Classes"
      },
      {
        "type": "h2",
        "text": "Weapons"
      },
      {
        "type": "h2",
        "text": "Game Modes"
      },
      {
        "type": "h2",
        "text": "Maps"
      },
      {
        "type": "h2",
        "text": "How to download Krunker io?"
      },
      {
        "type": "h2",
        "text": "How to play with friends on Krunker.io?"
      },
      {
        "type": "h2",
        "text": "How to aim in Krunker.io?"
      },
      {
        "type": "h2",
        "text": "How to slide in Krunker io?"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "More Games Like Krunker io"
      }
    ],
    "controls": [
      "Use the WASD keys to moveLeft click to shootR to reloadC to aim/zoomSpace bar to jumpShift to crouchF to spray paint"
    ],
    "howToPlay": "On the main page, click the invite button; the link will be copied to your clipboard. Paste and send the invitation link to your friend. Let them open the link and start having fun together.",
    "tips": "",
    "developer": "Krunker io was created by Yendis Entertainment.",
    "similarGames": []
  },
  "fullContent": "Home› ShootingKrunker ioBy OnlineGames.ioMake Game Full ScreenKrunker io is a 3D pixelated first-person shooter game that can be played on browser with people all around the world. This fast-paced online game offers hours of action similar to Counter-Strike in the comfort of your browser. Krunker io has various game modes like free for all, team deathmatch, hardpoint and many more. Either play with your friends or alone; Krunker io will blow your mind with its numerous maps designed by both developers and Krunker io fans. ClassesChoose a class before starting out. Decide on who you want to be in Krunker io and select between 14 different classes. Each class has its own unique characteristics, such as first and second weapons, melee skin, movement speed, charm, streak type and health level. You will begin the game as a Triggerman in a suit and will be able to select other classes as you level up. However, you don't have to stick up to default looks. You can fully customize your character with hats, charms and even change skin and hair color.Available classes in Krunker io are as follows:TriggermanHunterRun N GunSpray N PrayVinceDetectiveMarksmanRocketeerAgentRunnerBowmanCommandoTrooperInfiltratorWeaponsNumerous weapons are available in Krunker io with different capabilities such as firepower, scope, hit level and aim precision. Weapons you can select in Krunker io are as follows:Sniper RifleAssault RiflePistolSubmachine GunRevolverShotgunMachine GunSemi-AutoRocket LauncherAkimbo UziDesert EagleAlien BlasterCombat KnifeCrossbowFamasSawed OFFAuto PistolBlasterTehchy-9Charge RifleGame ModesIf you are bored with the same old Battle Royale style shooting games, here is the good news. Krunker io has many game modes you can try out alone or with friends.Free for All (FFA)Team Deathmatch (TDM)Hardpoint (POINT)Capture the Flag (CTF)Kill Confirmed (KC)DominationKrunker io fans also design other game modes. Try Smooth and Silenced, Hide& Seek, Gun Game created by fans or complete the parkours to earn a winner badge.MapsWhat makes an FPS game more engaging for you? We believe Krunker's numerous maps with colorful surroundings will have you addicted to them. Either play in a freight port and shoot the others down from the lighthouse or battle in the streets of Lostworld. Each map has its own challenges and fun. 20 official maps of Krunker io are BurgLittletownSandstormSubzeroUndergrowthFreightLostworldOasisKanjiIndustryLumberEvacuationSiteSkyTempleLagoonTortugaHabitatAtomicFacilitySoul SanctumHow to download Krunker io?Krunker io is a web-based online game that is playable on a browser (Google Chrome, Mozilla Firefox etc.) You do not need to download Krunker io to start playing. Visit OnlineGames.io and start krunking. How to play with friends on Krunker.io?On the main page, click the invite button; the link will be copied to your clipboard. Paste and send the invitation link to your friend. Let them open the link and start having fun together.How to aim in Krunker.io?First, be sure you have a gun in hand but not melee skin, such as a combat knife. Then, right-click (or C key) to aim and left-click to shoot.How to slide in Krunker io?If you want to slide in Krunker io, it's best to do it with a light gun ( a knife or a simple pistol). Jump and turn in the direction you want. Before hitting the ground, hit the crouch button. Ta-da! You slid like a car on a wet road.ControlsUse the WASD keys to moveLeft click to shootR to reloadC to aim/zoomSpace bar to jumpShift to crouchF to spray paintDeveloperKrunker io was created by Yendis Entertainment.More Games Like Krunker ioIf you like Krunker io, you may continue playing Blocky Combat Swat. Or have a look at the FPS games online on our platform.This article was updated on February 22, 20243DActionBattleBattle RoyaleFirst Person ShooterFreeGunio GamesMultiplayerPixelShootingWeapon",
  "extractedAt": "2025-06-10T05:34:24.609Z",
  "localThumbnail": "Krunker io_1749533664610.jpg"
}