{
  "url": "https://www.onlinegames.io/legends-arena/",
  "title": "Legends Arena",
  "category": "/t/multiplayer/",
  "thumbnail": "https://www.onlinegames.io/media/posts/608/Legends-Arena.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/608/Legends-Arena.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/608/responsive/Legends-Arena-xs.jpg 384w, https://www.onlinegames.io/media/posts/608/responsive/Legends-Arena-sm.jpg 600w, https://www.onlinegames.io/media/posts/608/responsive/Legends-Arena-md.jpg 768w, https://www.onlinegames.io/media/posts/608/responsive/Legends-Arena-lg.jpg 1200w",
    "alt": "Legends Arena Free Online Game",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2023/unity2/legends-arena/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "How to Play Legends Arena"
      },
      {
        "type": "h3",
        "text": "Heroes to Unlock"
      },
      {
        "type": "h3",
        "text": "Battling Arenas"
      },
      {
        "type": "h3",
        "text": "Use Your Chance"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "Similar Shooting Games"
      }
    ],
    "controls": [
      "To move, use the WASD keys.To reload bullets, use the R key.To bend down, use the C key.To jump, use the Space key.To run, use the Left-Shift key.To change between weapons 1,2,3,4 or scroll"
    ],
    "howToPlay": "You will be teamed up with other online players worldwide in the game. Choose the game map and the game mode option you want to battle in. You will see maps and mode options when you tap on the “Play” button. Make your choices, and you will find yourself in the selected arena as you wish. When you get shot, we recommend you go to the green cubes with a plus symbol to recover.",
    "tips": "",
    "developer": "Legends Arena is created by FreezeNova.",
    "similarGames": [
      {
        "title": "Crazy Strike Force",
        "url": "https://www.onlinegames.io/crazy-strike-force/"
      }
    ]
  },
  "fullContent": "Home› ShootingLegends ArenaBy OnlineGames.ioMake Game Full Screen Legends Arena is an online shooting game where you battle with your enemies as a team. There are many game options. You can play in 2v2, 3v3 and 5v5 modes. The 5v5 option is exclusively on the Battle Stage map. Pick up your guns and walk side by side with your team in this battle game! It will be delightful to team up. ⚔️How to Play Legends ArenaYou will be teamed up with other online players worldwide in the game. Choose the game map and the game mode option you want to battle in. You will see maps and mode options when you tap on the “Play” button. Make your choices, and you will find yourself in the selected arena as you wish. When you get shot, we recommend you go to the green cubes with a plus symbol to recover.Heroes to UnlockView the heroes by clicking on the “Heroes” section from the main menu. You will see many fantastic characters. They are waiting to be unlocked. As you win battles, you can access them easily. You will start playing with Jane first. She is an energetic girl, and her favorite color is pink. You can see some of the heroes below, who are our favorites.MayaLukeLilyPofyBattling ArenasThere are 3 unique maps: Justice Plaza, Chaos Square and Battle Stage. Each has specific environments to offer. Only the Battle Stage provides you with a deathmatch with teams of five. More people means more contentious battles! Show everyone that you are invincible.Justice Plaza features a vibrant, colorful arena with many futuristic structures.Chaos Square is a place where you will find factory-like buildings. Scientific experiments are carried out here.Battle Stage is a large map with a recycling area. You may find many places to hide and seek quickly.Use Your ChanceView the boxes you have earned from the Loots section. Opening the loot boxes will earn you rewards such as legend coins and character upgrades. You may also participate in sweepstakes and unlock new heroes by using your diamonds.ControlsTo move, use the WASD keys.To reload bullets, use the R key.To bend down, use the C key.To jump, use the Space key.To run, use the Left-Shift key.To change between weapons 1,2,3,4 or scrollDeveloperLegends Arena is created by FreezeNova.Similar Shooting GamesIf you enjoy playing Legends Arena, you may also try Crazy Strike Force. You have many weapon options in the game. You can also customize your character with unique outfits. Create your own strategy to wipe out all the enemies from the battlefield.For more options, you may look up other shooting games online on OnlineGames.io by clicking on the link. If you have any suggestions or wishes, please do not hesitate to contact us!Embed URL:https://www.onlinegames.io/games/2023/unity2/legends-arena/index.htmlThis article was updated on January 24, 20243DActionArenaArmorBattleEmbeddableFreeMultiplayerShootingUnityWarWeapon",
  "extractedAt": "2025-06-10T05:58:38.953Z",
  "localThumbnail": "Legends Arena_1749535118953.jpg"
}