{
  "url": "https://www.onlinegames.io/lolbeans-io/",
  "title": "LOLbeans io",
  "category": "/t/adventure/",
  "thumbnail": "https://www.onlinegames.io/media/posts/388/LOLbeans-Skin-Shop.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/388/LOLbeans-Skin-Shop.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/388/responsive/LOLbeans-Skin-Shop-xs.jpg 384w, https://www.onlinegames.io/media/posts/388/responsive/LOLbeans-Skin-Shop-sm.jpg 600w, https://www.onlinegames.io/media/posts/388/responsive/LOLbeans-Skin-Shop-md.jpg 768w, https://www.onlinegames.io/media/posts/388/responsive/LOLbeans-Skin-Shop-lg.jpg 1200w",
    "alt": "Lolbeans io New skins and Colors",
    "width": 465,
    "height": 197,
    "className": "is-loaded",
    "parentClass": "post__image is-loaded"
  },
  "gameFrame": "https://lolbeans.io/",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "How to Play Lolbeans io?"
      },
      {
        "type": "h2",
        "text": "Uplift Your Bean With A New Style"
      },
      {
        "type": "h2",
        "text": "New Features"
      },
      {
        "type": "h2",
        "text": "Explore the Maps"
      },
      {
        "type": "h2",
        "text": "Publish Your Own Levels"
      },
      {
        "type": "h2",
        "text": "How To Earn Coins"
      },
      {
        "type": "h2",
        "text": "How to Join A Party in Lolbeans"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "Similar Games"
      }
    ],
    "controls": [
      "WASD or arrow keys: MoveSpacebar/ Right-click: JumpMouse: Look around"
    ],
    "howToPlay": "Open the game and wait for the next round to start. It will not take long as the game has thousands of online players.Keep your hand on the keyboard and start running by pressing the W key as soon as the round begins.Jump over the obstacles using the spacebar and make use of levers and swings.Stay away from bouncing red balls. You have limited time to finish the course. Choose the easiest side of the path, and don't lose any time.Try not to fall while running. And if you fall once or twice, it's fine; you will respawn again, but you may fall behind other players.Players who finish the course before time pass the next course with the first-round winners. Reach the finish line of different courses until you become the ultimate bean who eliminates all other contestants.The aim is to be the only bean that survives and collects the coins. To add more excitement to the race, play with your friends.",
    "tips": "",
    "developer": "Lolbeans io was created by Big Boss Dolphin.",
    "similarGames": [
      {
        "title": "Fall Boys",
        "url": "https://www.onlinegames.io/fall-boys/"
      },
      {
        "title": "newest games to play on your browser",
        "url": "https://www.onlinegames.io/new-games/"
      }
    ]
  },
  "fullContent": "Home› io GamesLOLbeans ioBy OnlineGames.ioMake Game Full ScreenSome of you may recall the epic TV show Total Wipeout. In that hilarious contest, players had to complete an obstacle course filled with hoops, wrecking balls, slingers, and more. Those who fell into the water or mud failed the course.Not the extreme athletes, but ordinary people ran, jumped, raced, and risked it all for a chance at glory and a good laugh on those absurd courses. Players showcased over 1000 unique falling styles. Total Wipeout was a ridiculous show, indeed.For those who'd love to play Wipeout but would rather stay dry and keep their bones solid, give Lolbeans a chance! It's a funny online platformer game inspired by Total Wipeout.In Lolbeans io, players control a tiny jelly bean character on an obstacle course. The courses are at least as funny and challenging as Total Wipeout settings. Start running as soon as the race begins and make your way through the championship. Prepare for tons of obstacles on the path!Players of all ages looking for a good laugh can play Lolbeans io. The game features mechanics and visuals similar to the famous console game Fall Guys. So, why wait? Compete with your friends in silly races, and get ready to cross the finish line!How to Play Lolbeans io?Open the game and wait for the next round to start. It will not take long as the game has thousands of online players.Keep your hand on the keyboard and start running by pressing the W key as soon as the round begins.Jump over the obstacles using the spacebar and make use of levers and swings.Stay away from bouncing red balls. You have limited time to finish the course. Choose the easiest side of the path, and don't lose any time.Try not to fall while running. And if you fall once or twice, it's fine; you will respawn again, but you may fall behind other players.Players who finish the course before time pass the next course with the first-round winners. Reach the finish line of different courses until you become the ultimate bean who eliminates all other contestants.The aim is to be the only bean that survives and collects the coins. To add more excitement to the race, play with your friends.Uplift Your Bean With A New StyleDon't be lost in the mob! Shine like a star with customizable bean skin options. Click on the bean in the main menu to see options in the shops.Skins: Let the other players envy your dazzling outfit. Be a space fighter or a dragon!Hats: Don't let your bean run around under the sun without protection! Wear a baseball cap or bunny ears. Pick a gorgeous hat to stand out from the crowd.New FeaturesNew Exotic Skins: Good news for Lolbeaners! Now, you can select new exotic skins and race in your own style. Choose between Axolot, Barrel, Chicken, Corn, Space Fighter, Sunflower, and other bouncy beans.New Hats: New hat options are available now! Put on a racing helmet or a Sombrero. Pick the funniest hat from the new collection and start racing!New Maps: You can enjoy exploring new seasonal maps. The most recent releases are Monster Manor, Dash Cup, and Lava Lake maps. Try them out now!Skins and Hats Menu in LolBeansExplore the MapsDiscover vibrant courses filled with exciting challenges that will put your skills to the test.Beware of the numerous traps and obstacles that line the tracks.Hammer swings, enormous windmills, and bouncing angry balls will come over you.You will face tiny bridges and traps to cross over without falling.Publish Your Own LevelsIf you are into game design you can build your very own chaotic course.Click Community Level below the play button, and hit \"Create a Level\". Press play and start editing the level. If you are new to game design, read the documentation, explore and experiment with the editor. Then, you can share your level with the community.You can also choose between courses created by the community. Give a chance to Stairway to Heaven, a wonderful map created by King Bob.  How To Earn CoinsYou can earn coins by playing and passing more and more rounds. Check out the shop if you want to spend your coins on buying new hats and skins. If you need more coins, there are various coin packs that you can buy with discount options.How to Join A Party in LolbeansYou can play lol beans in party mode with your friends. To do that, create a private room by clicking the \"Party\" button in the main menu (on the top right of your screen). Copy the invite code or room name and send it to your friends. You can play with up to 30 players in a party room.If a friend has already created a room and invited you, enter the room code to join the room. Chat with your friends until all players gather up in the room. When you are ready, start racing with your friends. It's much more fun that way!ControlsWASD or arrow keys: MoveSpacebar/ Right-click: JumpMouse: Look aroundDeveloperLolbeans io was created by Big Boss Dolphin.Similar GamesIf you like battle royale running games similar, we strongly recommend you play Fall Boys. Race with other online players and overcome various obstacles in this game. Don't fall, boys!Please bookmark OnlineGames.io (Ctrl+D), and you will always find the newest games to play on your browser!Showcased map is Lighthouse in the IsleThis article was updated on May 9, 20243DAdventureBattle RoyaleCrazyCuteFreeFunio GamesKidsMultiplayerParkourRacingRunning",
  "extractedAt": "2025-06-10T05:06:46.125Z",
  "localThumbnail": "LOLbeans io_1749532006125.jpg"
}