{
  "url": "https://www.onlinegames.io/mad-doctor/",
  "title": "Mad Doctor",
  "category": "/new-games/",
  "thumbnail": "https://www.onlinegames.io/media/posts/494/Mad-Doctor.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/494/Mad-Doctor.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/494/responsive/Mad-Doctor-xs.jpg 384w, https://www.onlinegames.io/media/posts/494/responsive/Mad-Doctor-sm.jpg 600w, https://www.onlinegames.io/media/posts/494/responsive/Mad-Doctor-md.jpg 768w, https://www.onlinegames.io/media/posts/494/responsive/Mad-Doctor-lg.jpg 1200w",
    "alt": "Mad Doctor Play Online",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2021/4/mad-doctor/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "How to Play Mad Doctor?"
      },
      {
        "type": "h3",
        "text": "Weapons in Mad Doctor"
      },
      {
        "type": "h3",
        "text": "A Little Advice for Mad Doctor"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Explore More Games"
      }
    ],
    "controls": [
      "Use the left mouse button to mess with the mad doctor"
    ],
    "howToPlay": "Choose your favorite tool and start smashing the mad doctor! This game is simple to play and extremely enjoyable. Just don't let him point the finger at you. You may use a gun or even a stretcher in this game. You'll be surprised to hear this, but your options even include using an ambulance. Get creative with the tools and try your best.",
    "tips": "",
    "developer": "",
    "similarGames": []
  },
  "fullContent": "Home› CrazyMad DoctorBy OnlineGames.ioMake Game Full ScreenDoes beating up an angry virtual doctor make you feel better? Release the dark humor in you with the crazy hospital game. Mad Doctor is a crazy game where you try to mess with a virtual crazy doctor by using types of weapons, scalpels, and some medical chemicals. You can make the doctor even madder with anything that can be found in a hospital. Freedom is yours. Playing Mad Doctor is the best way to release daily stress!How to Play Mad Doctor?Choose your favorite tool and start smashing the mad doctor! This game is simple to play and extremely enjoyable. Just don't let him point the finger at you. You may use a gun or even a stretcher in this game. You'll be surprised to hear this, but your options even include using an ambulance. Get creative with the tools and try your best.Weapons in Mad DoctorSince you are in a hospital environment, you have many medical items at your disposal. Mad Doctor gives you an abundance of weaponry. The upper portion of the game screen is where you may see your available weapon options. There are six icons in a row that you can select from, five of which are your weapon options. Press the final button to let go of the weapon you just grabbed. The list of available weapons is below. Select your desired outcome and begin de-stressing!StretcherNeedleSurgeon’s KnifePillsA Little Advice for Mad DoctorYou will get coins as you advance in level and defeat the doctor. Use these to get yourself new weapons. Your game will get more colorful as you acquire different weapons, but at the start, all you can do is use your bare hands.It is possible for you to alter the game's background. We mean, engaging with the doctor in different places would be more fun, right? With the coins you acquire, open up new playgrounds and explore other settings. On the game screen, press the photo gallery button, then choose your preferred background from the screen that displays.You can disable the game's effects and sounds in the upper right corner if they annoy you while you're playing. To turn them off, simply click the relevant icons.ControlsUse the left mouse button to mess with the mad doctorExplore More GamesTry playing Kick The Dummy, another anti-stress game where you kick the robot until it falls to pieces if you like playing Mad Doctor. We also recommend you check out other free crazy games on OnlineGames.io for more options. There are dozens of games that you can access for free and have fun with. Bookmark this website to be able to easily access the new games!Embed URL:https://www.onlinegames.io/games/2021/4/mad-doctor/index.htmlThis article was updated on May 9, 20241 Player2DArcadeClickerCrazyDoctorEmbeddableFreeFunFunnyHospitalHTML5MobileMouseSandbox",
  "extractedAt": "2025-06-10T06:19:59.794Z",
  "localThumbnail": "Mad Doctor_1749536399794.jpg"
}