{
  "url": "https://www.onlinegames.io/madalin-stunt-cars-pro/",
  "title": "Madalin Stunt Cars Pro",
  "category": "/t/car/",
  "thumbnail": "https://www.onlinegames.io/media/posts/401/Madalin-Stunt-Cars-Pro-Controls.webp",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/401/Madalin-Stunt-Cars-Pro-Controls.webp",
    "srcset": "https://www.onlinegames.io/media/posts/401/responsive/Madalin-Stunt-Cars-Pro-Controls-xs.webp 384w, https://www.onlinegames.io/media/posts/401/responsive/Madalin-Stunt-Cars-Pro-Controls-sm.webp 600w, https://www.onlinegames.io/media/posts/401/responsive/Madalin-Stunt-Cars-Pro-Controls-md.webp 768w, https://www.onlinegames.io/media/posts/401/responsive/Madalin-Stunt-Cars-Pro-Controls-lg.webp 1200w",
    "alt": "Madalin Stunt Cars Pro Controls",
    "width": 750,
    "height": 224,
    "className": "is-loaded",
    "parentClass": "post__image post__image--center is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2023/unity/madalin-stunt-cars-pro/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "How to play Madalin Stunt Cars Pro?"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Solo or Multiplayer"
      },
      {
        "type": "h2",
        "text": "How can I enjoy the Madalin Stunt Cars Pro the most?"
      },
      {
        "type": "h2",
        "text": "What brands of vehicles are available in Madalin Stunt Cars Pro?"
      },
      {
        "type": "h2",
        "text": "Play More Games Like This"
      }
    ],
    "controls": [
      "Use the Arrow keys or WASD to steer the vehicleUse the Space key to handbrakeUse the Shift key to use nitroUse the Ctrl key to change your carUse the M key to see the rearview mirrorUse the H key to turn the police lights on (You can only use this feature when you select the police car.)Use the C key to change the camera viewUse the R key to reset the carUse the U key to change KMH to MPHUse the I key to start/stop the engine"
    ],
    "howToPlay": "Start by choosing your favorite car from the options and then decide the color of the vehicle. After that, select your track from the upper side of the screen. There are 3 different maps. Each one offers you a particular driving experience. Pick one and start the fun!",
    "tips": "",
    "developer": "",
    "similarGames": []
  },
  "fullContent": "Home› CarMadalin Stunt Cars ProBy OnlineGames.ioMake Game Full ScreenAre you open to experiencing luxury? The 3D driving game Madalin Stunt Cars Pro features excellent graphics for lifelike experiences. You can choose from various vehicles in Madalin Stunt Cars Pro, from the most opulent sports cars to a police cruiser, in three distinct map areas.How to play Madalin Stunt Cars Pro?Start by choosing your favorite car from the options and then decide the color of the vehicle. After that, select your track from the upper side of the screen. There are 3 different maps. Each one offers you a particular driving experience. Pick one and start the fun!ControlsUse the Arrow keys or WASD to steer the vehicleUse the Space key to handbrakeUse the Shift key to use nitroUse the Ctrl key to change your carUse the M key to see the rearview mirrorUse the H key to turn the police lights on (You can only use this feature when you select the police car.)Use the C key to change the camera viewUse the R key to reset the carUse the U key to change KMH to MPHUse the I key to start/stop the engineSolo or MultiplayerYou can play Madalin Stunt Cars Pro on your own or create a room for multiplayer options. You can play with your pals by selecting 'Multiplayer' from the main menu. Before making a new room, choose your username from here. Then, decide on the name of the room. That is it!How can I enjoy the Madalin Stunt Cars Pro the most?You can experience an exclusive adventure on each track. Choose the atmosphere that appeals to you the most. There are numerous ramps and loops on the rails. Use them and roam freely on the never-ending road. Take a city tour if you want to avoid traveling on the highway.What brands of vehicles are available in Madalin Stunt Cars Pro?Do you know which automobile to choose? The following is a list: Bugatti Veyron, Lamborghini Veneno, Pagani Zonda, LaFerrari, Ford GT, Huracan, Aventador, Ford Mustang Shelby Cobra GT and numerous other models are available. Plus, you have one police car option. Light your police lights on and wander the streets.Play More Games Like ThisTo find more games like Madalin Stunt Cars Pro, look up all Drift Games on OnlineGames.io.Embed URL:https://www.onlinegames.io/games/2023/unity/madalin-stunt-cars-pro/index.htmlThis article was updated on March 27, 20243DCarCrazyDriftDrivingEmbeddableFreeMultiplayerSpeedStuntUnity",
  "extractedAt": "2025-06-10T05:20:30.471Z",
  "localThumbnail": "Madalin Stunt Cars Pro_1749532830471.jpg"
}