{
  "url": "https://www.onlinegames.io/mafia-getaway-cars/",
  "title": "Mafia Getaway Cars",
  "category": "/t/car/",
  "thumbnail": "https://www.onlinegames.io/media/posts/982/Mafia-Getaway-Cars.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/982/Mafia-Getaway-Cars.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/982/responsive/Mafia-Getaway-Cars-xs.jpg 384w, https://www.onlinegames.io/media/posts/982/responsive/Mafia-Getaway-Cars-sm.jpg 600w, https://www.onlinegames.io/media/posts/982/responsive/Mafia-Getaway-Cars-md.jpg 768w, https://www.onlinegames.io/media/posts/982/responsive/Mafia-Getaway-Cars-lg.jpg 1200w",
    "alt": "Mafia Getaway Cars Free Online Game",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://cloud.onlinegames.io/games/2025/construct/298/mafia-getaway-cars/index-og.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Mafia Getaway"
      },
      {
        "type": "h2",
        "text": "Enemies on Your Tail"
      },
      {
        "type": "h2",
        "text": "Jump and Flip"
      },
      {
        "type": "h2",
        "text": "Speed Control"
      },
      {
        "type": "h2",
        "text": "Collect Coins on Way"
      },
      {
        "type": "h2",
        "text": "30 Levels of “Wait, It Gets Harder?”"
      },
      {
        "type": "h2",
        "text": "Retry Button? You’ll Use It. A Lot."
      }
    ],
    "controls": [
      "WASD or arrow keys to drive."
    ],
    "howToPlay": "",
    "tips": "",
    "developer": "",
    "similarGames": []
  },
  "fullContent": "Home› DrivingMafia Getaway CarsBy OnlineGames.ioMake Game Full ScreenMafia Getaway Cars is a 2D driving game where you’re driving, escaping, shooting, and occasionally flipping your 1930s mob-mobile over a suspiciously placed slope. If you ever wondered what it’s like to be a vintage gangster on the run with terrible road planning and way too many enemies, this online game is your dream (or nightmare).Put on your best fedora, hop into your sketchy-looking getaway car, and floor it. The cops are mad, the rival gangs are really mad, and gravity? Gravity’s just rude! Start playing now!ControlsWASD or arrow keys to drive.Mafia GetawayEvery level is a winding mess of hills, slopes, and sudden ambushes. Your mission is to drive through all that chaos and make it to the finish line without turning your car into scrap metal. Sounds easy, right? Yeah, it’s not.Enemies on Your TailYou’ve got mobsters shooting at you. Police cars chasing you like it’s their day off and they’re bored. They’ll ram you, blast you, and try to send you flying off a cliff. And trust us, they’re very motivated.Jump and FlipYou’re not just driving, you’ve got hops. Tap W key to leap over bullets, potholes,barriers or other cars trying to ruin your day. It’s weirdly satisfying when you time it just right and soar over an explosion like a B-movie action star.Speed ControlThis is not a pedal-to-the-metal situation like in other speed games. Go too slow, you’re an easy target. Go too fast, and boom! Hello, mid-air backflip straight into failure. You’ve gotta find the sweet spot or get really good at crashing in style. Check the health bar of your car on the top right screen. Try to keep that full until you finish the level. Otherwise you need to start over!Collect Coins on WayAlong the way, you’ll find shiny gold coins scattered like someone robbed a bank and forgot how to carry. Collect enough and you can upgrade your ride or unlock a new mafia skin. Because if you're going to go down in flames, at least look good doing it.30 Levels of “Wait, It Gets Harder?”Yeah, it does. Each level adds something new. More enemies, tougher roads, meaner slopes. By level 12, you’ll wonder who designed these streets and whether they were actively trying to make you rage quit. (Spoiler: they probably were.)Retry Button? You’ll Use It. A Lot.Crashes happen. A lot. But hey, every great gangster knows that failure is just practice in a cooler suit. Hit retry and give it another shot, maybe this time without flipping upside down five seconds in. And hey if you enjoy retro car games, try Police Chase Drifter next. We bet you'll love that, too!Embed URL:https://cloud.onlinegames.io/games/2025/construct/298/mafia-getaway-cars/index-og.htmlThis article was updated on April 11, 20251 Player2DCarCrazyDrivingEmbeddableFreeGTAPhysicsRacing",
  "extractedAt": "2025-06-10T05:22:22.076Z",
  "localThumbnail": "Mafia Getaway Cars_1749532942077.jpg"
}