{
  "url": "https://www.onlinegames.io/masked-special-forces/",
  "title": "Masked Special Forces",
  "category": "/t/action/",
  "thumbnail": "https://www.onlinegames.io/media/posts/310/Masked-Special-Forces.webp",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/310/Masked-Special-Forces.webp",
    "srcset": "https://www.onlinegames.io/media/posts/310/responsive/Masked-Special-Forces-xs.webp 384w, https://www.onlinegames.io/media/posts/310/responsive/Masked-Special-Forces-sm.webp 600w, https://www.onlinegames.io/media/posts/310/responsive/Masked-Special-Forces-md.webp 768w, https://www.onlinegames.io/media/posts/310/responsive/Masked-Special-Forces-lg.webp 1200w",
    "alt": "Masked Special Forces Controls",
    "width": 670,
    "height": 200,
    "className": "is-loaded",
    "parentClass": "post__image post__image--center is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2022/unity2/masked-special-forces/index.html",
  "content": {
    "headings": [
      {
        "type": "h3",
        "text": "⚠ Content Advisory"
      },
      {
        "type": "h2",
        "text": "How To Play Masked Special Forces"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h3",
        "text": "HUD"
      },
      {
        "type": "h3",
        "text": "Maps"
      },
      {
        "type": "h3",
        "text": "Game Modes"
      },
      {
        "type": "h3",
        "text": "Armory Section"
      },
      {
        "type": "h3",
        "text": "Perks"
      },
      {
        "type": "h3",
        "text": "Kill Message"
      },
      {
        "type": "h3",
        "text": "Emotes"
      },
      {
        "type": "h3",
        "text": "Profile Section"
      },
      {
        "type": "h3",
        "text": "Store Section"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "More FPS Games Online"
      }
    ],
    "controls": [
      "WASD or arrow keys to moveLeft mouse click to fireRight mouse click to aimSpace to jumpQ to slide while runningLeft shift to run1, 2, 3 (or scroll) to change weaponE or F to interact/pick up a weaponG to throw available dynamiteH to use available medkitsT to chatL to toggle cursor lockC to crouchHold Tab to show the scoreboardEscape to pause"
    ],
    "howToPlay": "You can begin the game by joining a room made by other players, or you can create one yourself. To do that, you must give a name to the room, choose the maximum players, game mode, round time, bot count and map.After entering a room, the battle starts immediately. Take your position and start eliminating enemies.Learn about how to aim and shoot, other controls, display, armory, and maps below.",
    "tips": "",
    "developer": "FreezeNova developed Masked Special Forces.",
    "similarGames": []
  },
  "fullContent": "Home› ShootingMasked Special ForcesBy OnlineGames.ioMake Game Full ScreenMasked Special Forces is a multiplayer first-person shooter game with a myriad of customization options. The game puts you in the shoes of a commander in the battle arena. As a talented warrior, team up, strategize, and take down the opponents one by one. Access to an array of upgradable weapons, armory, kill messages, and victory dances on the main menu. Ultra-realistic visuals and smooth gameplay will give you a feel at least as captivating as an iconic console game. In this fast-paced action game, you get to dive into an intense battle immediately. Or you can customize your gaming experience thoroughly before the gunfight. Select between available rooms, or create your own by selecting between detailed maps. Masked Special Forces is a game that stands out among all shooter games online thanks to its lifelike details. The game has been loved and played by thousands since its initial release. So, it happened to be a pioneer of a whole sequel with six different FPS games. If you are wondering about other games on the Masked Forces, we highly recommend you try your hand at Masked Forces Zombie Survival.      We invite you to a virtual shooting experience. Start playing with other players all around the world, or keep reading this post about Masked Special Forces to prepare for the battle. Learn about the armory, game modes, HUD and more about the game. If you need further guidance on how to get better at FPS games, we have picked the best advice from our top gamers.⚠ Content AdvisoryThis game includes mature elements such as intense action, strong language, or violent sequences. Player discretion is advised. If you’re looking for a different type of gameplay, explore our family-friendly game selection.How To Play Masked Special ForcesYou can begin the game by joining a room made by other players, or you can create one yourself. To do that, you must give a name to the room, choose the maximum players, game mode, round time, bot count and map.After entering a room, the battle starts immediately. Take your position and start eliminating enemies.Learn about how to aim and shoot, other controls, display, armory, and maps below.ControlsWASD or arrow keys to moveLeft mouse click to fireRight mouse click to aimSpace to jumpQ to slide while runningLeft shift to run1, 2, 3 (or scroll) to change weaponE or F to interact/pick up a weaponG to throw available dynamiteH to use available medkitsT to chatL to toggle cursor lockC to crouchHold Tab to show the scoreboardEscape to pauseHUDBP & Health (displayed on the top left)Kill feed (displayed on the top left)Map (displayed on the top right)Ammo (displayed on the bottom right)MapsFour different maps with realistic visuals and hidden gems are as follows. Choose your favorite and create your room on the map.Abandoned HouseFactoryKillhouseWarehouseGame ModesThe game has 6 insane modes you can choose from, and these are:Team Death MatchFree For All (Battle Royale)Capture the FlagGun GameArcade DoomOnline Player vs Player (PvP) modeArmory SectionYou have 2 load-outs to fill with epic weapons. Pick between various shotguns, rifles and melees to equip yourself with a great combination. Available weapons are as follows:MP5KN870SC-ARSC-DMR AX-50MGLTommy SC-L M4A1 AWPCrossbow CZ75PPKMagnumKnife AxeFrag Grenade Syringe Helmets 1-8 Armor 1-8PerksUnlock potent Perks to gain an edge in the arena:Quickdraw ammo Bolt Runner Silence Walker Explosion Master Bomber Man Samurai UAV Ghost Sitrep Fast Drawer Kill MessageYou noob!LOL!Good try!You picked the wrong house!That's not how the soldiers do!Why so serious?Wrong way, sir!EmotesVictory 1 Victory 2 Victory 3 Chicken Dance Robot Hip Hop Dance Macarena Dance Wave Hip Hop Dance Tut Hip Hop Dance Boogaloo Dance Thank you! Profile SectionIn the profile section, you will be able to change the nickname and load/save code (only experience can be saved through this code. You can replace your current load code with another one that loads a higher value.) It will include the following details: K/D Rate, Games Played, Total Play Time, Kills, Scores, Wins, Headshot Counts, Knife Kills, and Assist Counts.Store Section Rewarded Ads: Gold +5000, Diamond +1000Loot Box: Common Case (available with 500 diamonds)Rare Case (available with 1000 diamonds)Legendary Case (available with 2000 diamonds)DeveloperFreezeNova developed Masked Special Forces.More FPS Games OnlineLoved Masked Special Forces but want to try new maps? OnlineGames.io is a heaven for gamers. Take a look at dozens of shooting games online that come with different scenarios and graphics.We upload new games regularly, so stay in touch to learn about recent releases. Bookmark this website (Ctrl +D) so as not to lose your progress.Embed URL:https://www.onlinegames.io/games/2022/unity2/masked-special-forces/index.htmlThis article was updated on March 17, 20253DActionArmorBattle RoyaleEmbeddableFirst Person ShooterFreeGunio GamesMultiplayerShootingWarWeapon",
  "extractedAt": "2025-06-10T04:11:21.055Z",
  "localThumbnail": "Masked Special Forces_1749528681055.jpg"
}