{
  "url": "https://www.onlinegames.io/mech-shooter/",
  "title": "Mech Shooter",
  "category": "/t/shooting/",
  "thumbnail": "https://www.onlinegames.io/media/posts/649/Mech-Shooter.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/649/Mech-Shooter.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/649/responsive/Mech-Shooter-xs.jpg 384w, https://www.onlinegames.io/media/posts/649/responsive/Mech-Shooter-sm.jpg 600w, https://www.onlinegames.io/media/posts/649/responsive/Mech-Shooter-md.jpg 768w, https://www.onlinegames.io/media/posts/649/responsive/Mech-Shooter-lg.jpg 1200w",
    "alt": "Mech Shooter Free Online Game",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2022/unity/mech-shooter/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "How to Play Mech Shooter"
      },
      {
        "type": "h3",
        "text": "Mechs to Unlock"
      },
      {
        "type": "h3",
        "text": "Minigun or Launcher?"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "More Games Like This"
      }
    ],
    "controls": [
      "WASD/Arrow Keys: MoveLeft-Click: FireRight-Click: AimMouse: Look AroundSpacebar: JumpESC: Menu"
    ],
    "howToPlay": "An intense battle between robots is waiting for you to take part in!To be the winner of the fight, you must eliminate all the enemy robots you will encounter. Otherwise, they will do the same for you.This shooting game will open a game randomly when you click on the “Play” button.The map you will play the game on is a complete surprise. It may be a factory, city or garage.All the wars you will participate in are team death matches. You will not be alone! Enjoy fighting back-to-back with your teammates.",
    "tips": "",
    "developer": "Mech Shooter was developed by FreezeNova.",
    "similarGames": []
  },
  "fullContent": "Home› ShootingMech ShooterBy OnlineGames.ioMake Game Full ScreenMech Shooter is a 3D robot shooting game where you, in the shoes of Humanoid Mech, will deal with many robots trying to destroy you and your team. The game map can be a factory or somewhere in the city. No matter where you are, you will be with your teammates. Use your Minigun and eliminate all enemy forces in one of the most thrilling action games on Online Games!How to Play Mech ShooterAn intense battle between robots is waiting for you to take part in!To be the winner of the fight, you must eliminate all the enemy robots you will encounter. Otherwise, they will do the same for you.This shooting game will open a game randomly when you click on the “Play” button.The map you will play the game on is a complete surprise. It may be a factory, city or garage.All the wars you will participate in are team death matches. You will not be alone! Enjoy fighting back-to-back with your teammates.Mechs to UnlockAs you win robot battles, you will earn coins. Use these coins to unlock more powerful mechs. Enter the “Armory” section to view your choices. There are 4 mechs to be unlocked. Humanoid Mech is already yours. The others are accessible with the same prize: 5000 coins.These are all robots with very unusual appearances. Choose your favorite one and set out to crush other robots. We will leave the names of them below for you.Humanoid MechHeavy MechLight MechSpider MechBuggyMinigun or Launcher?Get new weapons for your robot’s giant arms! In the beginning, you will have a Minigun, which has a lower damage rate than other weapons. So, getting a powerful weapon will greatly benefit you in intense robot wars.All the weapons have three features: Damage Rate, Firing Rate and Capacity. You can consider these features when buying a new one.Minigun: Damage Rate - 25, Firing Rate - 80, Capacity - 75Minigun MK2: Damage Rate - 30, Firing Rate - 85, Capacity - 150Launcher: Damage Rate - 75, Firing Rate - 85, Capacity - 25Launcher MK2: Damage Rate - 100, Firing Rate - 85, Capacity - 20ControlsWASD/Arrow Keys: MoveLeft-Click: FireRight-Click: AimMouse: Look AroundSpacebar: JumpESC: MenuDeveloperMech Shooter was developed by FreezeNova.More Games Like ThisIf you are a Mech Shooter fan, you may also try Funny Shooter 2. Take down all the red-colored enemies in the game. Dodge their attacks and aim at their head to destroy them at once. You will fight with the sweet creatures in a place full of giant hamburgers!If you have any suggestions or wishes, please contact us! Additionally, if you want to spend time in games of other categories, there are many tags with free online games on the site. Each one is just a click away!Embed URL:https://www.onlinegames.io/games/2022/unity/mech-shooter/index.htmlThis article was updated on February 25, 20243DActionArmorBattleCrazyDestroyEmbeddableFreeGunMultiplayerShootingUnityWarWeapon",
  "extractedAt": "2025-06-10T05:43:19.871Z",
  "localThumbnail": "Mech Shooter_1749534199872.jpg"
}