{
  "url": "https://www.onlinegames.io/minecraft-classic/",
  "title": "Minecraft Classic",
  "category": "/t/adventure/",
  "thumbnail": "https://www.onlinegames.io/media/posts/382/Minecraft-Classic-Controls-2.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/382/Minecraft-Classic-Controls-2.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/382/responsive/Minecraft-Classic-Controls-2-xs.jpg 384w, https://www.onlinegames.io/media/posts/382/responsive/Minecraft-Classic-Controls-2-sm.jpg 600w, https://www.onlinegames.io/media/posts/382/responsive/Minecraft-Classic-Controls-2-md.jpg 768w, https://www.onlinegames.io/media/posts/382/responsive/Minecraft-Classic-Controls-2-lg.jpg 1200w",
    "alt": "Minecraft Classic Controls",
    "width": 883,
    "height": 238,
    "className": "is-loaded",
    "parentClass": "post__image post__image--center is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2024/cube/classicube/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "How to Play Minecraft Classic?"
      },
      {
        "type": "h3",
        "text": "Explore, Imagine and Build Your Dreams"
      },
      {
        "type": "h3",
        "text": "Blocks, Mines, Plants Options"
      },
      {
        "type": "h3",
        "text": "Don't Forget to Save Your Progress"
      },
      {
        "type": "h2",
        "text": "How to place blocks in Minecraft Classic?"
      },
      {
        "type": "h2",
        "text": "Can you fly in Minecraft Classic?"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "More Games Like Minecraft Classic"
      }
    ],
    "controls": [
      "WASD: MoveLeft-Shift: RunLeft-Click: BreakRight-Click: PlaceZ: FlyQ and E: Up and down while flyingX: Glitch through solid structuresSpacebar: JumpG: Drop blocksB: Open inventoryT: Open the chat menuR: SpawnEnter: Set a spawn point1-9 or scroll: Switch between blocksESC: Open the menuT: Toggle fog"
    ],
    "howToPlay": "Open Minecraft Classic on OnlineGames.io and start generating a new level. There are two kinds of land: Flatgrass and Vanilla.Flatgrass is an open world on a large flat map filled with grass, as the name suggests.The Vanilla Map has a more diverse environment in terms of geography. This heaven-like map has plants, lakes, and even a beach.After entering the map, feel free to explore every part of it. Left-click to break and right-click to build blocks around. You can see a more detailed list of keys to control at the bottom of this page. Minecraft Classic is a highly customizable game. You can change almost anything in the game to your preferences: graphics, texture packs, hotkeys, and even the color of the clouds. There are also nostalgia options that allow you to feel like you are playing pre-classic Minecraft in terms of both functionality and appearance.Just head over to the options menu and discover all the alternatives you have in this fantastic crafting game.",
    "tips": "",
    "developer": "",
    "similarGames": []
  },
  "fullContent": "Home› MinecraftMinecraft ClassicBy OnlineGames.ioMake Game Full ScreenAll times best-selling game Minecraft is now available on your browser for free. Minecraft Classic is a player-driven sandbox game with endless possibilities. If you like playing games that improve creativity, you will find a lot to enjoy in this game. This version of Minecraft is filled with so many details, options, and features that you will not miss any feature of the original Minecraft game. You are free to dig, carve and build whatever you like: a mansion for yourself or a whole new city. It's all in your hands.There are no monsters, enemies, or urgency to gather resources. Take it easy and discover the stress-free world of crafting.You can play this game consisting of a creative mode of Minecraft for free on OnlineGames.io without downloading a single file. How to Play Minecraft Classic?Open Minecraft Classic on OnlineGames.io and start generating a new level. There are two kinds of land: Flatgrass and Vanilla.Flatgrass is an open world on a large flat map filled with grass, as the name suggests.The Vanilla Map has a more diverse environment in terms of geography. This heaven-like map has plants, lakes, and even a beach.After entering the map, feel free to explore every part of it. Left-click to break and right-click to build blocks around. You can see a more detailed list of keys to control at the bottom of this page. Minecraft Classic is a highly customizable game. You can change almost anything in the game to your preferences: graphics, texture packs, hotkeys, and even the color of the clouds. There are also nostalgia options that allow you to feel like you are playing pre-classic Minecraft in terms of both functionality and appearance.Just head over to the options menu and discover all the alternatives you have in this fantastic crafting game.Explore, Imagine and Build Your DreamsThere are no levels, no mission to accomplish. The sky is the limit in Minecraft Classic.Explore a large map filled with numerous kinds of blocks.Decide where and what you'd like to build. You have 65 different types of materials to choose from.Don't worry about running out of materials. You have unlimited resources here in this game.Blocks, Mines, Plants OptionsYou can access the blocks menu by pressing B while playing. We have listed all block types below. Choose your favorites and add them to your favorites to use them with hotkeys.Blocks, mines and other building materials are as follows with their ID numbers: Stone (1), Grass (2), Dirt (3), Cobblestone (4), Wood (5), Sapling (6), Bedrock (7), Water (8), Still Water (9), Lava (10), Still Lava (11), Sand (12), Gravel (13), Gold Ore (14), Iron Ore (15), Coral Ore (16), Log (17), Leaves (18), Sponge (19), Glass (20), Dandelion (37), Rose (38), Brown mushroom (39), Red Mushroom (40), Gold (41), Iron (42), Double Slab (43), Slab Brick (44), TNT (45), Bookshelf (46), Mossy Rocks (47), Obsidian (48), Cobblestone slab (49), Rope (50), Sandstone (51), Snow (52), Fire (53), Ice (60), Ceramic Tile (61), Magma (62), Pillar (63), Crate (64), Stone Brick (65)Color blocks are as follows with their ID numbers: Red (21), Orange (22), Yellow (23), Lime (24), Green (25), Teal (26), Aqua (27), Cyan (28), Blue (29), Indigo (30), Violet (31), Magenta (32), Pink (33), Black (34), Gray (35), White (36), Light Pink (55), Forest Green (56), Brown (57), Deep Blue (58), Turquoise (59)Don't Forget to Save Your ProgressAfter playing for a while, in case you'd like to save your progress in your browser cache or download it to your computer. To save your progress, open the menu by pressing ESC while playing and hit the \"save level...\" button. Create a name for your level to keep it on the cache, or download it to your computer.Next time, you can continue where you left off by loading the .cw file.How to place blocks in Minecraft Classic?Press B and choose which type of block you want to construct in the inventory. Decide where you want to place the block and right-click there to build.Can you fly in Minecraft Classic?Of course, you can — press the Z key to fly in Minecraft Classic. Use Q and E to move up and down while flying.You can also maximize jump height in the hacks menu. This extremely high jump is another cool move that feels like flying.ControlsWASD: MoveLeft-Shift: RunLeft-Click: BreakRight-Click: PlaceZ: FlyQ and E: Up and down while flyingX: Glitch through solid structuresSpacebar: JumpG: Drop blocksB: Open inventoryT: Open the chat menuR: SpawnEnter: Set a spawn point1-9 or scroll: Switch between blocksESC: Open the menuT: Toggle fogMore Games Like Minecraft ClassicMinecraft is so influential that it gave birth to a whole new genre of online games. If you'd like to taste modes of Minecraft other than sandbox, play MiniBlox.io in survival mode. There are plenty of games you might also enjoy in Crafting Games and other Block Based Games. Follow the links to explore and enjoy for free on OnlineGames.io.This article was updated on January 22, 20243DAdventureBlockCraftingFreeMinecraftPixelSandboxSimulator",
  "extractedAt": "2025-06-10T04:17:51.932Z",
  "localThumbnail": "Minecraft Classic_1749529071932.jpg"
}