{
  "url": "https://www.onlinegames.io/mini-missions/",
  "title": "Mini Missions",
  "category": "/new-games/",
  "thumbnail": "https://www.onlinegames.io/media/posts/716/Mini-Missions-Play.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/716/Mini-Missions-Play.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/716/responsive/Mini-Missions-Play-xs.jpg 384w, https://www.onlinegames.io/media/posts/716/responsive/Mini-Missions-Play-sm.jpg 600w, https://www.onlinegames.io/media/posts/716/responsive/Mini-Missions-Play-md.jpg 768w, https://www.onlinegames.io/media/posts/716/responsive/Mini-Missions-Play-lg.jpg 1200w",
    "alt": "Mini Missions Online Game",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2024/shareddreams/mini-missions/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Our Review"
      },
      {
        "type": "h2",
        "text": "About This Game"
      },
      {
        "type": "h3",
        "text": "Direct the Flappy Bat!"
      },
      {
        "type": "h3",
        "text": "Be the Hero Doctor"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "More Games Like This"
      }
    ],
    "controls": [
      "Desktops and Laptops",
      "Use your cursor to play mini missions",
      "Mobile Devices",
      "Use the red button on the screen to play the minigames."
    ],
    "howToPlay": "",
    "tips": "",
    "developer": "Shared Dreams Studios developed Mini Missions.",
    "similarGames": []
  },
  "fullContent": "Home› 1 PlayerMini MissionsBy OnlineGames.ioMake Game Full ScreenAccurate timing has never been more important! Mini Missions is a 2D arcade game in which you must fulfill many tasks using only one button at the right time. You will find various minigames with pixelated graphics in different classes.Your objective is to complete each of the 80 mini-missions one by one. Take your place on Mars in outer space, play a tennis match or chase people embodying a zombie in this skill game!Our Review“Mini Missions offers enjoyable gaming experiences with games from different categories. You may carry water to a burning house with a helicopter or fight aliens on Mars! The mission I enjoyed playing the most was definitely Golf.” - OnlineGames Editor.About This GameMini Missions offers many kinds of games ranging from golfing to driving a helicopter.There are 80 challenging minigames in total. When you enter the game, you will see them side by side.You are free to start playing with any of them. Decide which one you want to play and click on it.In each game, you will try to fulfill your mission by using only the left-click button.As you successfully complete the tasks, the icon of those minigames will disappear from the menu.Try to challenge yourself with every game you see on the screen for the utmost enjoyment!Direct the Flappy Bat!In one of the games called Bat, you will try to direct a bat to move forward in the platform without crashing with any of the green pipes. When you press the left mouse button, it will levitate.When you release the button, it will float down. It reminds you of Flappy Bird, right? This time, you will find a bat instead of a bird! If you successfully pass 10 green pipes, you will have finished the game.Be the Hero DoctorIn the Doctor game, you must deliver medicine to your patient by overcoming the bombs falling from the sky. Your patient is very sick and waiting for your cure as his beloved doctor.You need to reach his side by moving forward with medicine in hand. However, if a bomb hits you, you will lose the game. You must find a way or develop a strategy to get past all the bombs.ControlsDesktops and LaptopsUse your cursor to play mini missionsMobile DevicesUse the red button on the screen to play the minigames.DeveloperShared Dreams Studios developed Mini Missions.More Games Like ThisTapman may also draw your attention. In the game, as you do in Pacman, you will direct your yellow character in a maze. However, you must dodge the colorful ghosts to get the highest scores!Look for the arcade games online tag on OnlineGames.io for additional game options. Please share your gaming experiences with us in the comment section below! We would love to hear from you.This article was updated on January 28, 20251 Player2DFreeFunHTML5MobileMousePixelSkill",
  "extractedAt": "2025-06-10T06:10:54.959Z",
  "localThumbnail": "Mini Missions_1749535854959.jpg"
}