{
  "url": "https://www.onlinegames.io/miniblox-io/",
  "title": "Miniblox io",
  "category": "/t/adventure/",
  "thumbnail": "https://www.onlinegames.io/media/posts/595/Miniblox-Io-Keyboard-Controls.webp",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/595/Miniblox-Io-Keyboard-Controls.webp",
    "srcset": "https://www.onlinegames.io/media/posts/595/responsive/Miniblox-Io-Keyboard-Controls-xs.webp 384w, https://www.onlinegames.io/media/posts/595/responsive/Miniblox-Io-Keyboard-Controls-sm.webp 600w, https://www.onlinegames.io/media/posts/595/responsive/Miniblox-Io-Keyboard-Controls-md.webp 768w, https://www.onlinegames.io/media/posts/595/responsive/Miniblox-Io-Keyboard-Controls-lg.webp 1200w",
    "alt": "Miniblox.io Controls",
    "width": 750,
    "height": 224,
    "className": "is-loaded",
    "parentClass": "post__image post__image--center is-loaded"
  },
  "gameFrame": "https://miniblox.io/",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "How to Play Miniblox io"
      },
      {
        "type": "h3",
        "text": "Be the King of Crafting: Sandbox Worlds"
      },
      {
        "type": "h3",
        "text": "Let Your Imagination Run Wild: Creativity Maps"
      },
      {
        "type": "h3",
        "text": "Improve Your Reflexes: Parkour Maps"
      },
      {
        "type": "h3",
        "text": "Give A Mini Break From Blocks: Minigames"
      },
      {
        "type": "h2",
        "text": "Social Gaming Features"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Games Like Minecraft"
      }
    ],
    "controls": [
      "You can change the controls in the options menu. Default controls are as follows:To move, use the WASD keys.Use the Space key to jump.To crouch, press the Left CTRL key.Use the Left Shift key to sprint.To sneak, press the Left Alt key.Press the Tab key to list players.Press the Enter key to open the chat.Use the Slash to open the command.Use the Q key to drop selected items.Press the E key to open/close inventory.Use the 1-9 number keys to switch between hotbar slots."
    ],
    "howToPlay": "Like every sandbox game, it is entirely up to your creativity to play Miniblox io.Game offers various open worlds in each map, and you will create your gaming experience on them.In Survival and Survival (Keep Inventory) maps, you survive in nature.In Creative and Superflat maps, you can use your imagination to create your own world with many items.Additionally, there are two parkour maps: Jump Parkour and Spiral Parkour. These maps challenge your as you need to jump long leaps and avoid obstacles on winding tracks.Keep reading and learn about the maps and controls of Miniblox.io.",
    "tips": "",
    "developer": "",
    "similarGames": []
  },
  "fullContent": "Home› CraftingMiniblox ioBy OnlineGames.ioMake Game Full Screen Miniblox io is a multiplayer sandbox game where you can play with mini blocks to boost your creativity. You can discover parkour maps, survival maps and other mini game maps. Each map comes with its special features. Try all of them and find your favorite one.You can even duel with other online players by trying to knock them off the bridge! You will love this game, like Minecraft, a lot. 🧱How to Play Miniblox ioLike every sandbox game, it is entirely up to your creativity to play Miniblox io.Game offers various open worlds in each map, and you will create your gaming experience on them.In Survival and Survival (Keep Inventory) maps, you survive in nature.In Creative and Superflat maps, you can use your imagination to create your own world with many items.Additionally, there are two parkour maps: Jump Parkour and Spiral Parkour. These maps challenge your as you need to jump long leaps and avoid obstacles on winding tracks.Keep reading and learn about the maps and controls of Miniblox.io.Be the King of Crafting: Sandbox WorldsIn Survival and Survival (Keep Inventory) maps, you will survive in the wild nature. Collect resources and start crafting.Your character will be hungry in time, so you need to hunt chickens, pigs and sheep to collect their meat. It may also be helpful to collect chickens’ feathers and sheep leather.You will encounter green monsters, and they may attack and hurt you. Avoid them as much as you can.You may see lakes and wetlands on the maps. But be careful while moving on them as you may get caught by the current. The current can take you places you do not want.As game offers survival experience in these maps, watch out for your character's health and hunger status from the bars. You can see the bars at the bottom right of the screen.Let Your Imagination Run Wild: Creativity MapsWhat you will need most is your creativity in the Creative and Superflat maps. These modes enable you to create your own world with endless item options.Tap to the E key to search for the items. You will see planks, ores of various precious stones, logs of different tree species, and saplings. And many more things to discover.Choose which item you want to use and add it to your inventory to be able to use and create.Improve Your Reflexes: Parkour MapsYou will find two different parkour maps in the game: Jump Parkour and Spiral Parkour.They will challenge your character-controlling skills as you will have to perform long jumps and overcome many blocks to move between spiraling tracks.Do not forget to reach the golden checkpoints to save your progress.Give A Mini Break From Blocks: MinigamesYou can find many maps to combat with other players. You will have a knife for close combat and an arch for remote attack.You may also duel on red and blue bridges connecting the two sides in the Bridge Duels. Knock your opponent off the bridge. Try to survive among the furious players!PitPvPSkywarsSpleefBridge DuelsSocial Gaming FeaturesThere will be many online players around the world. So, you can be friends with them and act together or combat with them.You may search for players and add them as friends from the Friends section in the menu.You can also view your friend requests here. But to play with friends, we recommend you sign in.ControlsYou can change the controls in the options menu. Default controls are as follows:To move, use the WASD keys.Use the Space key to jump.To crouch, press the Left CTRL key.Use the Left Shift key to sprint.To sneak, press the Left Alt key.Press the Tab key to list players.Press the Enter key to open the chat.Use the Slash to open the command.Use the Q key to drop selected items.Press the E key to open/close inventory.Use the 1-9 number keys to switch between hotbar slots.Games Like MinecraftIf you enjoy playing survival games, you may also try Survival Craft. You can dig, carve and whatever you like in this sandbox game. Just use your creativity and decide what you will build.For more options, you may look up the free Minecraft games collection on OnlineGames.io. You can access dozens of games that you can enjoy with one click!This article was updated on February 22, 20241 Player3DAdventureBlockCraftingFreeMinecraftSandboxSimulatorSurvivalUnityWeapon",
  "extractedAt": "2025-06-10T04:17:19.387Z",
  "localThumbnail": "Miniblox io_1749529039388.jpg"
}