{
  "url": "https://www.onlinegames.io/mob-city/",
  "title": "Mob City",
  "category": "/t/action/",
  "thumbnail": "https://www.onlinegames.io/media/posts/418/Mob-City.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/418/Mob-City.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/418/responsive/Mob-City-xs.jpg 384w, https://www.onlinegames.io/media/posts/418/responsive/Mob-City-sm.jpg 600w, https://www.onlinegames.io/media/posts/418/responsive/Mob-City-md.jpg 768w, https://www.onlinegames.io/media/posts/418/responsive/Mob-City-lg.jpg 1200w",
    "alt": "Mob City Play Online",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2021/unity3/mob-city/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "How to Play Mob City?"
      },
      {
        "type": "h2",
        "text": "Shop"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "More Games Like Mob City"
      }
    ],
    "controls": [
      "Use your Mouse to aimUse the WASD keys or the Arrow keys to moveUse the Space key or the J key to jumpUse the Left Mouse button or the Z key to fireUse the Right Mouse button or the X key to throw a grenadeUse the Left Shift or the C key to activate Hammer TimeUse the Mouse wheel or Q or E keys to cycle weaponsUse the Enter key to enter the vehicleUse ESC or the P key to pause the gameUse the M key to mute the audio toggleUse the V key to change the camera view"
    ],
    "howToPlay": "Mob City is a game where you progress by completing missions. 30 missions are waiting to be completed, and all expect you to fulfill different responsibilities. The first mission asks you to defeat 100 mafia men. After successfully completing each task, the next mission is unlocked. And a different kind of duty awaits you. The 30-episode story ends with you eliminating the big boss.\n\nYou can use cars and heavy weapons in the level by pressing the Enter key.As you pass each level, you will unlock achievements and earn money. You can buy tools that will strengthen you during the game from the Shop section with the money you make. There is even a god mode option. This means you are immortal!You should approach mafia men cautiously because they will attack you as more than one person.Move by paying attention to the health bar in the lower-left corner of the game screen. If you take too much damage, you die.As you defeat mafia men, things valuable to you will fall from them. Like money, like painkillers. Use them to your advantage.If the bad guys get too crowded, you can drag them towards a vehicle and blow up the car. But make sure you do not get hurt, either.",
    "tips": "",
    "developer": "",
    "similarGames": []
  },
  "fullContent": "Home› ShootingMob CityBy OnlineGames.ioMake Game Full ScreenAre you confident enough to attack the mafia gang alone? Mob City is a 3D shooting game with many missions to complete. You have a tremendous responsibility. Because it is up to you to defeat the bad guys. They are more numerous than you, but they do not have the strategy skills you have. Try to beat them by using your tools in the best way possible! In the final episode, you will meet with the big boss.How to Play Mob City?Mob City is a game where you progress by completing missions. 30 missions are waiting to be completed, and all expect you to fulfill different responsibilities. The first mission asks you to defeat 100 mafia men. After successfully completing each task, the next mission is unlocked. And a different kind of duty awaits you. The 30-episode story ends with you eliminating the big boss.You can use cars and heavy weapons in the level by pressing the Enter key.As you pass each level, you will unlock achievements and earn money. You can buy tools that will strengthen you during the game from the Shop section with the money you make. There is even a god mode option. This means you are immortal!You should approach mafia men cautiously because they will attack you as more than one person.Move by paying attention to the health bar in the lower-left corner of the game screen. If you take too much damage, you die.As you defeat mafia men, things valuable to you will fall from them. Like money, like painkillers. Use them to your advantage.If the bad guys get too crowded, you can drag them towards a vehicle and blow up the car. But make sure you do not get hurt, either.ShopWhen you click on the \"Shop\" section in the menu, you will see many guns and tools you can use in Mob City. You need to earn money to get them. When you remove a bad guy, he will likely drop his money. You can progress by collecting them. Below, we will list a few power-ups that you can find in the shop section. Most of them are things that will interest you.Godmode: You can not die when you get this. It is created to make you immortal. Yes, it is a bit like cheating! You can get it for $999,999.Vehicle Generator: When you buy this for $250,000, you can spawn a car wherever you want. Press any key between 0 and 9, and the vehicle you want will appear. You even have a helicopter option!Unlimited Weapon Ammo: No more worrying about whether my bullets will be enough. This power-up gives you infinite ammo. You can buy it for $500.00.ControlsUse your Mouse to aimUse the WASD keys or the Arrow keys to moveUse the Space key or the J key to jumpUse the Left Mouse button or the Z key to fireUse the Right Mouse button or the X key to throw a grenadeUse the Left Shift or the C key to activate Hammer TimeUse the Mouse wheel or Q or E keys to cycle weaponsUse the Enter key to enter the vehicleUse ESC or the P key to pause the gameUse the M key to mute the audio toggleUse the V key to change the camera viewMore Games Like Mob CityUrban Sniper is a game similar to Mob City, where you are given tasks on eliminating bad guys with your sniper. We also suggest looking up the Shooting Games and Sniper Games tags on OnlineGames.io for more gaming options.Embed URL:https://www.onlinegames.io/games/2021/unity3/mob-city/index.htmlThis article was updated on November 7, 20243DActionAdventureEmbeddableFreeGTAShootingSniperUnity",
  "extractedAt": "2025-06-10T04:16:44.135Z",
  "localThumbnail": "Mob City_1749529004136.jpg"
}