{
  "url": "https://www.onlinegames.io/monster-truck-racing/",
  "title": "Monster Truck Racing",
  "category": "/new-games/",
  "thumbnail": "https://www.onlinegames.io/media/posts/826/Monster-Truck-Racing.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/826/Monster-Truck-Racing.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/826/responsive/Monster-Truck-Racing-xs.jpg 384w, https://www.onlinegames.io/media/posts/826/responsive/Monster-Truck-Racing-sm.jpg 600w, https://www.onlinegames.io/media/posts/826/responsive/Monster-Truck-Racing-md.jpg 768w, https://www.onlinegames.io/media/posts/826/responsive/Monster-Truck-Racing-lg.jpg 1200w",
    "alt": "Monster Truck Racing Online Game",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2021/1/monster-truck-racing/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "How to Play Monster Truck Racing?"
      },
      {
        "type": "h2",
        "text": "Don't Flip Over"
      },
      {
        "type": "h2",
        "text": "Unlock New Monster Trucks"
      },
      {
        "type": "h2",
        "text": "Jump to Get Ahead"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "More Monster Truck Games"
      }
    ],
    "controls": [
      "Desktop",
      "Move forward: D or right arrowMove backward: A or left arrowJump: W or up arrow",
      "Mobiles",
      "Move forward: Tap on the gas pedal button on the bottom right cornerMove backward: Tap on the brake pedal button on the bottom left cornerJump: Tap on the jump icon in the bottom"
    ],
    "howToPlay": "Hit the button and start the race in the first level.Move with WASD or arrow keys.Your aim is to arrive at the finish flag first without exploding the car.Strategize your race by collecting coins on the way for later purchases. These coins are your key to unlocking new monster trucks and gaining an edge over your opponents.Perform flips to earn extra coins. Each flip brings you 3 bonus coins.",
    "tips": "",
    "developer": "FreezeNova created this game.",
    "similarGames": []
  },
  "fullContent": "Home› TruckMonster Truck RacingBy OnlineGames.ioMake Game Full ScreenGiant wheels and incredible engine power—Monster Trucks are amazing machines built for high performance on rough terrains. In this mini-game, players race to the finish line with monster trucks on an obstacle course. Drive your truck, perform jumps and flips, and be the first to reach the flag.Monster Truck Racing is a 2D single-player racing game where you'll strive to outpace opponents on steep tracks. Complete all 30 racetracks, and you'll likely end up covered in mud!ControlsDesktopMove forward: D or right arrowMove backward: A or left arrowJump: W or up arrowMobilesMove forward: Tap on the gas pedal button on the bottom right cornerMove backward: Tap on the brake pedal button on the bottom left cornerJump: Tap on the jump icon in the bottomHow to Play Monster Truck Racing?Hit the button and start the race in the first level.Move with WASD or arrow keys.Your aim is to arrive at the finish flag first without exploding the car.Strategize your race by collecting coins on the way for later purchases. These coins are your key to unlocking new monster trucks and gaining an edge over your opponents.Perform flips to earn extra coins. Each flip brings you 3 bonus coins.Don't Flip OverMonster cars are extremely durable in tough conditions off-road. So, minor crashes won't harm them. But if you crash while flipping over, the vehicle will explode, and you'll start over from that level.Unlock New Monster TrucksThe coins you collect and flips you perform on the road are essential for buying even bigger trucks.Unlock your favorite among 5 crazy monster trucks in the garage. The bigger the truck, the more advantage you have over your race opponents.Jump to Get AheadJumping on the road will get you ahead of other racers. Be careful not to flip over to the ground while jumping. Also, you might miss some of the coins on the road if you try to finish the track only by jumping. But mostly, this trick will work out well in reaching the flag first.DeveloperFreezeNova created this game.More Monster Truck GamesIf you enjoyed Monster Truck Racing, check out these other online truck games for even more high-octane action and exciting stunts. From extreme off-road challenges to crazy obstacle courses, these games will keep you revved up and racing!Our Gamie suggests Monster Cars: Ultimate Simulator for those who prefer more immersive graphics of 3D games. Check it out and let us know your opinion in the comments.Embed URL:https://www.onlinegames.io/games/2021/1/monster-truck-racing/index.htmlThis article was updated on August 27, 20241 Player2DCarCrazyEmbeddableFreeHTML5MobileRacingTruck",
  "extractedAt": "2025-06-10T06:06:56.051Z",
  "localThumbnail": "Monster Truck Racing_1749535616052.jpg"
}