{
  "url": "https://www.onlinegames.io/monster-truck-dirt-rally/",
  "title": "Monster Truck Dirt Rally",
  "category": "/new-games/",
  "thumbnail": "https://www.onlinegames.io/media/posts/447/Monster-Truck-Dirt-Rally.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/447/Monster-Truck-Dirt-Rally.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/447/responsive/Monster-Truck-Dirt-Rally-xs.jpg 384w, https://www.onlinegames.io/media/posts/447/responsive/Monster-Truck-Dirt-Rally-sm.jpg 600w, https://www.onlinegames.io/media/posts/447/responsive/Monster-Truck-Dirt-Rally-md.jpg 768w, https://www.onlinegames.io/media/posts/447/responsive/Monster-Truck-Dirt-Rally-lg.jpg 1200w",
    "alt": "Monster Truck Dirt Rally Play Online",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2022/unity3/monster-truck-dirt-rally/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "How to Play Monster Truck Dirt Rally"
      },
      {
        "type": "h3",
        "text": "Choosing Game Mode"
      },
      {
        "type": "h3",
        "text": "Truck Selection"
      },
      {
        "type": "h3",
        "text": "Checkpoints"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Want to play more?"
      }
    ],
    "controls": [
      "Use the WASD or the Arrow keys to steer the truckUse the Space key to handbrakeUse the C key to change the camera view"
    ],
    "howToPlay": "",
    "tips": "",
    "developer": "",
    "similarGames": []
  },
  "fullContent": "Home› DrivingMonster Truck Dirt RallyBy OnlineGames.ioMake Game Full Screen It's off-road time with giant monsters. If you like to get involved in rain and mud, you are in the right place. Monster Truck Dirty Rally is a monster driving game in which you race regardless of rain or shine. There are different game options that the game offers you. Choose what you want and join the rally.How to Play Monster Truck Dirt RallyChoosing Game ModeBefore you start the race, you need to choose the game mode. Monster Truck Dirty Rally offers you 3 different game options: Career, Challenge and Offroad. Each game mode has 10 unique levels.Career: Unlike the Challenge mode, the Career mode does not have an endurance bar or police surveillance. Here, you race with your opponents and try to reach the finish line. You must finish first, or you lose.Challenge: The truck will have a particular endurance bar in the Challenge mode. If this bar drops to zero, you will be arrested by the cops. You are under full police surveillance here.Offroad: You steer your monster truck in a freestyle manner in the Offroad. There are no opponents here. Here, you will pass through ramps and other obstacles. You are all by yourself, trying to pass the checkpoints and reach another level.Truck SelectionMonster Truck Dirty Rally contains 8 colorful and magnificent monster trucks. Choose the one that appeals to your eyes and start your game.CheckpointsThere are checkpoints in all game modes. You are responsible for passing all of these. You must pass all of them to be given the right to see the other checkpoint. Otherwise, you are not allowed to level up.ControlsUse the WASD or the Arrow keys to steer the truckUse the Space key to handbrakeUse the C key to change the camera viewWant to play more?Suppose you enjoy playing Monster Truck Dirty Rally. In that case, you should definitely check Monster Cars: Ultimate Simulator, which provides extensive customization options. Or, you can look for other online driving game collections on OnlineGames.io.This article was updated on September 2, 20243DDrivingFreeRacingRallyTruckUnity",
  "extractedAt": "2025-06-10T06:22:13.677Z",
  "localThumbnail": "Monster Truck Dirt Rally_1749536533677.jpg"
}