{
  "url": "https://www.onlinegames.io/mope-io/",
  "title": "Mope io",
  "category": "/t/adventure/",
  "thumbnail": "https://www.onlinegames.io/media/posts/853/mope.io.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/853/mope.io.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/853/responsive/mope.io-xs.jpg 384w, https://www.onlinegames.io/media/posts/853/responsive/mope.io-sm.jpg 600w, https://www.onlinegames.io/media/posts/853/responsive/mope.io-md.jpg 768w, https://www.onlinegames.io/media/posts/853/responsive/mope.io-lg.jpg 1200w",
    "alt": "Mope io Play For Free",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://mope.io/",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "How to Play Mope io"
      },
      {
        "type": "h2",
        "text": "Tips and Tricks for Mope io"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "More io Games"
      }
    ],
    "controls": [
      "Move: Move your mouse.Run: Hold LMBChat: EnterDive: W key"
    ],
    "howToPlay": "Pick a username, an animal and enter the map. At first, you can only choose small animals like a mouse, desert rat, shrimp, chipmunk or a tarsier. After entering the map, use your mouse to move your animal. Click and hold the left mouse button to boost your speed, which is essential for escaping larger predators or catching smaller prey.Start by consuming food items, such as fruits, meats and smaller animals. Each bite contributes to your XP bar. When your XP bar is full, you can evolve into a stronger species.Over 117 different animals are waiting to be unlocked. And it's not just the skin. Each species has unique abilities that can aid in hunting or running away from danger.",
    "tips": "You will consume water as a living animal in Mope io. Keep an eye on your water bar. To refill it, stay in lakes and oceans.Be cautious of animals outlined in red, as they are bigger and pose a threat. If you see one, it's often best to flee.Use your animal's special ability by pressing the 'W key' to gain advantages in hunting.You can hide in holes as temporary shelters, such as underwater or near trees, from predators. However, keep in mind that some stronger animals can force you out.Teaming up can enhance your chances. Press 'Enter' to chat with other players, especially in team mode.",
    "developer": "Mope io was released in October 2016 by indie developer Stan Tatarnykov.",
    "similarGames": []
  },
  "fullContent": "Home› io GamesMope ioBy OnlineGames.ioMake Game Full ScreenSurvival of the fittest is summed up in a game! Mope.io is a multiplayer survival game where you start as a tiny lil' mouse and work your way up the food chain. 🐭This io game lets you evolve into stronger animals by eating food and smaller creatures. Becoming the ultimate predator and writing your name on the leaderboard requires survival skills and strategy. The game’s colorful world resembling Taming io is filled with different species, each with its own abilities.ControlsMove: Move your mouse.Run: Hold LMBChat: EnterDive: W keyHow to Play Mope ioPick a username, an animal and enter the map. At first, you can only choose small animals like a mouse, desert rat, shrimp, chipmunk or a tarsier. After entering the map, use your mouse to move your animal. Click and hold the left mouse button to boost your speed, which is essential for escaping larger predators or catching smaller prey.Start by consuming food items, such as fruits, meats and smaller animals. Each bite contributes to your XP bar. When your XP bar is full, you can evolve into a stronger species.Over 117 different animals are waiting to be unlocked. And it's not just the skin. Each species has unique abilities that can aid in hunting or running away from danger.Tips and Tricks for Mope ioYou will consume water as a living animal in Mope io. Keep an eye on your water bar. To refill it, stay in lakes and oceans.Be cautious of animals outlined in red, as they are bigger and pose a threat. If you see one, it's often best to flee.Use your animal's special ability by pressing the 'W key' to gain advantages in hunting.You can hide in holes as temporary shelters, such as underwater or near trees, from predators. However, keep in mind that some stronger animals can force you out.Teaming up can enhance your chances. Press 'Enter' to chat with other players, especially in team mode.DeveloperMope io was released in October 2016 by indie developer Stan Tatarnykov.More io GamesIf you enjoy Mope.io, you might also like EvoWorld.io, which is a similar survival game where you evolve by eating food and other players.This article was updated on October 21, 20242DAdventureAnimalCombatCraftingFreeio GamesMultiplayerRPGSurvival",
  "extractedAt": "2025-06-10T05:08:33.262Z",
  "localThumbnail": "Mope io_1749532113262.jpg"
}