{
  "url": "https://www.onlinegames.io/moto-x3m-pool-party/",
  "title": "Moto X3M Pool Party",
  "category": "/t/racing/",
  "thumbnail": "https://www.onlinegames.io/media/posts/711/Moto-X3M.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/711/Moto-X3M.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/711/responsive/Moto-X3M-xs.jpg 384w, https://www.onlinegames.io/media/posts/711/responsive/Moto-X3M-sm.jpg 600w, https://www.onlinegames.io/media/posts/711/responsive/Moto-X3M-md.jpg 768w, https://www.onlinegames.io/media/posts/711/responsive/Moto-X3M-lg.jpg 1200w",
    "alt": "Moto X3M Pool Party Online Game",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2024/gm/moto-x3m-pool-party/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Basics of Moto X3M Pool Party"
      },
      {
        "type": "h3",
        "text": "Don't Break Your Neck"
      },
      {
        "type": "h3",
        "text": "The Driver with Rooster Costume"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "Similar Online Games"
      }
    ],
    "controls": [
      "Desktops and Laptops",
      "WASD Keys: Steer the Bike",
      "Mobile Devices",
      "Use the virtual buttons on the screen to steer the bike."
    ],
    "howToPlay": "",
    "tips": "",
    "developer": "MadPuffers developed the Moto X3M Pool Party.",
    "similarGames": [
      {
        "title": "Moto X3M Spooky Land",
        "url": "https://www.onlinegames.io/moto-x3m-spooky-land/"
      }
    ]
  },
  "fullContent": "Home› BikeMoto X3M Pool PartyBy OnlineGames.ioMake Game Full ScreenWelcome to the pool party version of the popular video game series Moto X3M!Moto X3M Pool Party is a 2D bike trial game in which you steer your motorcycle on the platforms around a pool.To reach the final point as quickly as possible, you must dodge all the obstacles on your way by performing stunts! Show your acrobatic movement skills in this bike game.Basics of Moto X3M Pool PartyThe rules are the same as in the original game Moto X3M. This time you will be near a sandy beach.Your main objective in this driving game is to overcome the obstacles on the road to reach the final zone.To get three stars, you must be quick to get there! The clock will begin counting when you start riding your bike.Strive to perform flipovers, as each stunt you make will earn you 0.5 seconds. Ride through giant green tubes at high speed.Dodge all the spiky globes coming towards you. When a platform throws you into the air, try not to lose your steering control.Get past the big pool under the sun and head to the final point! Reaching the checkpoints will also help you progress on the way to the end.Don't Break Your NeckThere are 22 challenging levels in Moto X3M Pool Party. Strive to reach the final zone at each level, avoiding a crash within the shortest time. You must drive your bike at high speed to get three stars.However, you may trip over an obstacle and turn upside down, breaking your neck. You must be cautious while riding the motorcycle. The best strategy to save time is to perform stunts in these conditions.The Driver with Rooster CostumeYou are already familiar with the orange bike from the previous version of this driving game. Two new exotic motorcycles await you to unlock in this pool twist. There is a yellow cross bike, which you can unlock with 12 stars.On the other hand, collecting 35 stars will allow you to get the driver in a rooster costume. What a consequence: The driver's motorcycle also looks like a rooster!ControlsDesktops and LaptopsWASD Keys: Steer the BikeMobile DevicesUse the virtual buttons on the screen to steer the bike.DeveloperMadPuffers developed the Moto X3M Pool Party.Similar Online GamesYou may also enjoy playing Moto X3M Spooky Land, another version of the Moto X3M series. This time, you will ride your bike on spooky roads with lots of ghosts and pumpkins!View other online bike games on OnlineGames.io for more alternatives. Please share your gaming experiences with us in the comment section below. We'd be very happy to hear from you!This article was updated on September 2, 20241 Player2DBikeCrashCrazyDrivingFreeHTML5MobilePhysicsRacingStuntTrial",
  "extractedAt": "2025-06-10T05:37:20.199Z",
  "localThumbnail": "Moto X3M Pool Party_1749533840200.jpg"
}