{
  "url": "https://www.onlinegames.io/moto-x3m-spooky-land/",
  "title": "Moto X3M Spooky Land",
  "category": "/t/racing/",
  "thumbnail": "https://www.onlinegames.io/media/posts/676/Moto-X3M-Spooky-Land-Online.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/676/Moto-X3M-Spooky-Land-Online.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/676/responsive/Moto-X3M-Spooky-Land-Online-xs.jpg 384w, https://www.onlinegames.io/media/posts/676/responsive/Moto-X3M-Spooky-Land-Online-sm.jpg 600w, https://www.onlinegames.io/media/posts/676/responsive/Moto-X3M-Spooky-Land-Online-md.jpg 768w, https://www.onlinegames.io/media/posts/676/responsive/Moto-X3M-Spooky-Land-Online-lg.jpg 1200w",
    "alt": "Moto X3M Spooky Land Online Game",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2024/gm/moto-x3m-spooky-land/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "About This Game"
      },
      {
        "type": "h3",
        "text": "Watch Out for the Traps!"
      },
      {
        "type": "h3",
        "text": "Life-Savers: Check Points"
      },
      {
        "type": "h3",
        "text": "Spooky Motorcycles"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "What is More?"
      }
    ],
    "controls": [
      "WASD or the Arrow Keys: Move"
    ],
    "howToPlay": "",
    "tips": "",
    "developer": "MadPuffers created the Moto X3M Spooky Land.",
    "similarGames": []
  },
  "fullContent": "Home› BikeMoto X3M Spooky LandBy OnlineGames.ioMake Game Full ScreenHalloween has arrived. And if you're sitting on the couch wondering what to do, open Moto X3M Spooky Land. It is a bike game with a Halloween theme. The rules are the same with the original game Moto X3M. Overcome the challenges on the spooky road and reach the finish line in the shortest time. In this driving game, you will enjoy riding on a road full of ghosts and pumpkins.ControlsWASD or the Arrow Keys: MoveAbout This GameIt is the sixth version of the original driving game Moto X3M. The game has the same objective: ride your bike through the terrifying tracks full of bones. You will face many bone-chilling obstacles on the way. And your mission is to reach the final zone quickly by overcoming the haunting challenges.Try to get three stars in each level, as they will enable you to get new and startling motorcycles. There are 22 levels in Moto X3M Spooky Land; master navigating your bike and face the dangers head-on in this horror game.Watch Out for the Traps!There will be many cunning traps on the trials that may throw you away. So, you have to be cautious while moving forward. If you come across any trap, quickly maneuver and perform a stunt. It will save you time and prevent you from flipping over. Ensure your head does not contact the ground, causing breakneck. Otherwise, you must start from the beginning or the last checkpoint.Life-Savers: Check PointsYou will see green checkpoints with a guard ghost when you successfully pass the trials and move forward enough. These points will let you continue your way even if you fall from your bike. You won't have to start from the beginning in this way.Spooky MotorcyclesTry to reach the finish line in each level with three stars. Save them for unlocking new kinds of bikes to add color to your gaming experience. Unlock the bike of the green witch with 12 stars. The other bike, which is crafted with bones, will cost you 35 stars. Collecting that number of stars is very challenging, but it is not impossible!DeveloperMadPuffers created the Moto X3M Spooky Land.What is More?Explore the first game of the Moto X3M series if you enjoy playing bike games. Drive your motorcycle in the game through obstacles. Jump over, perform stunts and flip in the air, but don't crash!View other trial games online that may draw your attention on the site. Additionally, if you stay tuned, you will always find new and thrilling games on OnlineGames.io.This article was updated on September 2, 20241 Player2DBikeCrashCrazyDrivingFreeHTML5PhysicsRacingStuntTrial",
  "extractedAt": "2025-06-10T05:37:29.382Z",
  "localThumbnail": "Moto X3M Spooky Land_1749533849383.jpg"
}