{
  "url": "https://www.onlinegames.io/mr-dracula/",
  "title": "Mr Dracula",
  "category": "/t/puzzle/",
  "thumbnail": "https://www.onlinegames.io/media/posts/449/Mr-Dracula.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/449/Mr-Dracula.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/449/responsive/Mr-Dracula-xs.jpg 384w, https://www.onlinegames.io/media/posts/449/responsive/Mr-Dracula-sm.jpg 600w, https://www.onlinegames.io/media/posts/449/responsive/Mr-Dracula-md.jpg 768w, https://www.onlinegames.io/media/posts/449/responsive/Mr-Dracula-lg.jpg 1200w",
    "alt": "Mr Dracula Play Online",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://html5.gamedistribution.com/043a2a24444e47cbb5b35347038579a9/?gd_sdk_referrer_url=https://www.onlinegames.io/mr-dracula",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Who is Mr Dracula?"
      },
      {
        "type": "h2",
        "text": "How to Play Mr Dracula"
      },
      {
        "type": "h3",
        "text": "Aiming"
      },
      {
        "type": "h3",
        "text": "Obstacles"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Similar Games"
      }
    ],
    "controls": [
      "Aim by pressing the left mouse button, direct the bullet wherever you want it to go and release the button."
    ],
    "howToPlay": "There are 50 exciting and challenging levels in Mr Dracula. Each comes with different levels of difficulty. Your primary mission here is to destroy all the monsters in the level by effectively using the limited number of bullets given to you.",
    "tips": "",
    "developer": "",
    "similarGames": [
      {
        "title": "Rooftop Snipers",
        "url": "https://www.onlinegames.io/rooftop-snipers/"
      }
    ]
  },
  "fullContent": "Home› ShootingMr DraculaBy OnlineGames.ioMake Game Full Screen Welcome to the world of Count Dracula! Our famous vampire is excited because Halloween is approaching. Mr Dracula is a Halloween-themed shooting and puzzle game where you, as Dracula himself, eliminate zombies, pumpkin monsters and other funny creatures by strategic shooting. To level up, you must aim very well and destroy all creatures in the game, including cute ghosts.Who is Mr Dracula?Count Dracula of Transylvania is a famous vampire myth from British writer Bram Stoker’s 1897 horror novel. Throughout history, dozens of movies have been made, and books have been written about this fictional character. Even festivals were organized in his name, such as the World Dracula Congress.How to Play Mr DraculaThere are 50 exciting and challenging levels in Mr Dracula. Each comes with different levels of difficulty. Your primary mission here is to destroy all the monsters in the level by effectively using the limited number of bullets given to you.AimingDracula has a small number of bullets, and he must use them well. It is a blank shot if the pellets do not hit any creatures. When shooting, he needs to direct the bullet using the edges of the wall. Otherwise, he will have difficulty hitting some creatures, and his shots will be wasted. He can even try to maneuver the bullet in such a way that he can destroy all zombies, monsters and ghosts with a single bullet. This way, he gets a higher score. Challenge accepted!ObstaclesDracula will encounter obstacles filled with walls, chests and even puddles. The key here is not to see these obstacles as obstacles but to use them to advantage. The solution is actually hidden in the question!ControlsAim by pressing the left mouse button, direct the bullet wherever you want it to go and release the button.Similar GamesIf you like playing with colorful graphics of Mr Dracula, you may also like Rooftop Snipers, in which you try to throw your opponents off the roof by shooting them. Or, you can look for other shooting game collections carefully selected on OnlineGames.io.This article was updated on May 9, 20241 Player2DArcadeCrazyFreeFunFunnyHorrorHTML5LogicMousePhysicsPuzzleShooting",
  "extractedAt": "2025-06-10T05:50:30.615Z",
  "localThumbnail": "Mr Dracula_1749534630615.jpg"
}