{
  "url": "https://www.onlinegames.io/mr-racer/",
  "title": "Mr Racer",
  "category": "/t/car/",
  "thumbnail": "https://www.onlinegames.io/media/posts/751/Mr.Racer.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/751/Mr.Racer.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/751/responsive/Mr.Racer-xs.jpg 384w, https://www.onlinegames.io/media/posts/751/responsive/Mr.Racer-sm.jpg 600w, https://www.onlinegames.io/media/posts/751/responsive/Mr.Racer-md.jpg 768w, https://www.onlinegames.io/media/posts/751/responsive/Mr.Racer-lg.jpg 1200w",
    "alt": "Mr Racer Play Online",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://html5.gamedistribution.com/a42cb23aca9647b3840f8a7dca61fde5/?gd_sdk_referrer_url=https://www.onlinegames.io/mr-racer/",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Overview of Mr Racer"
      },
      {
        "type": "h3",
        "text": "Game Modes: Challenge or Chase?"
      },
      {
        "type": "h3",
        "text": "Five Realistic Locations"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "You May Also Like"
      }
    ],
    "controls": [
      "Desktops and Laptops",
      "W/Up Arrow Key: AccelerateS/Down Arrow Key: BrakeA/Left Arrow Key: Steer LeftD/Right Arrow Key: Steer RightH: HornESC: Pause",
      "Mobile Devices",
      "Use the virtual buttons on the screen to control the car."
    ],
    "howToPlay": "",
    "tips": "",
    "developer": "ChennaiGames Studio Private Limited developed the Mr Racer.",
    "similarGames": []
  },
  "fullContent": "Home› RacingMr RacerBy OnlineGames.ioMake Game Full ScreenMaria invites you to be the Mr Racer! Watch her announcements. Mr Racer is a 3D racing game where you can participate in various races with multiple game modes. Choose the game mode you want to play and set off in flowing traffic!Master steering your car without crashing with any other vehicles on the way. Earn money from the races to unlock new cars in this driving game! Or you can upgrade the vehicles you own.ControlsDesktops and LaptopsW/Up Arrow Key: AccelerateS/Down Arrow Key: BrakeA/Left Arrow Key: Steer LeftD/Right Arrow Key: Steer RightH: HornESC: PauseMobile DevicesUse the virtual buttons on the screen to control the car.Overview of Mr RacerYour assistant Maria will welcome you when you enter the game. She will guide you throughout the races.There are six different game modes in this racing game. And each of the modes offers you a different kind of gaming experience.Your job? Drive your car in various locations and win the races you participate in. The races will test your driving skills to the utmost!You will earn money in every race in which you come first. Use them to unlock new powerful sports vehicles or upgrade the ones you have.Game Modes: Challenge or Chase?This driving game offers you six unique game modes. Each comes with different purposes. However, note that you must unlock the Chase and Time Trial mode. We will leave you brief information about them below!Challenge: There are 100 levels to accomplish. You must reach the finish line in time.Career Race: You will race with master racers. This game mode has three categories: Beginner, Intermediate, Pro, Master and Legend.Endless: You can perform close overtakes like you do in Highway Traffic in the Endless Mode!Free Ride: Feel free to drive your car as you wish. There are no tasks in Free Ride.Chase: Unlock the Chase with 99,000 cash and chase your rivals!Time Trial: Unlock the Time Trial with 45,000 and race against time!Five Realistic LocationsYou will start driving your car in Farm Land. But 4 more different locations are waiting for you to unlock them! Remember that you have the right to choose the location in which you drive your car in Endless and Free Ride modes.Farm Land: FreeCity: Unlock with 19,000 cashMountain Day: Unlock with 29,000 cashMountain Night: Unlock with 49,000 cashSnow: Unlock with 99,000 cashDeveloperChennaiGames Studio Private Limited developed the Mr Racer.You May Also LikeYour next stop is Drift Hunters 2, an ultra-realistic drift simulator game with an in-depth tuning mechanism. Don't wait; master controlling the car on sharp bends and be a drift hunter!You may look for racing games on OnlineGames.io for further gaming options. There are lots of free online games on your browser! Bookmark this website to access them easily.This article was updated on May 30, 20241 Player3DCarDrivingEndlessFreeHTML5MobileRacingSimulatorSpeedTraffic",
  "extractedAt": "2025-06-10T05:25:28.853Z",
  "localThumbnail": "Mr Racer_1749533128854.jpg"
}