{
  "url": "https://www.onlinegames.io/mr-space-bullet/",
  "title": "Mr Space Bullet",
  "category": "/new-games/",
  "thumbnail": "https://www.onlinegames.io/media/posts/707/Mr-Space-Bullet.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/707/Mr-Space-Bullet.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/707/responsive/Mr-Space-Bullet-xs.jpg 384w, https://www.onlinegames.io/media/posts/707/responsive/Mr-Space-Bullet-sm.jpg 600w, https://www.onlinegames.io/media/posts/707/responsive/Mr-Space-Bullet-md.jpg 768w, https://www.onlinegames.io/media/posts/707/responsive/Mr-Space-Bullet-lg.jpg 1200w",
    "alt": "Mr Space Bullet Online Game",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2021/4/mr-space-bullet/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Basics of Mr Space Bullet"
      },
      {
        "type": "h3",
        "text": "Facing the Aliens"
      },
      {
        "type": "h3",
        "text": "Extraordinary Avatars and Weapons"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "What is More?"
      }
    ],
    "controls": [
      "Desktops and Laptops",
      "Left-Click: Shoot",
      "Mobile Devices",
      "Use the touchscreen to shoot."
    ],
    "howToPlay": "",
    "tips": "",
    "developer": "FreezeNova developed Mr Space Bullet.",
    "similarGames": []
  },
  "fullContent": "Home› ArcadeMr Space BulletBy OnlineGames.ioMake Game Full ScreenMr Space Bullet is a 2D shooting game where you will be on a staircase in outer space. While trying to climb up, you will come across many aliens on your way. Your job is to aim at your enemies precisely at their heads.Shoot the alien you encounter on every stair without blinking an eye. This way, you will reach the top step by step in this arcade game! Remember to collect the coins dropped by the aliens.Basics of Mr Space BulletYour main objective in this arcade game is to defeat all the aliens you will bump into.They will meet you at every step as you try to climb up to the top of outer space.To shoot them, you must find the proper time since your character's arms will constantly move up and down.When the gun's tip is pointed directly at the alien, it is the right time to fire.When you get close to the top, there will be a stronger alien to defeat. To eliminate him, you need to shoot him more than once.You will be able to pass to the next level when you successfully wipe him off.Each alien you remove out from space will bring you coins. Collect them to unlock new characters and powerful guns!Facing the AliensIn each level, you will deal with a few aliens. These aliens will try to prevent you from reaching the top. You will be the one who fires the first bullet. However, keep in mind that if you fail to shoot them, they will not show mercy.When it's their turn, they can defeat you with a single bullet. For this reason, you can't let the bullet pass without hitting them. Otherwise, you will have to return to the staircase's first step.Extraordinary Avatars and WeaponsCollecting the coins dropped by the aliens will allow you to acquire new avatars and weapons. There are characters to unlock, such as Hitman, Cowboy, and Commando. Save 350 coins to get any of them from the Characters section.On the other hand, you need 250 coins to purchase a new gun. Did you know you can shoot aliens using an AK-47 in space? Yes, you can unlock it from the Weapon section. For your information, new avatars and weapons are unlocked randomly.ControlsDesktops and LaptopsLeft-Click: ShootMobile DevicesUse the touchscreen to shoot.DeveloperFreezeNova developed Mr Space Bullet.What is More?If you love to be in outer space, you may also enjoy playing Alien Sky Invasion. You will steer a jet aircraft in infinite space. However, aliens from other galaxies will try to attack you with their lasers! Find a way to get rid of them.View other online space games on OnlineGames.io for further options. Moreover, you will always find new and thrilling online games if you stay tuned.Embed URL:https://www.onlinegames.io/games/2021/4/mr-space-bullet/index.htmlThis article was updated on August 7, 20241 Player2DArcadeEmbeddableFreeGunMobileMouseShootingSpaceWeapon",
  "extractedAt": "2025-06-10T06:11:29.857Z",
  "localThumbnail": "Mr Space Bullet_1749535889857.jpg"
}