{
  "url": "https://www.onlinegames.io/my-dentist/",
  "title": "My Dentist",
  "category": "/new-games/",
  "thumbnail": "https://www.onlinegames.io/media/posts/607/My-Dentist.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/607/My-Dentist.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/607/responsive/My-Dentist-xs.jpg 384w, https://www.onlinegames.io/media/posts/607/responsive/My-Dentist-sm.jpg 600w, https://www.onlinegames.io/media/posts/607/responsive/My-Dentist-md.jpg 768w, https://www.onlinegames.io/media/posts/607/responsive/My-Dentist-lg.jpg 1200w",
    "alt": "My Dentist Free Online Game",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://html5.gamedistribution.com/2a355dfa5ff54168b3c69f1de0de7898/?gd_sdk_referrer_url=https://www.onlinegames.io/my-dentist",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "How to Play My Dentist"
      },
      {
        "type": "h3",
        "text": "Dental Instruments"
      },
      {
        "type": "h3",
        "text": "Fixing Teeth"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "What is More?"
      }
    ],
    "controls": [
      "Use your mouse to treat your patients."
    ],
    "howToPlay": "Choose your patients who have different backgrounds and start to make operations.You will fix cavities, remove some teeth, and replace them with new, shiny ones.Some patients will need to wear braces to correct their tooth structure.Do not forget to anesthetize your patients before beginning operations.Pick up your dental instruments and do whatever is necessary!When you grab a dental tool, you will see arrows on the game screen indicating what you should do with that specific tool.In general, people’s biggest fear is dentists. So, be nice to your patients. You are not an ordinary dentist. Carry your operations without hurting them!Overall, this dental game will teach the kids a lot about dental health.",
    "tips": "",
    "developer": "My Dentist is created by FreezeNova.",
    "similarGames": []
  },
  "fullContent": "Home› DoctorMy DentistBy OnlineGames.ioMake Game Full Screen My Dentist is a doctor game where you perform dental procedures for your patients. Many people have oral health diseases and are waiting for you in your clinic. You are a renowned dentist worldwide, and your patient’s expectations of you are high. Some even came from distant countries for you. Send them home with healthy smiles in this doctor game! 🦷How to Play My DentistChoose your patients who have different backgrounds and start to make operations.You will fix cavities, remove some teeth, and replace them with new, shiny ones.Some patients will need to wear braces to correct their tooth structure.Do not forget to anesthetize your patients before beginning operations.Pick up your dental instruments and do whatever is necessary!When you grab a dental tool, you will see arrows on the game screen indicating what you should do with that specific tool.In general, people’s biggest fear is dentists. So, be nice to your patients. You are not an ordinary dentist. Carry your operations without hurting them!Overall, this dental game will teach the kids a lot about dental health.Dental InstrumentsThere are many virtual tools to use while you are operating. Having basic knowledge about them makes your job easier. We leave you some of the tools listed below.Dental Mirror: It enables you to see all the teeth, including those behind.Tooth Explorer: Its sharp tip is used for exploring the cavities.Saliva Ejector: It allows you to remove accumulated saliva while you are operating.Tweezers: Tweezers are for placing and removing cotton rolls or other small objects.Syringe: Syringe will enable you to anesthetize the patient by delivering the anesthetic.Dental Nippers: You are removing the rotten tooth by using dental nippers.Fixing TeethBegin with removing small objects such as parsley particles and little fishbones by using the tweezers.Do not forget to use a saliva ejector occasionally, as accumulated saliva may disturb your patient.Brush your patient’s teeth so they can operate on him/her with a clear point of view.When you extract a tooth, apply anesthesia to your patient using the syringe. Remove the tooth by using dental nippers. Otherwise, the operation hurts your patient a lot.X-ray enables you to view the broken teeth. If you find one, put the tooth pieces together like puzzle pieces.ControlsUse your mouse to treat your patients.DeveloperMy Dentist is created by FreezeNova.What is More?If you love playing My Dentist, you may also like Hospital Doctor. You are a prominent doctor in a hospital, and your patients are waiting for your treatments. Make your diagnosis and find the appropriate treatments. Use your medical equipment wisely!You may look up other kids games free on OnlineGames.io for more options. You have access to dozens of enjoyable games for free on the site!This article was updated on May 9, 20241 Player2DDoctorFreeFunKidsMouseSimulatorUnity",
  "extractedAt": "2025-06-10T06:14:35.279Z",
  "localThumbnail": "My Dentist_1749536075279.jpg"
}