{
  "url": "https://www.onlinegames.io/neon-war/",
  "title": "Neon War",
  "category": "/new-games/",
  "thumbnail": "https://www.onlinegames.io/media/posts/642/Neon-War.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/642/Neon-War.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/642/responsive/Neon-War-xs.jpg 384w, https://www.onlinegames.io/media/posts/642/responsive/Neon-War-sm.jpg 600w, https://www.onlinegames.io/media/posts/642/responsive/Neon-War-md.jpg 768w, https://www.onlinegames.io/media/posts/642/responsive/Neon-War-lg.jpg 1200w",
    "alt": "Neon War Free Online Game",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2024/q/7/neon-war/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "How to Play Neon War"
      },
      {
        "type": "h3",
        "text": "Gold Battery"
      },
      {
        "type": "h3",
        "text": "Use the Blue Hexagons"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "Explore Other Games"
      }
    ],
    "controls": [
      "Left-Click (hold down): Steer the Cannon"
    ],
    "howToPlay": "You will see black holes on the screen. The shining shapes will come out from these holes. They will have numbers on them. These numbers indicate that you must shoot a block with the number of times written on it. When you navigate the golden gun, it will automatically start to fire. All you need to do is to control it horizontally. Click on the cannon and drag it to the left and right to navigate it.",
    "tips": "",
    "developer": "Neon War was developed by Qky Games.",
    "similarGames": []
  },
  "fullContent": "Home› ArcadeNeon WarBy OnlineGames.ioMake Game Full ScreenNeon War is an online shooting game where your main aim is to shoot at the neon shapes. They will pop out from black holes. Aim at them by steering your cannon. You can only navigate it horizontally. Make sure that when it shoots, the bullets get in contact with the blocks. It is the only way to remove them in one of the most enjoyable arcade games!How to Play Neon WarYou will see black holes on the screen. The shining shapes will come out from these holes. They will have numbers on them. These numbers indicate that you must shoot a block with the number of times written on it. When you navigate the golden gun, it will automatically start to fire. All you need to do is to control it horizontally. Click on the cannon and drag it to the left and right to navigate it.Gold BatteryA gold battery icon is at the upper left corner of the screen. It indicates your gun’s health. Any touch with objects will cause this health bar to drop. So, you must avoid getting in contact with the blocks as much as possible. They will keep bouncing along the platform until you eliminate them. Precise aiming will help you a lot.Use the Blue HexagonsYou will get blue hexagons when you destroy the objects on the platform. These hexagons will enable you to upgrade your cannon’s features. Upgrades will help you get the highest game scores by strengthening your gun. Each upgrade will bring it +5% power.Fire Rate: Enables you to shoot faster. The faster you shoot, the quicker you remove the blocks from the platform.Damage: Enhances your gun’s damage rate to cause more harm to the shapes.Health: Increases the health rate. It will give you longer game experiences.Pet: Get your cannon little companions by using this upgrade. They can also shoot.ControlsLeft-Click (hold down): Steer the CannonDeveloperNeon War was developed by Qky Games.Explore Other GamesIf you enjoy playing Neon War, you may also try Nova Idle Clicker. Relying on your reflexes is a must in this game!For more options, you may look up other arcade games online by following the link. If you have any suggestions or a wishlist, please don’t hesitate to contact us! We’d be very happy to hear from you.This article was updated on May 9, 20241 Player2DArcadeAvoidDestroyEndlessFreeFunGunHexagonMobileMouse",
  "extractedAt": "2025-06-10T06:12:56.033Z",
  "localThumbnail": "Neon War_1749535976033.jpg"
}