{
  "url": "https://www.onlinegames.io/obby-draw-and-jump/",
  "title": "Obby: Draw and Jump",
  "category": "/t/action/",
  "thumbnail": "https://www.onlinegames.io/media/posts/923/Obby-Draw-and-Jump.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/923/Obby-Draw-and-Jump.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/923/responsive/Obby-Draw-and-Jump-xs.jpg 384w, https://www.onlinegames.io/media/posts/923/responsive/Obby-Draw-and-Jump-sm.jpg 600w, https://www.onlinegames.io/media/posts/923/responsive/Obby-Draw-and-Jump-md.jpg 768w, https://www.onlinegames.io/media/posts/923/responsive/Obby-Draw-and-Jump-lg.jpg 1200w",
    "alt": "Obby Draw and Jump Free Online Game",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://playhop.com/app/289722?utm_source=distrib&is-united-page=1&skip-guard=1&header=no&utm_medium=cristian-ovidiu&clid=8531463",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "How to Play Obby Draw and Jump"
      },
      {
        "type": "h2",
        "text": "Manage Your Ink Level"
      },
      {
        "type": "h2",
        "text": "Who Created Obby: Draw and Jump?"
      },
      {
        "type": "h2",
        "text": "Can I play Obby: Draw and Jump for free?"
      },
      {
        "type": "h2",
        "text": "What happens when I run out of ink?"
      }
    ],
    "controls": [
      "Computer",
      "WASD: MoveSpace: JumpQ: Toggle drawingE: Toggle ErasingR: Clear AllLeft mouse button: Draw or erase",
      "Mobile",
      "Control movement with the virtual joystick and jump with the jump button.Swipe your finger to draw or erase lines."
    ],
    "howToPlay": "Start by choosing your character and pressing the play button to begin the adventure.\n\nMove your character using the W/A/S/D keys and jump with the spacebar.To toggle drawing mode, press Q, then use the left mouse button (LMB) to sketch objects on the platform.Your character can walk, jump, climb, or stand on the drawings you create.\n\nUse your creativity to draw bridges, pathways, and platforms to navigate the course and outpace other online players.",
    "tips": "",
    "developer": "",
    "similarGames": []
  },
  "fullContent": "Home› PuzzleObby: Draw and JumpBy OnlineGames.ioMake Game Full ScreenObby: Draw and Jump is a fun obstacle course game that puts your creativity and puzzle-solving skills to the test. This free online game is set in a colorful world with Roblox-style characters and combines strategy, action, and artistic flair to create truly unique gameplay. Your mission is to guide your character through a series of intricate obstacle courses by drawing your way to success.Armed with a magical pen, you’ll need to draw bridges, platforms, and pathways to help your character overcome challenges and reach the finish line. But there’s more to it than just drawing! Your pen has limited ink, so you’ll need to think strategically. Erase old drawings to reclaim the ink and keep moving forward. The parkour offers new kinds of challenges in every section, such as navigating mazes, dodging unexpected spikes, avoiding swinging wrecking balls, and running away from enemies chasing after you. These challenges push you to balance creativity with quick decision-making, all while moving your character skillfully in tough spots.Whether you’re exploring solo or competing with friends online, Obby: Draw and Jump offers a clever twist to other draw-the-bridge games, plus the exciting multiplayer action. The game’s vibrant design and engaging mechanics make it perfect for players of all ages.ControlsComputerWASD: MoveSpace: JumpQ: Toggle drawingE: Toggle ErasingR: Clear AllLeft mouse button: Draw or eraseMobileControl movement with the virtual joystick and jump with the jump button.Swipe your finger to draw or erase lines.How to Play Obby Draw and JumpStart by choosing your character and pressing the play button to begin the adventure.Move your character using the W/A/S/D keys and jump with the spacebar.To toggle drawing mode, press Q, then use the left mouse button (LMB) to sketch objects on the platform.Your character can walk, jump, climb, or stand on the drawings you create.Use your creativity to draw bridges, pathways, and platforms to navigate the course and outpace other online players.Manage Your Ink LevelKeep an eye on your ink level as it depletes as you draw. When your ink runs out, you won’t be able to draw anymore unless you erase some of your previous creations to regain ink.To erase specific parts of your drawing, press E and drag the LMB over the lines you want to remove.If you need to clear everything and fill up your ink fully, press the R key or use the clear button.Be strategic with your ink usage, as it’s essential to erase and reclaim ink at key moments to overcome tricky sections of the course.Who Created Obby: Draw and Jump?The game is created by EccentricCan I play Obby: Draw and Jump for free?Yes! You can play Obby: Draw and Jump for free on OnlineGames.io. We partner with advertisers to keep our games free of charge, and we limit the number of ads displayed. To support our platform and continue enjoying high-quality content, please consider disabling your ad blocker.What happens when I run out of ink?You can erase some of your older drawings to regain ink and continue your progress.This article was updated on March 27, 20253DActionArcadeCrazyFreeMobileMultiplayerParkourPhysicsPuzzleRacingRobloxRunning",
  "extractedAt": "2025-06-10T05:04:31.614Z",
  "localThumbnail": "Obby_ Draw and Jump_1749531871614.jpg"
}