{
  "url": "https://www.onlinegames.io/obby-find-sprunki/",
  "title": "Obby: Find Sprunki",
  "category": "/t/adventure/",
  "thumbnail": "https://www.onlinegames.io/media/posts/912/obby-find-sprunki.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/912/obby-find-sprunki.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/912/responsive/obby-find-sprunki-xs.jpg 384w, https://www.onlinegames.io/media/posts/912/responsive/obby-find-sprunki-sm.jpg 600w, https://www.onlinegames.io/media/posts/912/responsive/obby-find-sprunki-md.jpg 768w, https://www.onlinegames.io/media/posts/912/responsive/obby-find-sprunki-lg.jpg 1200w",
    "alt": "Obby Find Sprunki Free Online Game",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://playhop.com/app/382275?utm_source=distrib&is-united-page=1&skip-guard=1&header=no&utm_medium=cristian-ovidiu&clid=8531463",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "What is Sprunki?"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Explore Four Maps"
      },
      {
        "type": "h2",
        "text": "Use Power-Ups to Find All Morphs"
      },
      {
        "type": "h2",
        "text": "More Free Games"
      }
    ],
    "controls": [
      "Computer Controls:",
      "Move with WASD or arrow keys.Look around or rotate the camera with right mouse buttonJump with spacebar."
    ],
    "howToPlay": "",
    "tips": "",
    "developer": "",
    "similarGames": []
  },
  "fullContent": "Home› RobloxObby: Find SprunkiBy OnlineGames.ioMake Game Full ScreenWelcome to Obby: Find Sprunki, where the adventure kicks off with a mission to Track down every Sprunki hidden across the map. Each has its own peculiar charm and, sometimes, a bit of a spooky twist. It's all about exploring, finding, and playing through both bright, happy-go-lucky areas and darker, more mysterious zones where the vibe shifts to something a bit more... eerie.What is Sprunki?Sprunki began as a playful twist in the Incredibox universe, introducing quirky characters that added fun and personality to the popular music-making app. Over time, these charming Sprunks grew into something much bigger. Loved by fans, they now star in their own games, inspire fan fiction, and have undergone a fascinating evolution.What started as lighthearted and whimsical has taken on a darker, more surreal edge, transforming Sprunks into a horror phenomenon almost overnight. Today, you’ll find them featured in posters, games, and various multimedia projects—maybe even movies in the future. Each Sprunk has its own unique vibe, ranging from sunny and cheerful to downright mysterious, making them a captivating part of pop culture.In Obby: Find Sprunki you'll get to know about 40 distinct Sprunks scattered across the map, all while tackling an obstacle course. Run, jump, climb, and meet these quirky characters, collecting them all to complete your Sprunki collection.ControlsComputer Controls:Move with WASD or arrow keys.Look around or rotate the camera with right mouse buttonJump with spacebar.Explore Four MapsThere are four maps in the Obby Find Sprunki game, each having 10 hidden Sprunks. Explore the place, spot the Sprunks, and walk over them to add them to your collection. Maps are as follows.Amusement Park: This is where you'll begin. A vibrant, fun-filled environment with rides, games, and possibly carnival challenges. The charm of the map looks like the first phase of the original Sprunki game.Farm Map: This map introduces a rural setting with farm animals and tractors, windmills and other vehicles. Sprunks can be anywhere; make sure you find them all.Satellite and Space Station: This map features a cosmic theme with satellites, space stations, and perhaps a creepy atmosphere. Encounter eerie, otherworldly elements, E.Ts, and horror vibes. On this map, spotting the Sprunkis is a piece of cake, but reaching that spot is not so. You need to put your obby skills in charge.Football Stadium: This map brings a sports theme into the Obby Find Sprunki. Navigate through a giant stadium, score goals or find Sprunks. It's probably the most difficult map, as Sprunks are hidden very well.Use Power-Ups to Find All MorphsYou can click on the power-up icons on the left side when you are stuck.Radar: Think of it as your hint system. It'll nudge you towards where you might find the next Sprunk.Acceleration: When you need that extra speed to zip through maps faster.Double Jump: Because sometimes, you just need to reach a bit higher.More Free GamesSprunki Obby isn't just about finding characters; it's about diving into a world where each discovery changes how you play and what you feel. From light-hearted fun to spine-chilling mysteries, this game's got it all. Ready to uncover all the secrets and collect all the Sprunks? Let's dive in! And if you're craving for more, just browse the Roblox Games Online and you'll find dozens of Obby games there.This article was updated on March 27, 20251 Player3DAdventureCrazyFreeFunnyParkourRoblox",
  "extractedAt": "2025-06-10T05:07:52.289Z",
  "localThumbnail": "Obby_ Find Sprunki_1749532072290.jpg"
}