{
  "url": "https://www.onlinegames.io/obby-prison-escape/",
  "title": "Obby Prison Escape",
  "category": "/t/action/",
  "thumbnail": "https://www.onlinegames.io/media/posts/863/obby-prison-escape.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/863/obby-prison-escape.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/863/responsive/obby-prison-escape-xs.jpg 384w, https://www.onlinegames.io/media/posts/863/responsive/obby-prison-escape-sm.jpg 600w, https://www.onlinegames.io/media/posts/863/responsive/obby-prison-escape-md.jpg 768w, https://www.onlinegames.io/media/posts/863/responsive/obby-prison-escape-lg.jpg 1200w",
    "alt": "Obby Prison Escape Free Online Game",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://playhop.com/app/327874?utm_source=distrib&is-united-page=1&skip-guard=1&header=no&utm_medium=cristian-ovidiu&clid=8531463",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "How to Play Obby Prison Escape"
      },
      {
        "type": "h2",
        "text": "Customize Avatar"
      },
      {
        "type": "h2",
        "text": "More Parkour Games"
      }
    ],
    "controls": [
      "For PC:",
      "Arrow keys: Move aroundMouse: Look aroundSpace: JumpTab: Open optionsC: Change characterV: Skip stage",
      "On phones:",
      "Use the virtual joystick and on-screen buttons for movement and actions."
    ],
    "howToPlay": "Noob's jailbreak is not just a stroll in the park; it's a full-blown parkour marathon filled with jumps, slides, and maybe even a moonwalk or two (with a bit of exaggeration).Each level is designed with unique obstacles you haven't even seen in Shawshank Redemption. From ventilation shafts to sewage tunnels, you'll find yourself in situations where Noob's agility is the only key to freedom.It's okay if Noob falls over spikes or lava; you can continue from the last checkpoint.Don't forget to collect coins along the way to unlock cooler skins and costumes. After all, Noob can't walk around outside in a prison jumpsuit, right? Grab him a proper pair of jeans and a leather jacket for his big escape.Reach the grand finale by skillfully navigating the Noob on obby. It's not just about getting out; it's about doing it with style. Plus, Barry might wave at you, mistaking your escape for a friendly flyover.",
    "tips": "",
    "developer": "",
    "similarGames": []
  },
  "fullContent": "Home› RobloxObby Prison EscapeBy OnlineGames.ioMake Game Full ScreenWelcome, brave escape artist! Obby Prison Escape is an online parkour game where the world's most secure prison meets the universe's most insecure guard: Barry! Today's the day the prisoner Noob has been waiting for. Barry, the not-so-clever guard of the jail, has taken over the watch. He's more likely to spill his coffee than to notice your escape plan! Noob's mission, should you choose to accept it, involves navigating through a labyrinth of hilarious, hair-raising parkour levels in the prison. Help Noob in the obby breaking away from Barry's prison!ControlsFor PC:Arrow keys: Move aroundMouse: Look aroundSpace: JumpTab: Open optionsC: Change characterV: Skip stageOn phones:Use the virtual joystick and on-screen buttons for movement and actions.How to Play Obby Prison EscapeNoob's jailbreak is not just a stroll in the park; it's a full-blown parkour marathon filled with jumps, slides, and maybe even a moonwalk or two (with a bit of exaggeration).Each level is designed with unique obstacles you haven't even seen in Shawshank Redemption. From ventilation shafts to sewage tunnels, you'll find yourself in situations where Noob's agility is the only key to freedom.It's okay if Noob falls over spikes or lava; you can continue from the last checkpoint.Don't forget to collect coins along the way to unlock cooler skins and costumes. After all, Noob can't walk around outside in a prison jumpsuit, right? Grab him a proper pair of jeans and a leather jacket for his big escape.Reach the grand finale by skillfully navigating the Noob on obby. It's not just about getting out; it's about doing it with style. Plus, Barry might wave at you, mistaking your escape for a friendly flyover.Customize AvatarAs you collect coins, why not jazz up your avatar? You can customize Noob's body part an save him from being such a noob guy!Body: From beefy to breezy, get the physique that screams \"I can outrun Barry!\"Clothes: Dress to impress or to camouflage. Want to blend in with the prison walls? There's a brick suit for that. Or dress up as a prison guard instead.Hairstyle & Hair Color: Whether you're going for the 'just escaped' look or the 'I've been planning this for years', your hair can reflect your escape strategy.Face: Customize Noob's expression for that perfect escape photo. After all, you might want to look good for the newspaper when they report your escape.More Parkour GamesObby Prison Escape is a Roblox-like game that allows you to customize, jump, slide, and fly your way out of Barry's Prison. If you'd like to play a similar parkour game, Only Up Obby might get your attention!This article was updated on December 26, 20243DActionArcadeCrazyEscapeFreeFunnyMobileParkourPhysicsRoblox",
  "extractedAt": "2025-06-10T04:13:32.467Z",
  "localThumbnail": "Obby Prison Escape_1749528812467.jpg"
}