{
  "url": "https://www.onlinegames.io/obby-find-100-cats/",
  "title": "Obby: Find 100 Cats",
  "category": "/t/adventure/",
  "thumbnail": "https://www.onlinegames.io/media/posts/865/obby-find-100-cats-game.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/865/obby-find-100-cats-game.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/865/responsive/obby-find-100-cats-game-xs.jpg 384w, https://www.onlinegames.io/media/posts/865/responsive/obby-find-100-cats-game-sm.jpg 600w, https://www.onlinegames.io/media/posts/865/responsive/obby-find-100-cats-game-md.jpg 768w, https://www.onlinegames.io/media/posts/865/responsive/obby-find-100-cats-game-lg.jpg 1200w",
    "alt": "Obby Find 100 Cats Free Online Game",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://playhop.com/app/374776?utm_source=distrib&is-united-page=1&skip-guard=1&header=no&utm_medium=cristian-ovidiu&clid=8531463",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "How to Play Obby: Find 100 Cats"
      },
      {
        "type": "h2",
        "text": "The Tail End of the Cat Rescue"
      }
    ],
    "controls": [
      "Move: WASDJump: SpacebarRun: Left shiftLook Around: Right-Click"
    ],
    "howToPlay": "Explore 10 maps, each a playground filled with nooks, crannies, and clever hiding spots for 10 cats. Think you've got a cat's eye for detail? Prove it!Use arrow keys or WASD to move, Space to jump, and Shift to sprint. You can collect a cat by simply walking over the cat. Don't forget to swivel that camera! Right-click on PC or use the camera swipe on mobile to look around corners and under ledges.Keep track of your feline finds with the 'Cats' button at the top left corner. See which cats you've collected and how many are left to discover. Chubby, Snowy, Gloomy and Lazy are the common ones you can spot easily. But what about the rare ones hiding in most unthinkable places?You can switch between maps by walking or using the 'Maps' button. Each map offers new challenges and scenery, such as a temple, castle, beach, Christmas scenery, a desert maze and many more!If you're stuck or just want to get a better top-down view, hit the 'Jump' button to teleport to the top of the map.Feel like you're close but no cigar? Use the 'Radar' button to see if you're near a hidden cat. Follow your whiskers!",
    "tips": "",
    "developer": "",
    "similarGames": []
  },
  "fullContent": "Home› RobloxObby: Find 100 CatsBy OnlineGames.ioMake Game Full ScreenHave you heard of the Cat Distribution System before? The Cat Distribution System (CDS) is a mystical way cats find their humans. When the universe is convinced you're a good and caring person and the time is right, it rewards you with a stray cat. It's like a cosmic matchmaking service. Cats might unexpectedly hitch a ride in your car, appear in your garden, or even pop out from your shopping bag. They could show up at your doorstep, trail you home, or simply decide you're the one while at a shelter. The system is famously unpredictable, almost as if it has a mind of its own.Obby: Find 100 Cats is a purr-fectly crafted 3D adventure game where the Cat Distribution System literally fails. Normally, cats have a penchant for finding the best hiding spots, but in this game, something feels amiss. The magical system, matchmaking cats with humans, has gone haywire. Instead of those playful hide-and-seeks, cats are stuck in trees, trapped on roofs, or locked in rooms due to this cosmic glitch. Your mission is to locate and rescue all 100 of these misplaced felines spread across ten vividly themed maps. That's the only way to restore order to the universe's feline distribution. Each map is a puzzle of adorable hideaways and clever concealments. Find every last cat, using your wits and perhaps a bit of luck. Complete your task and set your cats free to choose their true, forever homes.ControlsMove: WASDJump: SpacebarRun: Left shiftLook Around: Right-ClickHow to Play Obby: Find 100 CatsExplore 10 maps, each a playground filled with nooks, crannies, and clever hiding spots for 10 cats. Think you've got a cat's eye for detail? Prove it!Use arrow keys or WASD to move, Space to jump, and Shift to sprint. You can collect a cat by simply walking over the cat. Don't forget to swivel that camera! Right-click on PC or use the camera swipe on mobile to look around corners and under ledges.Keep track of your feline finds with the 'Cats' button at the top left corner. See which cats you've collected and how many are left to discover. Chubby, Snowy, Gloomy and Lazy are the common ones you can spot easily. But what about the rare ones hiding in most unthinkable places?You can switch between maps by walking or using the 'Maps' button. Each map offers new challenges and scenery, such as a temple, castle, beach, Christmas scenery, a desert maze and many more!If you're stuck or just want to get a better top-down view, hit the 'Jump' button to teleport to the top of the map.Feel like you're close but no cigar? Use the 'Radar' button to see if you're near a hidden cat. Follow your whiskers!The Tail End of the Cat RescueAre you ready to comb through every inch of these maps to collect all 100 cats? The challenge is set, the cats are hidden – let the great cat hunt begin! Remember, in Obby: Find 100 Cats, every kitty counts! And, if you'd like to play more kitty adventures, we've got you covered. Head over to the cat games online page to find purrfect feline games, including Cat Simulators, where you get to be the cat itself. Have fun!This article was updated on December 26, 20241 Player3DAdventureAnimalCatCrazyFreeFunnyKidsMobileParkourPetRoblox",
  "extractedAt": "2025-06-10T05:07:34.733Z",
  "localThumbnail": "Obby_ Find 100 Cats_1749532054733.jpg"
}