{
  "url": "https://www.onlinegames.io/offroad-rally/",
  "title": "Offroad Rally",
  "category": "/t/car/",
  "thumbnail": "https://www.onlinegames.io/media/posts/461/Offroad-Rally.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/461/Offroad-Rally.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/461/responsive/Offroad-Rally-xs.jpg 384w, https://www.onlinegames.io/media/posts/461/responsive/Offroad-Rally-sm.jpg 600w, https://www.onlinegames.io/media/posts/461/responsive/Offroad-Rally-md.jpg 768w, https://www.onlinegames.io/media/posts/461/responsive/Offroad-Rally-lg.jpg 1200w",
    "alt": "Offroad Rally Online",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2023/unity2/offroad-rally/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "How to Play Offroad Rally"
      },
      {
        "type": "h3",
        "text": "Offroad Track"
      },
      {
        "type": "h3",
        "text": "Using the Truck's Nitro"
      },
      {
        "type": "h3",
        "text": "Collecting Blue F Coins"
      },
      {
        "type": "h3",
        "text": "Upgrading Your Truck"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Explore More Games"
      }
    ],
    "controls": [
      "WASD or the Arrow keys to steer the truck.Left shift key to boost speedR key to reset the carC key to change the camera view"
    ],
    "howToPlay": "If you want to be first in Offroad Rally, all you need to do is know where to stop, how to avoid obstacles, where to accelerate and where to slow down. If you don't know these things, even if you drive the fastest car, it's in vain. Overcome obstacles and be the first to reach the finish line.",
    "tips": "",
    "developer": "",
    "similarGames": []
  },
  "fullContent": "Home› RacingOffroad RallyBy OnlineGames.ioMake Game Full Screen This will be a bit of a muddy race! Prepare yourself for this! Offroad Rally is a 3D racing game where you race on an off-road racetrack full of bumps with driftwood and mud. Your ability to maneuver against these obstacles will be tested. Even the smallest piece of wood can put you in last place in the race. You should avoid them.How to Play Offroad RallyIf you want to be first in Offroad Rally, all you need to do is know where to stop, how to avoid obstacles, where to accelerate and where to slow down. If you don't know these things, even if you drive the fastest car, it's in vain. Overcome obstacles and be the first to reach the finish line.Offroad TrackThere is no straight road here! In this racing area, you will encounter a lot of soil, rocks, wood pieces and similar obstacles. If you don't overcome these wisely, you will have difficulty finishing the race first.Using the Truck's NitroYou will see a lightning bolt icon on the left side of the screen. The nitro is fully charged and ready to use when this area is entirely turquoise. You can use this nitro by pressing the left shift key during the race and get ahead of your competitors.Collecting Blue F CoinsAlong the track, you will see blue coins with F written on them. You can save money by collecting them and winning races, and with this money, you can strengthen your existing truck or buy new ones.Upgrading Your TruckYou can increase your vehicle's power by going to the garage section of the menu. You can change the wheels of your vehicle so that it can stand on the ground more firmly. Or you can have front protection installed to avoid collisions with minimal damage. Options for installing chimneys and top protection on your vehicle are available here.ControlsWASD or the Arrow keys to steer the truck.Left shift key to boost speedR key to reset the carC key to change the camera viewExplore More GamesIf playing Offroad Rally excites you, you should definitely try Monster Truck Dirt Rally. This is a game in which you are driving monster cars in mud. Or you can look for other racing game alternatives on OnlineGames.io by following the link.Embed URL:https://www.onlinegames.io/games/2023/unity2/offroad-rally/index.htmlThis article was updated on December 20, 20233DCarDrivingEmbeddableFreeRacingRallyUnity",
  "extractedAt": "2025-06-10T05:29:33.278Z",
  "localThumbnail": "Offroad Rally_1749533373277.jpg"
}