{
  "url": "https://www.onlinegames.io/only-up-obby/",
  "title": "Only Up Obby",
  "category": "/t/action/",
  "thumbnail": "https://www.onlinegames.io/media/posts/859/Only-Up-Obby.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/859/Only-Up-Obby.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/859/responsive/Only-Up-Obby-xs.jpg 384w, https://www.onlinegames.io/media/posts/859/responsive/Only-Up-Obby-sm.jpg 600w, https://www.onlinegames.io/media/posts/859/responsive/Only-Up-Obby-md.jpg 768w, https://www.onlinegames.io/media/posts/859/responsive/Only-Up-Obby-lg.jpg 1200w",
    "alt": "Only Up Obby Free Online Game",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://playhop.com/app/335573?utm_source=distrib&is-united-page=1&skip-guard=1&header=no&utm_medium=cristian-ovidiu&clid=8531463",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "How to Play Only Up Obby"
      },
      {
        "type": "h3",
        "text": "Parkour"
      },
      {
        "type": "h3",
        "text": "Colorful Floor"
      },
      {
        "type": "h3",
        "text": "Glass Bridge"
      },
      {
        "type": "h3",
        "text": "Falling Plates"
      },
      {
        "type": "h3",
        "text": "Rain of Blocks"
      },
      {
        "type": "h2",
        "text": "More Parkour Games"
      }
    ],
    "controls": [
      "Desktop:",
      "Move: WASDJump: SpacebarCamera: Move Mouse",
      "Smartphone:",
      "Move: Use the joystick on the left side of the screenJump: Press the button on the bottom right of the screenCamera: Move your finger on the right side of the screen"
    ],
    "howToPlay": "You'll begin in the town's square. Each building represents a mini game. Enter a door you like and start guiding your blocky avatar on his adventures up in sky. Use WASD keys to move and space to jump. Finish the race at first and collect coins. You have several mini game options with unique mechanics.",
    "tips": "",
    "developer": "",
    "similarGames": []
  },
  "fullContent": "Home› RobloxOnly Up ObbyBy OnlineGames.ioMake Game Full ScreenOnly Up Obby is a parkour game that is playable on your browser. The goal is not just surviving the whims of the Roblox-like universe but also outmaneuvering other players. You can guide your character on various obby paths (obstacle courses)  such as parkour, colorful floor, glass bridge and others. Each mode brings a mix of fun and daring challenges! Don't look down!ControlsDesktop:Move: WASDJump: SpacebarCamera: Move MouseSmartphone:Move: Use the joystick on the left side of the screenJump: Press the button on the bottom right of the screenCamera: Move your finger on the right side of the screenHow to Play Only Up ObbyYou'll begin in the town's square. Each building represents a mini game. Enter a door you like and start guiding your blocky avatar on his adventures up in sky. Use WASD keys to move and space to jump. Finish the race at first and collect coins. You have several mini game options with unique mechanics.ParkourImagine you're an acrobat and you're not just navigating; you're dancing with danger, a ballet of near misses and triumphant leaps. Sounds like a recipe for both frustration and exhilaration. Colorful levels where you go only up might be the game you're looking for when you're away from your Roblox-installed phone.Colorful FloorBegin the race with 29 other players in front of colorful tiles. Your goal is to step on tiles whose color is displayed at the top of the screen. As soon as the color changes, you must find another tile matching the color on the top. Otherwise, you're out of the game. Winning the race is not just finding a tile to step on but moving forward to finish the course. This mode turns the game into a visual disco where the floor is indeed lava, but only if it's the wrong color. It's like playing musical chairs, but if the music was colors, and the chairs were colorful tiles.Glass BridgeHere's where your existential dread meets probability. In Glass Bridge mode you need to choose which glass tile to jump on, but one will break, and the other will remain. You're not just playing; you're living out a scene from \"Squid Game\". Choose wisely, or face the humiliation of falling into the void of your own misjudgment.Falling PlatesFalling Plates mode of Only Up Obby is an unlockable mini-game where you have to run to the finish course on a platform up in the sky. Here is the twist: the plates you've already run on will fall down and disappear after a second. So, be careful. Each step is a commitment, a testament to your belief in your timing. It's less about physical prowess and more about your inner clock.Rain of BlocksYou must evolve into some sort of block-dodging ninja because it's raining blocks! The universe is testing you, not just with static challenges but with dynamic chaos. Finish the course without getting crushed by a block!More Parkour GamesIf you're enjoying parkour challenges, you might also like LOLBeans.io! You'll chuckle at how bizarre the beans look while trying to dodge obstacles in Wipe Out themed whimsical tracks!This article was updated on December 26, 20243DActionArcadeCrazyFreeMobileMultiplayerParkourPhysicsRacingRobloxRunning",
  "extractedAt": "2025-06-10T04:13:58.282Z",
  "localThumbnail": "Only Up Obby_1749528838283.jpg"
}