{
  "url": "https://www.onlinegames.io/only-up-or-lava/",
  "title": "Only Up or Lava",
  "category": "/t/adventure/",
  "thumbnail": "https://www.onlinegames.io/media/posts/632/Only-Up-or-Lava.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/632/Only-Up-or-Lava.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/632/responsive/Only-Up-or-Lava-xs.jpg 384w, https://www.onlinegames.io/media/posts/632/responsive/Only-Up-or-Lava-sm.jpg 600w, https://www.onlinegames.io/media/posts/632/responsive/Only-Up-or-Lava-md.jpg 768w, https://www.onlinegames.io/media/posts/632/responsive/Only-Up-or-Lava-lg.jpg 1200w",
    "alt": "Only Up or Lava Free Online Game",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://html5.gamedistribution.com/143e242bf7e54207be681d38d01dd7c7/?gd_sdk_referrer_url=https://www.onlinegames.io/only-up-or-lava",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "How to Only Up or Lava"
      },
      {
        "type": "h3",
        "text": "Don't Rush"
      },
      {
        "type": "h3",
        "text": "Diverse Platforms"
      },
      {
        "type": "h3",
        "text": "Climb Up the Barriers"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "Explore Other Games"
      }
    ],
    "controls": [
      "WASD or the Arrow Keys: MoveSpace Key: Jump/ClimbShift Key: Walk/Drop to LedgeR Key: Pause/Game Menu"
    ],
    "howToPlay": "",
    "tips": "",
    "developer": "Only Up or Lava was developed by Nexus.",
    "similarGames": []
  },
  "fullContent": "Home› ParkourOnly Up or LavaBy OnlineGames.ioMake Game Full ScreenOnly Up or Lava is a challenging arcade game where you move your character on various platforms, such as furniture items. You have to perform perfect jumps to avoid falling into the lava. Overcome each challenge one by one and reach the final gate. Every level comes with unique difficulties in this one of the most exciting parkour games.🌋How to Only Up or LavaYou are going on a very compelling adventure. You will encounter many obstacles while trying to avoid falling into the lava. You will see many platforms on the parkour. It could be a chair or an upside-down door. You must perform precise jumpings on these items to access the final gate. Otherwise, you lose the game by falling into the liquid. As you progress and go to the next level, you will face more complex hazards.Don't RushIf you rush, you won't get very far in this game. You must calculate every movement of your character to pass the obstacles individually. Move forward slowly but surely. The most essential key to achieving success is to master precise jumpings. When you jump, you must land in the middle of the platforms.Diverse PlatformsThere are many kinds of platforms in parkour. They will enable you to go to the final point. Use them as stair treads to pass the boiling liquid. Take your time. Find the most appropriate location to move to. From time to time, you will also see jumping platforms. These are platforms that will throw you very high. You must direct your character well while you are in the air so that you do not dive into the lava.Climb Up the BarriersYou are wrong if you think the barriers you will encounter will be straight. They will be in different positions. There is a great chance you will come across many chairs or doors lying on their sides. Your character may not land right in the middle of one of them. You can try to grasp them from one end. Then, attempt to get to a proper place by climbing.ControlsWASD or the Arrow Keys: MoveSpace Key: Jump/ClimbShift Key: Walk/Drop to LedgeR Key: Pause/Game MenuDeveloperOnly Up or Lava was developed by Nexus.Explore Other GamesYou may also try Only Up Parkour if you are an Only Up or Lava fan. After an apocalypse, many things, like pipes and houses, hung in the air. Start climbing on them to reach to the top to solve the mystery of this apocalypse!For further options, you may look up other online parkour games on OnlineGames.io by following the link. If you stay tuned, you will always find something new and thrilling on the site!This article was updated on February 6, 20241 Player3DAdventureArcadeCrazyFreeParkourRunningUnity",
  "extractedAt": "2025-06-10T05:08:00.327Z",
  "localThumbnail": "Only Up or Lava_1749532080328.jpg"
}