{
  "url": "https://www.onlinegames.io/pacxon-new-realms/",
  "title": "PacXon New Realms",
  "category": "/t/arcade/",
  "thumbnail": "https://www.onlinegames.io/media/posts/1014/PaxCon-New-REalms.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/1014/PaxCon-New-REalms.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/1014/responsive/PaxCon-New-REalms-xs.jpg 384w, https://www.onlinegames.io/media/posts/1014/responsive/PaxCon-New-REalms-sm.jpg 600w, https://www.onlinegames.io/media/posts/1014/responsive/PaxCon-New-REalms-md.jpg 768w, https://www.onlinegames.io/media/posts/1014/responsive/PaxCon-New-REalms-lg.jpg 1200w",
    "alt": "PacXon New Realms",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://html5.gamedistribution.com/727e29ac2f7a40e69a17dc7ff7f4c306/?gd_sdk_referrer_url=https://www.onlinegames.io/pacxon-new-realms/",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "What is PacXon?"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "How to Play PacXon: New Realms"
      },
      {
        "type": "h2",
        "text": "Types of Enemies"
      },
      {
        "type": "h2",
        "text": "Grab Power-Ups"
      },
      {
        "type": "h2",
        "text": "PacXon New Realms Features"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h3",
        "text": "What to Play Next?"
      }
    ],
    "controls": [
      "Arrow keys/ drag mouse: Move PacXon in four directionsMouse swipe: For touchscreen and drag-based input"
    ],
    "howToPlay": "Your goal is to capture at least 80% of the field to move on. Yellow dots are shared open spaces, and orange dots are your territory. At the beginning of the level, all four sides are yours. You will run over open space to create a wall trail and loop back to a captured area to close the trail and claim that section. Then, it will turn into orange dots, marking your territory.\n\nIf an enemy touches you or your trail before you finish the loop, you lose a life. Keep track of your lives on the bottom left. Keep an eye on the progress bar at the top to know how close you are to finishing the level.",
    "tips": "",
    "developer": "PacXon: New Realms is the official sequel to the beloved PacXon Deluxe. This upgraded version brings back the old-school challenge with a fresh look. It's distributed by Azerion Casual Games. You can play it online for free now at OnlineGames.io.",
    "similarGames": []
  },
  "fullContent": "Home› ArcadePacXon New RealmsBy OnlineGames.ioMake Game Full ScreenRemember Paxcon? The classic wall-closing puzzle from the 2000s?.If the answer is a big yes, the wait is over my friend, because PacXon: New Realms is here now. And it's out and bolder than ever. In this sequel to arcade classic PacXon Deluxe, with a full-on expansion loaded with new realms, enemies, skins, and power-ups, you'll get that pixelated fun with a modern twist.Conquer by drawing walls, dodge tricky mines, and carve out territory with style. It's part strategy, part action, and all satisfying (especially when you trap those pesky enemies in a corner and watch the progress bar tick up to 80%.) In case you're new to world of PacXon, here’s a quick Arcade 101 refresher:What is PacXon?PacXon (sometimes written as Pac-Xon) is a fun arcade-style puzzle game that mixes mechanics from classic games like Pac-Man and Xonix. In this fun game, you play as Pacxon, a little PacMan-like character, but instead of eating dots, your goal is to fill up the screen by building walls. As you move, Pacxon leaves a trail behind him. If you can successfully close off a section of the screen, that area becomes filled in. The goal is to fill at least 80% of the screen to complete the level. PacXon was originally a Flash game released in 2007, but 18 years later, an HTML5 version was published so it can be played online without plugins.ControlsArrow keys/ drag mouse: Move PacXon in four directionsMouse swipe: For touchscreen and drag-based inputHow to Play PacXon: New RealmsYour goal is to capture at least 80% of the field to move on. Yellow dots are shared open spaces, and orange dots are your territory. At the beginning of the level, all four sides are yours. You will run over open space to create a wall trail and loop back to a captured area to close the trail and claim that section. Then, it will turn into orange dots, marking your territory.If an enemy touches you or your trail before you finish the loop, you lose a life. Keep track of your lives on the bottom left. Keep an eye on the progress bar at the top to know how close you are to finishing the level.Types of EnemiesEach level features ghostly enemies with different movement patterns. You'll need to study their patterns and strike at the right moment to grab territory without losing lives.Blue enemies: Move diagonally in captured zones.Pink enemies: Move diagonally in open space.Red enemies: The most aggressive: they move diagonally and destroy the walls you've built.Grab Power-UpsCollect sweet treats on the map for powerful boosts:🍬 (Candy): Eat enemies temporarily🍩 (Donut): Speed boost🍰 (Cake): Enemies move slower🧁 (Cupcake): Enemies freeze for a short timePacXon New Realms Features192 handcrafted levels across 4 distinct environmentsRevamped UI with cleaner menus and game flowPixel-style visuals with adorable animationsNew soundtrack with upbeat tunes for every zoneCharacter skins to unlock: 4 to 6 per world!Enemies with unique AI patternsPlayable on desktop or mobile with intuitive controlsDeveloperPacXon: New Realms is the official sequel to the beloved PacXon Deluxe. This upgraded version brings back the old-school challenge with a fresh look. It's distributed by Azerion Casual Games. You can play it online for free now at OnlineGames.io.What to Play Next?Love the blend of retro vibes and quick reactions? Try Pac-Man 30th Anniversary. It's a faithful tribute to the dot-munching, ghost-dodging original, now updated for browser play. It's perfect for fans of maze strategies and classic tension. Google PacMan is a full-blown pixel quest that's equal parts nostalgic and new. Play now!This article was updated on May 23, 20251 Player2DArcadeAvoidFreeFunHTML5MobilePixel",
  "extractedAt": "2025-06-10T05:12:43.223Z",
  "localThumbnail": "PacXon New Realms_1749532363223.jpg"
}