{
  "url": "https://www.onlinegames.io/papa-louie/",
  "title": "Papa Louie",
  "category": "/t/adventure/",
  "thumbnail": "https://www.onlinegames.io/media/posts/783/Papa-Louie.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/783/Papa-Louie.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/783/responsive/Papa-Louie-xs.jpg 384w, https://www.onlinegames.io/media/posts/783/responsive/Papa-Louie-sm.jpg 600w, https://www.onlinegames.io/media/posts/783/responsive/Papa-Louie-md.jpg 768w, https://www.onlinegames.io/media/posts/783/responsive/Papa-Louie-lg.jpg 1200w",
    "alt": "Papa Louie Play Online",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2024/flash2/papa-louie/",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "The Story of Papa Louie: When Pizzas Attack!"
      },
      {
        "type": "h2",
        "text": "How to Play Papa Louie: When Pizzas Attack"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "More Games Like These"
      }
    ],
    "controls": [
      "Move Left: Left ArrowMove Right: Right ArrowClimb: Up ArrowDown/Pick Up: Down ArrowSwing Paddle: ZThrow Bombs: XCheck Bonus: BPause: Enter"
    ],
    "howToPlay": "Start the first level, move Louie by pressing the arrow keys, and jump by the spacebar. Do not touch any monsters on the way, as you have only 5 lives to complete a level.Your mission is to save the customers at the end of each level. To do that, you need to defeat pizza monsters and box them up.You can swing the paddle and knock down regular ingredient creatures such as onions and tomatoes. However, paddles will not work for cheesy monsters.To defeat cheese monsters, throw a pepper bomb or hit cheese wads back at monsters. After defeating them, they melt into the pizza box. Press down the key to pick up the boxes.You can collect pepper bombs on the platform or buy one for 10 coins in the main menu.\n\nWhen you collect all the boxes in a level, bring them with you to the pulley system. Pizzas weigh the platform down, and rescue kidnapped customers from the cage. Good luck!",
    "tips": "",
    "developer": "Flipline Studios developed Papa Louie: When Pizzas Attack!.\n",
    "similarGames": []
  },
  "fullContent": "Home› ArcadePapa LouieBy OnlineGames.ioMake Game Full ScreenPapa Louie is an action platformer game where a pizza chef defeats cheesy monsters and collects pizza boxes to save his customers. Embark on this journey and evoke the nostalgia of epic Flash games on OnlineGames.io! Learn the story of Papa Louie and how to play below.ControlsMove Left: Left ArrowMove Right: Right ArrowClimb: Up ArrowDown/Pick Up: Down ArrowSwing Paddle: ZThrow Bombs: XCheck Bonus: BPause: EnterThe Story of Papa Louie: When Pizzas Attack!Papa Louie is a passionate chef who owns a small pizzeria. On what seemed like an ordinary day, Papa Louie decided to give free pizzas to every tenant in the building. He was busy preparing pizzas for delivery.Something unexpected happened as he added a special spice to the pizzas for a final touch: The pizza dough underwent a strange mutation, transforming into a cheesy monster.Unrevealed to Papa Louie, every pizza he had made that day turned into a monster. The bad news is that some of these mutant pizzas had already been delivered hours ago!Papa Louie soon discovered that these pizza monsters had kidnapped his customers and taken them to a place known as Munchmore World. In this quirky world, all the ingredients—including onions, tomatoes, and peppers—had also mutated into little monsters, each on the hunt for their next victim.Papa Louie felt responsible for the chaos he caused. This led him to make a daring decision to rescue all his customers one by one. With his friend's help, he'll embark on a journey in Munchmore World, battling with the mutated ingredients to save his loyal customers. Navigate Papa through a dangerous world in his daring mission. Learn how to play Papa Louie When Pizzas Attack below!How to Play Papa Louie: When Pizzas AttackStart the first level, move Louie by pressing the arrow keys, and jump by the spacebar. Do not touch any monsters on the way, as you have only 5 lives to complete a level.Your mission is to save the customers at the end of each level. To do that, you need to defeat pizza monsters and box them up.You can swing the paddle and knock down regular ingredient creatures such as onions and tomatoes. However, paddles will not work for cheesy monsters.To defeat cheese monsters, throw a pepper bomb or hit cheese wads back at monsters. After defeating them, they melt into the pizza box. Press down the key to pick up the boxes.You can collect pepper bombs on the platform or buy one for 10 coins in the main menu.When you collect all the boxes in a level, bring them with you to the pulley system. Pizzas weigh the platform down, and rescue kidnapped customers from the cage. Good luck!DeveloperFlipline Studios developed Papa Louie: When Pizzas Attack!. More Games Like TheseIf you like Papa Louie, go on an adventure as a delivery man at Paolo's Pizzeria. Ride on bumpy roads to deliver your orders to customers who are shouting, \"Where's my Pizza?\"Take a look at the page to view all free adventure games on OnlineGames.io!This article was updated on July 8, 20241 Player2DAdventureArcadeAvoidCrazyEscapeFlashFreeFunFunny",
  "extractedAt": "2025-06-10T05:12:02.246Z",
  "localThumbnail": "Papa Louie_1749532322245.jpg"
}