{
  "url": "https://www.onlinegames.io/paper-planets/",
  "title": "Paper Planets",
  "category": "/t/io-games/",
  "thumbnail": "https://www.onlinegames.io/media/posts/964/Paper-Planets.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/964/Paper-Planets.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/964/responsive/Paper-Planets-xs.jpg 384w, https://www.onlinegames.io/media/posts/964/responsive/Paper-Planets-sm.jpg 600w, https://www.onlinegames.io/media/posts/964/responsive/Paper-Planets-md.jpg 768w, https://www.onlinegames.io/media/posts/964/responsive/Paper-Planets-lg.jpg 1200w",
    "alt": "Paper Planets Free Online Game",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://cloud.onlinegames.io/games/2023/unity3/paper-planets/index-og.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "How to Play Paper Planets"
      },
      {
        "type": "h3",
        "text": "Basics of the Paper Planets"
      },
      {
        "type": "h3",
        "text": "Establish Your Paper Kingdom"
      },
      {
        "type": "h3",
        "text": "Guard Your Tail"
      },
      {
        "type": "h3",
        "text": "Do Not Swallow Your Tail"
      },
      {
        "type": "h2",
        "text": "Explore Other IO Games"
      }
    ],
    "controls": [
      "To move your planet, use the WASD keys or the arrow keys.You can also use your mouse cursor to navigate the planet.Use your touchscreen to steer the planet on your mobile."
    ],
    "howToPlay": "First, you will need a unique name to play the game. Insert your nickname into the empty box on the main menu. Now, you are ready to get your territory by drawing lines and establishing the area. You will have a small planet. Master navigating your planet and establish your kingdom by drawing lines. You must get back to your starting point to claim your territory.",
    "tips": "",
    "developer": "",
    "similarGames": []
  },
  "fullContent": "Home› io GamesPaper PlanetsBy OnlineGames.ioMake Game Full Screen Paper Planets is an IO game where you, as a colorful cube, try to establish your territory as much as possible by sliding on the playing field. There will also be many players near you. And they are also trying to conquer their land. Avoid running into other planets while orbiting in the arena. If they bite your tail, you are done for sure! Enjoy this popular IO game to the fullest.ControlsTo move your planet, use the WASD keys or the arrow keys.You can also use your mouse cursor to navigate the planet.Use your touchscreen to steer the planet on your mobile.How to Play Paper PlanetsFirst, you will need a unique name to play the game. Insert your nickname into the empty box on the main menu. Now, you are ready to get your territory by drawing lines and establishing the area. You will have a small planet. Master navigating your planet and establish your kingdom by drawing lines. You must get back to your starting point to claim your territory.Basics of the Paper PlanetsYou must circle back to your starting point to claim your territory.Conquering more areas is the key to getting the highest score in the game.When you eliminate rivals, their territory disappears automatically.Do not let other players bite your tail, or you will be eliminated.When you get the chance, catch your rivals' tails to wipe them out.Also, you should not bite your tail. Or else you will take your own life.You can change your controls in the settings section from the menu.Establish Your Paper KingdomUse your mouse to direct your square. You must determine your area. Your planet will leave traces as it is moving. Mark your territory by returning your starting point. A pro tip from us: move cautiously without going too far in the beginning, as you will be open to attacks from other squares.Guard Your TailWhen a square touches your tail, you will fail the game. So, give weight to not expose your tail too long outside your land. But, likewise, when you catch an enemy whose tail is out, use your chance to eliminate him from the playing field.Do Not Swallow Your TailAs other players can catch your tail, you may also accidentally swallow your own! Biting your tail will cause you to lose the game. Therefore, we recommend that you do not let this happen. Do not swallow your tail!Explore Other IO GamesIf you enjoy playing Paper Planets IO, you may also like WormsZone.io. Try to get as big as possible by defeating other worms and eating their food in the game. When your worm gets big, it is much easier to kill the rivals. The greater the worm's weight, the greater the reward. For further options, look up the io Games tag on OnlineGames.io by following the link. You will always find new and thrilling games if you stay tuned!This article was updated on March 17, 20253DArenaAvoidColorDrawingFreeFunio GamesMobileMouseSnakeUnity",
  "extractedAt": "2025-06-10T05:32:06.438Z",
  "localThumbnail": "Paper Planets_1749533526439.jpg"
}