{
  "url": "https://www.onlinegames.io/parkour-block-3d/",
  "title": "Parkour Block 3D",
  "category": "/t/adventure/",
  "thumbnail": "https://www.onlinegames.io/media/posts/703/Parkour-Block.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/703/Parkour-Block.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/703/responsive/Parkour-Block-xs.jpg 384w, https://www.onlinegames.io/media/posts/703/responsive/Parkour-Block-sm.jpg 600w, https://www.onlinegames.io/media/posts/703/responsive/Parkour-Block-md.jpg 768w, https://www.onlinegames.io/media/posts/703/responsive/Parkour-Block-lg.jpg 1200w",
    "alt": "Parkour Block Online Game",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://html5.gamedistribution.com/1461d40bb77f48e6be72489959a1ac04/?gd_sdk_referrer_url=https://www.onlinegames.io/parkour-block-3d",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Overview of Parkour Block 3D"
      },
      {
        "type": "h3",
        "text": "The Purple Portal"
      },
      {
        "type": "h3",
        "text": "Slippery Platforms"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "What is More?"
      }
    ],
    "controls": [
      "Desktops and Laptops",
      "Mouse: Look AroundWASD or Arrow Keys: MoveSpacebar: JumpDouble ESC: MenuLeft-Shift: Run",
      "Mobile Devices",
      "Use the virtual joystick and button on the touchscreen to move and jump."
    ],
    "howToPlay": "",
    "tips": "",
    "developer": "Poly Games developed Parkour Block 3D.",
    "similarGames": []
  },
  "fullContent": "Home› ParkourParkour Block 3DBy OnlineGames.ioMake Game Full ScreenThe floor is lava! Parkour Block 3D is an arcade game where you strive to steer your character on platforms to reach the purple portal. Beneath these platforms is a sea of ​​lava. If you slip and fall from the bricks, you will lose your life!You can't let your character drown in lava. To prevent this, you must move cautiously. Try to pass 35 challenging levels and win in this parkour game, which is similar to Only Up or Lava!Overview of Parkour Block 3DYou will be in a Minecraft world when you enter this arcade game.There will be many bricks and stones of various sizes and heights.Your main objective is to pass these platforms by jumping without falling into the lava sea.Your final destination is the purple portal at the end of the route.Reaching the purple point won't be easy. You will direct your character in a first-person view.Defining your position will be challenging because of the view. If you fail precise jumping, you will find yourself in the beginning.Move forward step by step and try to overcome all 35 levels!The Purple PortalBefore you start moving on the platforms, we recommend that you observe the route towards the portal. You will see a huge purple platform at the end of the parkour. No matter what, you must reach that point to pass each level.After overcoming all the brick platforms, jump into this purple point. If you get here as quickly as possible with the fewest attempts, you get three stars. If you slide off one of the platforms, you can end up in lava.Slippery PlatformsThe biggest hardship of this physics game is the slippery platforms. It is one thing to manage to jump on one of the platforms right in the middle, and it is another to land on platforms without slipping.If you move forward with excessive speed, your character can slip away, causing you to fall into the lava. You must find the appropriate speed to run and jump. To make precise jumps, you can use your character's hand to give him proper direction.ControlsDesktops and LaptopsMouse: Look AroundWASD or Arrow Keys: MoveSpacebar: JumpDouble ESC: MenuLeft-Shift: RunMobile DevicesUse the virtual joystick and button on the touchscreen to move and jump.DeveloperPoly Games developed Parkour Block 3D.What is More?Only Up Parkour may also interest you. Jump on boxes, pipes, containers, and cars to climb to the top in the game. All these objects have been hung up in the air after an apocalypse. Let's see if you can solve the mystery of this apocalypse!To access more games, look for other online parkour games on OnlineGames.io. Keep coming back to discover new and thrilling online games!This article was updated on April 3, 20241 Player3DAdventureArcadeAvoidBlockCrazyFreeHTML5MinecraftMobileMouseParkourPixel",
  "extractedAt": "2025-06-10T05:07:24.126Z",
  "localThumbnail": "Parkour Block 3D_1749532044127.jpg"
}