{
  "url": "https://www.onlinegames.io/penalty-shootout/",
  "title": "Penalty Shootout",
  "category": "/t/sports/",
  "thumbnail": "https://www.onlinegames.io/media/posts/709/Penalty-Shootout.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/709/Penalty-Shootout.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/709/responsive/Penalty-Shootout-xs.jpg 384w, https://www.onlinegames.io/media/posts/709/responsive/Penalty-Shootout-sm.jpg 600w, https://www.onlinegames.io/media/posts/709/responsive/Penalty-Shootout-md.jpg 768w, https://www.onlinegames.io/media/posts/709/responsive/Penalty-Shootout-lg.jpg 1200w",
    "alt": "Penalty Shootout Online Game",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://html5.gamedistribution.com/808291e977dd4a0ea2a4d10a9cebfb62/?gd_sdk_referrer_url=https://www.onlinegames.io/penalty-shootout",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Penalty Shootout Overview"
      },
      {
        "type": "h3",
        "text": "Target Dart Boards"
      },
      {
        "type": "h3",
        "text": "Visit the Ball Shop"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "More Games Like This"
      }
    ],
    "controls": [
      "Desktops and Laptops",
      "Mouse: Swipe the Ball",
      "Mobile Devices",
      "Use the touchscreen to strike."
    ],
    "howToPlay": "",
    "tips": "",
    "developer": "",
    "similarGames": []
  },
  "fullContent": "Home› SoccerPenalty ShootoutBy OnlineGames.ioMake Game Full ScreenPenalty Shootout is a 2D soccer game in which you will be in charge of taking penalty kicks. You need to score a goal from a certain distance from the net. It may sound easy, but it is not that simple!There will be a goalkeeper and defenders in front of you. They will do their best to prevent you from getting the ball into the goal. You can't let them save your strikes. Strive to score as many goals as possible in this sports game!Penalty Shootout OverviewIt's time to take penalty shootouts. You have taken your position behind the ball.The goalkeeper and defenders are waiting for your shot. They prepare themselves for the worst scenario.Scoring a goal will not be that easy as they move from left to right from time to time!Their only focus will be you while you are getting ready for your strikes. You must make such a strike that you hit them in their blind spots.Try to fake them to score the most goals in this soccer game!Remember that you have only three ball lives. You can't let your opponents save your shots more than three times.If you fail, your score will be reset, and you will need to start from zero.Target Dart BoardsWhile you are preparing yourself for your greatest kicks, you will see dart boards in front of the goal. Targeting them will allow you to perform successful shootouts. Aim at them and kick the ball.You will get a point for each of your goals. However, keep in mind that the boards will only appear for a few seconds. You must be quick to take action. While trying to be fast, don't forget to consider the movements of the defenders and the goalkeeper.Visit the Ball ShopYou can get new balls from the Shop section in the menu. There are five balls with different aesthetics to unlock. To acquire them, you must reach the necessary scores. We will leave the names of the balls and how many scores you can unlock them with.Classic Telstar (Free)Vintage Leather (10 Scores)Cyclone Soccer (20 Scores)Shocker Ball (35 Scores)Flaming Goal (50 Scores)ControlsDesktops and LaptopsMouse: Swipe the BallMobile DevicesUse the touchscreen to strike.More Games Like ThisTake a look at Penalty Challenge if you enjoy penalty shootouts. You will play not only as a goalkeeper but also as a penalty taker. Score 5 penalties before your opponent does!Look up the online soccer games on OnlineGames.io for more game options. There are many free online games on the site, which you can easily access whenever you want. Keep coming back to discover new ones!This article was updated on May 9, 20241 Player2DArcadeBallFreeFunHTML5MobileMouseSoccerSportsWorld Cup",
  "extractedAt": "2025-06-10T05:53:40.374Z",
  "localThumbnail": "Penalty Shootout_1749534820374.jpg"
}