{
  "url": "https://www.onlinegames.io/penalty-challenge/",
  "title": "Penalty Challenge",
  "category": "/t/sports/",
  "thumbnail": "https://www.onlinegames.io/media/posts/570/Penalty-Challenge.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/570/Penalty-Challenge.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/570/responsive/Penalty-Challenge-xs.jpg 384w, https://www.onlinegames.io/media/posts/570/responsive/Penalty-Challenge-sm.jpg 600w, https://www.onlinegames.io/media/posts/570/responsive/Penalty-Challenge-md.jpg 768w, https://www.onlinegames.io/media/posts/570/responsive/Penalty-Challenge-lg.jpg 1200w",
    "alt": "Penalty Challenge Free Online Game",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2023/code/penalty-challenge/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "How to Play Penalty Challenge"
      },
      {
        "type": "h2",
        "text": "How can I send precise penalties?"
      },
      {
        "type": "h2",
        "text": "How can I save the ball?"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "Explore Other Soccer Games"
      }
    ],
    "controls": [
      "To shoot the ball, swipe the mouse.To catch the ball, move the mouse."
    ],
    "howToPlay": "First, you need to start by choosing your team. When you enter the game, you will see 32 countries and their flags, including the United States, Germany, and Argentina. You decide which one you want to be a player of.When it's your turn as a penalty taker, you must take all the penalties into the goal one by one. Each team has the right to score 5 penalties. You must not miss any penalty.When you move into the goalkeeper position, you must catch all the penalties your opponent scores. You can't let them get the golden cup!Initially, your team will start taking penalties. The rest will proceed in turn between the two teams.Team with the most goals wins the shootout. As you win matches, you will unlock new matches with more skilled opponents.Penalty Challenge offers 10 matches in total. Finish the tournament in first place and claim the World Cup!Go to the main menu if you want to restart with a different flag. To remove your progress, click the icon in the bottom-left.",
    "tips": "",
    "developer": "Penalty Challenge was created by Codethislab.",
    "similarGames": []
  },
  "fullContent": "Home› SoccerPenalty ChallengeBy OnlineGames.ioMake Game Full ScreenPenalty Challenge is a soccer game where you are playing both as a goalkeeper and a penalty taker. You are responsible for taking penalties into the goal and catching your opponent's penalties when it is their turn. Enjoy one of the most competitive football games, and don't let your opponent score. Win the shootout, and progress step by step to the World Cup final!How to Play Penalty ChallengeFirst, you need to start by choosing your team. When you enter the game, you will see 32 countries and their flags, including the United States, Germany, and Argentina. You decide which one you want to be a player of.When it's your turn as a penalty taker, you must take all the penalties into the goal one by one. Each team has the right to score 5 penalties. You must not miss any penalty.When you move into the goalkeeper position, you must catch all the penalties your opponent scores. You can't let them get the golden cup!Initially, your team will start taking penalties. The rest will proceed in turn between the two teams.Team with the most goals wins the shootout. As you win matches, you will unlock new matches with more skilled opponents.Penalty Challenge offers 10 matches in total. Finish the tournament in first place and claim the World Cup!Go to the main menu if you want to restart with a different flag. To remove your progress, click the icon in the bottom-left.How can I send precise penalties?You can take the best penalties by determining your kick angle well. You also need to adjust the hitting intensity. If you move the mouse forward strongly, the ball's movement speed will also be hectic. Don't underestimate the other side's goalkeeper because he can make very solid saves.How can I save the ball?You scored the penalty, and now it's your turn to save the ball. You must prevent your opponent from scoring as much as possible. While taking the penalty kickout, carefully observe the player's movements and predict where the ball may go. Move the goalie's gloves in the direction of the ball to save it.ControlsTo shoot the ball, swipe the mouse.To catch the ball, move the mouse.DeveloperPenalty Challenge was created by Codethislab.Explore Other Soccer GamesIf you love playing penalty games, you may also like Penalty Kick. With amazing visuals, it's an online penalty shootout game. See how many kicks out of fifteen penalties you can make to score points. Play against a top goalkeeper and show off your soccer skills.Or, you may look for other online soccer games. You can find dozens of games on the website that you can access for free and enjoy. Feel free to leave a comment about your gaming experience in the comment section below!This article was updated on May 9, 20241 Player2DBallFreeFunHTML5MobileMouseSoccerSportsWorld Cup",
  "extractedAt": "2025-06-10T05:53:00.950Z",
  "localThumbnail": "Penalty Challenge_1749534780952.jpg"
}