{
  "url": "https://www.onlinegames.io/pill-soccer/",
  "title": "Pill Soccer",
  "category": "/t/arcade/",
  "thumbnail": "https://www.onlinegames.io/media/posts/842/Pill-Soccer.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/842/Pill-Soccer.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/842/responsive/Pill-Soccer-xs.jpg 384w, https://www.onlinegames.io/media/posts/842/responsive/Pill-Soccer-sm.jpg 600w, https://www.onlinegames.io/media/posts/842/responsive/Pill-Soccer-md.jpg 768w, https://www.onlinegames.io/media/posts/842/responsive/Pill-Soccer-lg.jpg 1200w",
    "alt": "Pill Soccer Play Online",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://cloud.onlinegames.io/games/2024/gm/games3/pill-soccer/index.html",
  "content": {
    "headings": [
      {
        "type": "h3",
        "text": "1 Player Controls"
      },
      {
        "type": "h3",
        "text": "2 Player Controls"
      },
      {
        "type": "h2",
        "text": "How to Play Pill Soccer"
      },
      {
        "type": "h2",
        "text": "Tips for Success in Pill Soccer"
      },
      {
        "type": "h3",
        "text": "How do I get diamonds in Pill Soccer?"
      },
      {
        "type": "h3",
        "text": "Can I customize my pill character in Pill Soccer?"
      },
      {
        "type": "h3",
        "text": "Can I play Pill Soccer on mobile devices?"
      },
      {
        "type": "h3",
        "text": "What Tournaments Are Available in Pill Soccer?"
      },
      {
        "type": "h2",
        "text": "More Soccer Games Online"
      }
    ],
    "controls": [
      "W / Up Arrow Key: JumpA / Left Arrow Key: Move leftD / Right Arrow Key: Move rightS / Down Arrow Key: KickK / Z: Special move"
    ],
    "howToPlay": "Choose your game mode: quick match against online players, local two-player match, or tournament.Control your pill character to move around the field.Push the ball into the opponent's goal to score.Use jumping and headbutting to gain an advantage.Earn diamonds by winning matches, tournaments or completing achievements to customize your pill, ball and unlock new tournaments.",
    "tips": "Get comfy with those controls! Whether you're using WASD or the arrow keys, being quick on your feet is key. It helps you dodge your opponents and get into the right spot to score.When you kick the ball by pressing K or Z, aim for mid-height. That way, you'll send it flying with more power, making it tough for your opponent to block.If the ball gets behind you, backtrack to set yourself as a goalie. It's one of the trickiest spots because if you wait in front of the post too long, a bolt of lightning may hit you!You can catch some powerups during the game! Powerups like speed boosts, extra kicking power, freezing opponents can really give you an advantage.Before jumping into tournaments, you may make use of quick matches against online players to sharpen your skills.",
    "developer": "",
    "similarGames": []
  },
  "fullContent": "Home› SoccerPill SoccerBy OnlineGames.ioMake Game Full Screen Ole, ole, ole! Here is a soccer game with a wacky sports showdown: Pill Soccer. This unique 2-player game features cute 3D characters shaped like pills (yes, you read it right), bringing a fun twist to the traditional 1v1 soccer games. As you can guess, the aim is to score more goals than your opponent win matches and tournaments to earn diamonds!1 Player ControlsW / Up Arrow Key: JumpA / Left Arrow Key: Move leftD / Right Arrow Key: Move rightS / Down Arrow Key: KickK / Z: Special move2 Player ControlsPlayer 1:W: JumpA: Move leftD: Move rightS: KickZ: Special movePlayer 2:Up Arrow Key: JumpLeft Arrow Key: Move leftRight Arrow Key: Move rightDown Arrow Key: KickK: Special moveHow to Play Pill SoccerChoose your game mode: quick match against online players, local two-player match, or tournament.Control your pill character to move around the field.Push the ball into the opponent's goal to score.Use jumping and headbutting to gain an advantage.Earn diamonds by winning matches, tournaments or completing achievements to customize your pill, ball and unlock new tournaments.Tips for Success in Pill SoccerGet comfy with those controls! Whether you're using WASD or the arrow keys, being quick on your feet is key. It helps you dodge your opponents and get into the right spot to score.When you kick the ball by pressing K or Z, aim for mid-height. That way, you'll send it flying with more power, making it tough for your opponent to block.If the ball gets behind you, backtrack to set yourself as a goalie. It's one of the trickiest spots because if you wait in front of the post too long, a bolt of lightning may hit you!You can catch some powerups during the game! Powerups like speed boosts, extra kicking power, freezing opponents can really give you an advantage.Before jumping into tournaments, you may make use of quick matches against online players to sharpen your skills.How do I get diamonds in Pill Soccer?You earn diamonds mainly by playing in tournaments and completing achievements. Winning matches in tournaments or quick matches also adds a bit to your diamond collection. You can use your diamonds to unlock new players, ball skins, and outfits, as well as pay tournament entry fees.Can I customize my pill character in Pill Soccer?Yes, you can! Click on the shop icon on the main menu. In the shop, you can unlock new skins such as Batman, Pirate or even Minion pills. You can also unlock new balls from this menu.Can I play Pill Soccer on mobile devices?Unfortunately, you cannot play Pill Soccer on mobile devices. The game is available for desktop browsers, meaning you can only play on desktops, laptops and Chromebooks.What Tournaments Are Available in Pill Soccer?In Pill Soccer, you can unlock several tournaments, each with its own entrance fee and rewards.Amateur League: Entrance fee is 500 diamonds, winning prize is 900 diamonds.Semi-Professional League: Entrance fee is 700 diamonds, winning prize is 2,100 diamonds.Super League: Entrance fee is 1,500 diamonds, winning prize is 4,500 diamonds.Professional League: The entrance fee is 4,000 diamonds, winning prize is 12,000 diamonds.Elite League: Entrance fee is 10,000 diamonds, and the winning prize is 30,000 diamonds.Epic League: The entrance fee is 20,000 diamonds, winning prize is 60,000 diamonds.More Soccer Games OnlineIf you're a fan of Pill Soccer, you'll love exploring similar fun sports games that are available! Just browse the World Cup Games tag and see all the great soccer games available at the heart of online entertainment: OnlineGames.io! This article was updated on October 11, 20242 Player3DArcadeArenaBallCrazyFreeFunFunnyKidsSoccerSportsWorld Cup",
  "extractedAt": "2025-06-10T05:14:27.626Z",
  "localThumbnail": "Pill Soccer_1749532467627.jpg"
}