{
  "url": "https://www.onlinegames.io/pirate-shootout/",
  "title": "Pirate Shootout",
  "category": "/t/puzzle/",
  "thumbnail": "https://www.onlinegames.io/media/posts/802/Pirate-Shootout.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/802/Pirate-Shootout.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/802/responsive/Pirate-Shootout-xs.jpg 384w, https://www.onlinegames.io/media/posts/802/responsive/Pirate-Shootout-sm.jpg 600w, https://www.onlinegames.io/media/posts/802/responsive/Pirate-Shootout-md.jpg 768w, https://www.onlinegames.io/media/posts/802/responsive/Pirate-Shootout-lg.jpg 1200w",
    "alt": "Pirate Shootout Free Online Game",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://html5.gamemonetize.co/iaudi1ecmyvcty229sllf4gcw82ow2je/",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "How to Play Pirate Shootout"
      },
      {
        "type": "h2",
        "text": "Hit the Buttons"
      },
      {
        "type": "h3",
        "text": "Moving Obstacles"
      },
      {
        "type": "h3",
        "text": "Wrecking Balls and TNTs"
      },
      {
        "type": "h2",
        "text": "More Physics Games"
      }
    ],
    "controls": [
      "Computers",
      "Aim: Hold left clickShoot: Release left click",
      "Mobiles",
      "Aim: Hold tapShoot: Release"
    ],
    "howToPlay": "Start off with level one. Hold the left click while aiming and release it to shoot.You have 5 bullets to clear all your enemies.Do not waste a single bullet to get 3 stars.Anticipate the angle and shoot the side walls to hit the enemies with bouncing bullets.The good news is you can shoot multiple enemies at once. And even better, you're protected from your own bullets.Clear the scene to collect the loot as a pirate and take on the next challenge.We suggest you turn on the sounds because you'll love the SFX when you hit a target.",
    "tips": "",
    "developer": "",
    "similarGames": []
  },
  "fullContent": "Home› ShootingPirate ShootoutBy OnlineGames.ioMake Game Full ScreenAhoy matey! Ricochet bullets off the wall to hit all your targets in this pirate game. Grab your shotgun, bounce the bullets and be the cowboy of the open seas! Pirate Shootout is a 2D physics puzzle game with 50 unique levels. As in the reminiscent of Bullet Master game, players clear enemies by indirect shooting and collect loots as a sea rover.Whether you're on your mobile or your computer, you can play Pirate Shootout on your browser without downloading a single file. Here is how you can play the game:ControlsComputersAim: Hold left clickShoot: Release left clickMobilesAim: Hold tapShoot: ReleaseHow to Play Pirate ShootoutStart off with level one. Hold the left click while aiming and release it to shoot.You have 5 bullets to clear all your enemies.Do not waste a single bullet to get 3 stars.Anticipate the angle and shoot the side walls to hit the enemies with bouncing bullets.The good news is you can shoot multiple enemies at once. And even better, you're protected from your own bullets.Clear the scene to collect the loot as a pirate and take on the next challenge.We suggest you turn on the sounds because you'll love the SFX when you hit a target.Hit the ButtonsOn some levels, enemies hide behind bars and gates. To open these gates, aim for the buttons. If the button turns green, the gates will open.Moving ObstaclesThere are some moving obstacles that blocks your sight. First understand their cycle and how they move. Anticipate when they will go down or up. Send the bullets in the perfect timing to headshot them all.Wrecking Balls and TNTsBullets are not the only way to eliminate an enemy. Aim for TNTs to explode and clear multiple at once. You can also aim for wrecking balls, let them drop onto enemies and smash them.More Physics GamesIf you have completed all 50 levels and are looking for more online physics games, please check out the related page. We are committed to providing our community with the highest quality games for free. Stay connected and continue to enjoy hundreds of games online!This article was updated on July 16, 20241 Player2DActionFreeFunFunnyGunHTML5LogicMobilePhysicsPiratePuzzleShootingWeapon",
  "extractedAt": "2025-06-10T05:49:45.343Z",
  "localThumbnail": "Pirate Shootout_1749534585344.jpg"
}