{
  "url": "https://www.onlinegames.io/pizza-party/",
  "title": "Pizza Party",
  "category": "/new-games/",
  "thumbnail": "https://www.onlinegames.io/media/posts/462/Pizza-Party-Game.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/462/Pizza-Party-Game.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/462/responsive/Pizza-Party-Game-xs.jpg 384w, https://www.onlinegames.io/media/posts/462/responsive/Pizza-Party-Game-sm.jpg 600w, https://www.onlinegames.io/media/posts/462/responsive/Pizza-Party-Game-md.jpg 768w, https://www.onlinegames.io/media/posts/462/responsive/Pizza-Party-Game-lg.jpg 1200w",
    "alt": "Pizza Party Play Online",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://html5.gamedistribution.com/15aa29991c694f96a6dde5a319c71eef/?gd_sdk_referrer_url=https://www.onlinegames.io/pizza-party",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "How to Play Pizza Party"
      },
      {
        "type": "h3",
        "text": "Making Pizzas"
      },
      {
        "type": "h3",
        "text": "Unlocking New Pizza Types"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Want to Cook More?"
      }
    ],
    "controls": [
      "Use your mouse button to select ingredients and click to the pizza oven to bake pizzas and serve them.If you make any mistake while making a pizza, click the trash can to throw it."
    ],
    "howToPlay": "Customers will come to the counter, and the type of pizza they want will appear as a bubble on their right side. According to this instruction, you must cook the pizza they want using the ingredients on the left side of the screen. They may get angry if you give them the wrong pizza or their pizza is late. Treat them well!",
    "tips": "",
    "developer": "",
    "similarGames": []
  },
  "fullContent": "Home› RestaurantPizza PartyBy OnlineGames.ioMake Game Full Screen Customers are hungry and waiting for your pizzas! Pizza Party is a restaurant game where you take customers' orders and make their pizzas according to their wishes. But do not make them wait longer! Customers all over the world are impatient. Besides, if you make the wrong pizza and give it to them, they will go crazy. You shouldn't lose customers!How to Play Pizza PartyCustomers will come to the counter, and the type of pizza they want will appear as a bubble on their right side. According to this instruction, you must cook the pizza they want using the ingredients on the left side of the screen. They may get angry if you give them the wrong pizza or their pizza is late. Treat them well!Making PizzasThe customer came and placed his order. So what do we do now? Depending on the type of pizza the customer wants, you need to start making the pizza using the ingredients on the right. It is as essential to use the right ingredients in the correct order as it is to use them. Otherwise, the customer will be uneasy. After preparing the pizza, put it in the oven and then serve it to the customer. If you forget the pizza recipe, you can get it by clicking on the pizza icon in the upper right corner of the game screen.Unlocking New Pizza TypesAt first, you can only make two types of pizza, but as you earn a certain amount of money, you will level up and be able to make new types of pizza with new ingredients. In the list below, you can see which types of pizza you can make in the game.MargheritaMarinaraQuattro StagioniPepperoni MushroomsPepperoniHam & MushroomsControlsUse your mouse button to select ingredients and click to the pizza oven to bake pizzas and serve them.If you make any mistake while making a pizza, click the trash can to throw it. Want to Cook More?If you enjoy playing Pizza Party, we recommend trying our Dream Restaurant game, where you serve burgers and sandwiches to your customers while managing your own restaurant. Alternatively, explore other kid-friendly game collections on OnlineGames.io for more exciting options.This article was updated on March 23, 20241 Player2DCookingFreeHTML5KidsMobileMouseRestaurant",
  "extractedAt": "2025-06-10T06:21:37.839Z",
  "localThumbnail": "Pizza Party_1749536497839.jpg"
}