{
  "url": "https://www.onlinegames.io/police-traffic/",
  "title": "Police Traffic",
  "category": "/t/car/",
  "thumbnail": "https://www.onlinegames.io/media/posts/187/Pollice-Traffic.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/187/Pollice-Traffic.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/187/responsive/Pollice-Traffic-xs.jpg 384w, https://www.onlinegames.io/media/posts/187/responsive/Pollice-Traffic-sm.jpg 600w, https://www.onlinegames.io/media/posts/187/responsive/Pollice-Traffic-md.jpg 768w, https://www.onlinegames.io/media/posts/187/responsive/Pollice-Traffic-lg.jpg 1200w",
    "alt": "Police Traffic Game Free",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2021/unity/police-traffic/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Game Modes"
      },
      {
        "type": "h2",
        "text": "How to Play Police Cars?"
      },
      {
        "type": "h2",
        "text": "Which cars can I drive in Police Traffic?"
      },
      {
        "type": "h2",
        "text": "Similar Games"
      }
    ],
    "controls": [],
    "howToPlay": "Choose your car and game mode and start gliding on the road. Controls are similar to other driving games in our collection.\n\nWASD or arrow keys to driveLeft Shift for NOSSpace for handbrakeTab or Esc to toggle pause",
    "tips": "",
    "developer": "",
    "similarGames": []
  },
  "fullContent": "Home› PolicePolice TrafficBy OnlineGames.ioPolice Traffic is an online 3D game to experience driving in heavy traffic while being a police officer.You can speed up but be careful of the other cars that might stop suddenly.Get ready to become a master of speedy overtakes and tight turns. Escape from dangerous situations and collect money on the road without crashing your car.Before starting the game, you need to choose the police car. Each car has a different power of speed, handling and brake. Game ModesThere are 4 modes of Police Traffic: One-Way Mode: Enjoy a more relaxed one way road. Nothing is upcoming to you.Two-Way Mode: We added a little spice to One-Way and created Two-Way Mode for you to feel the adrenaline rush. Speed between cars going opposite directions. Earn combo and wrong-way points. Time Attack Mode: Try if you can survive through the road until the time is up.Speed bomb: Time to be a bus driver. A bomb is activated and will explode if you slow down. You can crash over smaller vehicles at the cost of bomb health. But, better to stay away from trucks and buses. Any crash with bigger vehicles will slow you down. Bomb health rapidly drops in that case.Better to be vigilant about your speed, distance, score and warnings that will be displayed on your screen while driving your police car.How to Play Police Cars?Choose your car and game mode and start gliding on the road. Controls are similar to other driving games in our collection.WASD or arrow keys to driveLeft Shift for NOSSpace for handbrakeTab or Esc to toggle pauseWhich cars can I drive in Police Traffic?There are 8 police cars available: 2 cars are for free at the beginning and the rest you must buy. You can drive an armored jeep, a limo, a sports car or the other ones to your liking.Similar GamesDid you like Police Traffic? Go on playing a similar game by browsing our Traffic Games.Embed URL:https://www.onlinegames.io/games/2021/unity/police-traffic/index.htmlThis article was updated on February 22, 20241 Player3DCarDrivingEmbeddableFreePoliceRacingSpeedStuntTrafficUnity",
  "extractedAt": "2025-06-10T05:25:16.645Z",
  "localThumbnail": "Police Traffic_1749533116646.jpg"
}