{
  "url": "https://www.onlinegames.io/poop-clicker/",
  "title": "Poop Clicker",
  "category": "/t/html5/",
  "thumbnail": "https://www.onlinegames.io/media/posts/742/Poop-Clicker.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/742/Poop-Clicker.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/742/responsive/Poop-Clicker-xs.jpg 384w, https://www.onlinegames.io/media/posts/742/responsive/Poop-Clicker-sm.jpg 600w, https://www.onlinegames.io/media/posts/742/responsive/Poop-Clicker-md.jpg 768w, https://www.onlinegames.io/media/posts/742/responsive/Poop-Clicker-lg.jpg 1200w",
    "alt": "Poop Clicker Play Online",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2024/construct/292/poop-clicker/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "How to Play Poop Clicker?"
      },
      {
        "type": "h2",
        "text": "Monitor Poop Cleaning Stats"
      },
      {
        "type": "h2",
        "text": "Poop Comes In Various Forms"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "More Clicker Games"
      }
    ],
    "controls": [
      "Click or tap on the poop to earn coins."
    ],
    "howToPlay": "Click on the poop to clean the very first poo-poo as a plumber. This is just the beginning of a nasty job! With each click, your earnings will increase, bringing you closer to becoming poop king!Unlock a range of achievements, skins, and poop cleaners.Pick among all the clickers and boosters displayed on the right side of the screen. Purchase them individually or in bulk by clicking on the x1, x10, and x100 buttons on the top right. Boosters will unlock as you earn enough coins to afford them.These boosters and clickers work for different purposes. Use poop clickers to boost poop per click, including bonus poop, multiple clicks, expert clickers, and more. On the other hand, autonomous clickers toilet systems improve your clicking power. Learn about how to strategically choose between them below.Make a streak to multiply your clicking power. Click consecutively and keep the blue bar on the left full for faster poop cleaning.",
    "tips": "",
    "developer": "Poop Clicker is created by FreezeNova, by Construct 3 technology.",
    "similarGames": []
  },
  "fullContent": "Home› ClickerPoop ClickerBy OnlineGames.ioMake Game Full ScreenYes, we know it's a bit of a messy situation, but we need your plumbing skills! Play Poop Clicker, a free idle game with an odd twist; you get to be a dedicated plumber. Click on the poo-poo on the screen to earn fantastic rewards! While your friends dream of glamorous careers and having cool jobs like astronauts or athletes, you've chosen a different path for being a sewer guy! You aren't afraid to get your hands dirty. After all, it's great for your immune system, isn’t it? OnlineGames.io brings a new and interesting level of fun every day for free of charge. And the Poop Clicker game is the proof of that. Start playing it and explore it yourself. Or read this guide to get to the grips of this quirky world and how to play this unusual clicker game.ControlsClick or tap on the poop to earn coins.How to Play Poop Clicker?Click on the poop to clean the very first poo-poo as a plumber. This is just the beginning of a nasty job! With each click, your earnings will increase, bringing you closer to becoming poop king!Unlock a range of achievements, skins, and poop cleaners.Pick among all the clickers and boosters displayed on the right side of the screen. Purchase them individually or in bulk by clicking on the x1, x10, and x100 buttons on the top right. Boosters will unlock as you earn enough coins to afford them.These boosters and clickers work for different purposes. Use poop clickers to boost poop per click, including bonus poop, multiple clicks, expert clickers, and more. On the other hand, autonomous clickers toilet systems improve your clicking power. Learn about how to strategically choose between them below.Make a streak to multiply your clicking power. Click consecutively and keep the blue bar on the left full for faster poop cleaning.Monitor Poop Cleaning StatsAt the bottom of your screen, monitor your stats to determine which cookie makers to invest in based on your strategy.If you prefer to earn coins based on your own clicking, it's best to employ per-click boosters instead of automatic ones. On the other hand, if you'd like to earn an idle income and watch your coins grow with minimal effort, then your choice should be on automatic clickers. Industrialize your business, employ machines, and lay back to see your profits increase.For a more balanced approach, try to find a level where clicking power is equal to poop per second. Poop Comes In Various FormsUnlock new poop characters with funny costumes as you progress through the game. You can unlock different characters, such as Shiny, Doctor, Ugly and even Rainbow poop.Keep an eye out for golden poops passing through your screen randomly. Click on them to earn a substantial amount of dollars.DeveloperPoop Clicker is created by FreezeNova, by Construct 3 technology.More Clicker GamesIf you enjoy quirky idle games, take a look at all your options on the Clicker Games Online page. Online Games.io has a lot to offer to appeal to different tastes and preferences. From cookie clickers to mining businesses, you'll find your next occupation on this platform.Embed URL:https://www.onlinegames.io/games/2024/construct/292/poop-clicker/index.htmlThis article was updated on May 22, 20241 Player2DClickerCrazyEmbeddableFreeFunnyHTML5IdleMobileMouse",
  "extractedAt": "2025-06-10T06:00:41.771Z",
  "localThumbnail": "Poop Clicker_1749535241771.jpg"
}