{
  "url": "https://www.onlinegames.io/privacy-policy/",
  "title": "Privacy Policy",
  "category": "/t/action/",
  "thumbnail": "https://www.onlinegames.io/media/website/online-games-io.png",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/website/online-games-io.png",
    "srcset": null,
    "alt": "Online Games.io",
    "width": 240,
    "height": 39,
    "className": "",
    "parentClass": "logo"
  },
  "gameFrame": null,
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Notification of Changes to This Policy"
      },
      {
        "type": "h2",
        "text": "Personal Data Collected Through OnlineGames.io"
      },
      {
        "type": "h2",
        "text": "The Site may therefore use third party cookies such as cookies from:"
      },
      {
        "type": "h2",
        "text": "Use of Personal Data Collected Through OnlineGames.io"
      },
      {
        "type": "h2",
        "text": "Anonymous Data Collected Through OnlineGames.io"
      },
      {
        "type": "h2",
        "text": "Cookies"
      },
      {
        "type": "h2",
        "text": "Disclosure of Your Personal Data"
      },
      {
        "type": "h2",
        "text": "Link to Other Sites"
      },
      {
        "type": "h2",
        "text": "What are your rights under data protection laws?"
      },
      {
        "type": "h2",
        "text": "Changes to our privacy policy"
      }
    ],
    "controls": [],
    "howToPlay": "",
    "tips": "",
    "developer": "",
    "similarGames": []
  },
  "fullContent": "HomePrivacy PolicyBy OnlineGames.ioThis privacy policy describes OnlineGames.io’s (hereafter “the Site) current policies and practices with regard to personal data collected by the Site through its web sites, onlinegames.io. This privacy policy is independent from OnlineGames.io’s offline personal data collection practices.The term “personal data” refers to personally identifiable information about you, such as your name, birth date, e-mail address or mailing address, and any other information that is identified with you personally.Notification of Changes to This PolicyOnlineGames.io is continually improving and adding new functionality and features to its web sites and improving and adding to our existing products, services, and programs. Because of these ongoing changes, changes in the law, and the changing nature of technology, OnlineGames.io’s data practices will change from time to time. If and when our data practices change, OnlineGames.io will post the changes on our web sites to notify you of the changes. We encourage you to check this page frequently. This policy was last updated on July 01, 2019.Personal Data Collected Through OnlineGames.ioOther than cookies, as described below, the only personal data the Site currently collects through its web sites is the information you voluntarily give us when you use our sites.For example, you may use this site to contact OnlineGames.io with questions and comments. When you fill out a form on our web sites, you may provide your name and other contact information, including your e-mail address, and your mailing address or the mailing address of your company or other personal information. When you submit information or register for events through onlinegames.io, you will receive a confirmation e-mail to the address we have on file. When you use our web sites to search for information you are not providing us with any personal information. The OnlineGames.io does not collect or retain any identifying information about you when you use the search features.By accepting this Privacy Policy, you give us permission to allow third parties to drop cookies and/or use web beacons for advertising and tracking purposes.Third parties might use information gathered by cookies and/or web beacons for the purpose of online behavioral advertising and/or multisite advertising. The types of information that is gathered by third party cookies and/or web beacons as well as the purpose(s) for which this information is used, are set out in the privacy policy of said third parties which Online Games.io encourages you to review. Online Games.io declines all and any liability for any third party cookies or web beacons deployed by third parties for whatever purpose.The Site may therefore use third party cookies such as cookies from:Appnexus – Privacy PolicyGoogle Ad Exchange – Privacy PolicyGoogle Adsense – Privacy PolicyOpenX – Privacy PolicyRubicon – Privacy PolicyIndex Exchange – Privacy PolicyPubmatic – Privacy PolicyDistrictM – Privacy PolicyAmazon – Privacy PolicyTelaria – Privacy PolicyIn addition, the Site also uses third party cookies such as cookies from Google Analytics.Google Analytics is a free service by Google to collect statistics of websites and to represent them in detail. The website administrator thus has a clear view on visitor flows, traffic flows and page displays. This way it is possible to adapt parts of a website or complete websites to the behavior and interests of the visitors.Use of Personal Data Collected Through OnlineGames.ioThe Site uses the personal information you provide to answer your question or resolve your problem. The site uses this information to help us improve the content and functionality of our web sites, to improve our products and services. OnlineGames.io may use this information to contact you in the future to tell you about products or services we believe will be of interest to you. If we do so, each communication we send you will contain instructions permitting you to “opt-out” of receiving future communications. Similarly, we may provide “subscription” e-mail services, which enable you to receive current news. For all such services, we will provide an opportunity to “opt-out” of, or cancel, the subscription.Anonymous Data Collected Through OnlineGames.ioIn addition to the information you provide when you use our web sites, OnlineGames.io uses technology to collect anonymous information about the use of our web sites. For example, we use technology to track how many visitors access our web sites, the date and time of their visit, the length of their stay, and which pages they view. We also use technology to determine which web browsers our visitors use and the address from which they accessed our sites (for example, if they connected to a OnlineGames.io web site by clicking on one of our banner ads). This technology does not identify you personally. It simply enables us to compile statistics about our visitors and their use of our sites. OnlineGames.io and our affiliates use this anonymous data to improve the content and functionality of our web sites to improve our products and services.CookiesA cookie is a small piece of information that is sent to your browser and stored on your computer’s hard drive. Cookies do not damage your computer and they cannot be used to discover the identity of a user. You can set your browser to notify you when you receive a cookie. This enables you to decide if you want to accept it or not and whether you are required to accept the cookie to view certain content. The may use cookies to “persist” a user session — that is, to maintain connection with a user as he or she moves through an application or series of web pages. The purpose of cookies in this context is to remember user inputs. Personalization features also use cookies to identify groups of users and deliver appropriate content and services and allow you to skip the login process.  By clicking on “Accept” you agree with our cookies policies and also that you have the minimum age required to agree to the terms of this Privacy Policy. If you want to revoke the cookies consent simply click on the “Revoke” button.Disclosure of Your Personal DataOnlineGames.io may share some or all of the personal data collected through this web site with our affiliates, who use this data in accordance with this Privacy Policy.OnlineGames.io may on a limited basis share personal data collected through its web sites with affiliates who act for or on behalf of OnlineGames.io (for example, companies that provide support services to us like insurance, or that help us market our products and services). These companies may need information about you in order to perform their functions. These companies are not authorized to use the information we share with them for any other purpose. In addition, there may be some other, limited circumstances in which OnlineGames.io may share or transfer the personal data in our databases, for example, to comply with a legal requirement or for the administration of justice.While no method of data transmission is guaranteed against unlawful third party interception or other misuse, OnlineGames.io uses commercially reasonable efforts to ensure protection of your data including industry-standard encryption and offline security methods in our physical facilities.Link to Other SitesOnlineGames.io’s web sites contain hyperlinks to other sites that are not operated by the Site. These hyperlinks are provided for your reference and convenience only and do not imply any endorsement of the activities of these third-party web sites or any association with their operators. OnlineGames.io does not control these web sites and is not responsible for their data practices. We urge you to review the privacy policy posted on any site you visit before using the site or providing any personal data about yourself.What are your rights under data protection laws?Residents from the European Union and the Unit",
  "extractedAt": "2025-06-10T05:06:32.681Z",
  "localThumbnail": "Privacy Policy_1749531992681.jpg"
}