{
  "url": "https://www.onlinegames.io/pumpkin-monster/",
  "title": "Pumpkin Monster",
  "category": "/new-games/",
  "thumbnail": "https://www.onlinegames.io/media/posts/452/Pumpkin-Monster-Game.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/452/Pumpkin-Monster-Game.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/452/responsive/Pumpkin-Monster-Game-xs.jpg 384w, https://www.onlinegames.io/media/posts/452/responsive/Pumpkin-Monster-Game-sm.jpg 600w, https://www.onlinegames.io/media/posts/452/responsive/Pumpkin-Monster-Game-md.jpg 768w, https://www.onlinegames.io/media/posts/452/responsive/Pumpkin-Monster-Game-lg.jpg 1200w",
    "alt": "Pumpkin Monster Play Online",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://html5.gamedistribution.com/123c219b8bf0425dbdf14d9663c5029e/?gd_sdk_referrer_url=https://www.onlinegames.io/pumpkin-monster",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "How to Play Pumpkin Monster?"
      },
      {
        "type": "h2",
        "text": "Halloween Weapons"
      },
      {
        "type": "h2",
        "text": "What Makes Pumpkin Monster More Enjoyable?"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Other Games"
      }
    ],
    "controls": [
      "Use your mouse's left-click to punch or shoot the pumpkin monster."
    ],
    "howToPlay": "The rules of the Pumpkin Monster game are straightforward. The game will begin as soon as you touch the play button. At the game screen, you will notice a monster you will struggle to defeat and a health bar indicating his durability. To begin slapping it, click the left mouse button.",
    "tips": "",
    "developer": "",
    "similarGames": []
  },
  "fullContent": "Home› CrazyPumpkin MonsterBy OnlineGames.ioMake Game Full Screen With Halloween coming, let's have fun and relieve stress, shall we? At the end of the day, sometimes, we want to ease the accumulated stress. Pumpkin Monster is a 2D crazy game where a player shoots, stabs and burns a virtual pumpkin monster and beats it to level up and get coins. It is created for having fun with a Halloween theme and releasing those daily stresses freely.How to Play Pumpkin Monster?The rules of the Pumpkin Monster game are straightforward. The game will begin as soon as you touch the play button. At the game screen, you will notice a monster you will struggle to defeat and a health bar indicating his durability. To begin slapping it, click the left mouse button.Halloween WeaponsYou can access various Halloween weapons in the game to kick the pumpkin monster. The upper side of the game screen is where you can see your available weapons. You will see six different icons, five representing different weapon options. Press the final button to put the gun you just grabbed down. The options for weapons are mentioned below. You'll even see some animal names in the list. You can call animals suitable for the Halloween spirit and attack the pumpkin monster. Choose what you want to do to de-stress, then!AxesBroomMachetesTorchWolfGhostBatWhat Makes Pumpkin Monster More Enjoyable?Obtaining new weapons with the coins you earn makes the game more enjoyable. It increases the damage you do to the pumpkin monster.You can buy a mask for the pumpkin monster by pressing the creature icon next to the health bar.If the blood effect and shooting sounds bother you while playing Pumpkin Monster, you can turn them off from the relevant icons at the top left of the screen.It is optional, but if you want to save money faster, you can earn money by watching ads from the coin and play button icon at the top right of the screen.ControlsUse your mouse's left-click to punch or shoot the pumpkin monster.Other GamesIf you enjoy playing the Pumpkin Monster game, you should check Mr Dracula, in which you try to eliminate zombies and mummies as Dracula. Or, you can play other free online Halloween games by browsing crazy games tag.This article was updated on May 9, 20241 Player2DClickerCrazyDestroyFreeFunFunnyHorrorMobileMousePhysics",
  "extractedAt": "2025-06-10T06:21:56.019Z",
  "localThumbnail": "Pumpkin Monster_1749536516019.jpg"
}