{
  "url": "https://www.onlinegames.io/racing-cars-2/",
  "title": "Racing Cars 2",
  "category": "/new-games/",
  "thumbnail": "https://www.onlinegames.io/media/posts/762/Racing-Cars-2.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/762/Racing-Cars-2.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/762/responsive/Racing-Cars-2-xs.jpg 384w, https://www.onlinegames.io/media/posts/762/responsive/Racing-Cars-2-sm.jpg 600w, https://www.onlinegames.io/media/posts/762/responsive/Racing-Cars-2-md.jpg 768w, https://www.onlinegames.io/media/posts/762/responsive/Racing-Cars-2-lg.jpg 1200w",
    "alt": "Racing Cars 2 Play Online",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2021/4/racing-cars-2/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Racing Cars 2 Overview"
      },
      {
        "type": "h3",
        "text": "Bounce Your Car"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "Previous Version"
      }
    ],
    "controls": [
      "Desktops and Laptops",
      "A/D or Left and Right Arrows: To move left and rightW/Upper Arrow/Spacebar: Jump",
      "Mobile Devices",
      "Use the virtual buttons on the touchscreen to steer the vehicle."
    ],
    "howToPlay": "",
    "tips": "",
    "developer": "FreezeNova developed Racing Cars 2.",
    "similarGames": []
  },
  "fullContent": "Home› RacingRacing Cars 2By OnlineGames.ioMake Game Full ScreenRacing Cars 2 is a driving game where you will steer your car on a city road. However, the road will test your driving skills with ups and downs. You cannot lose control of the car!Otherwise, the car can turn upside down, which will cause it to explode. If this happens, you must restart the level from the beginning of this racing game! Make the vehicle jump when necessary to move forward.ControlsDesktops and LaptopsA/D or Left and Right Arrows: To move left and rightW/Upper Arrow/Spacebar: JumpMobile DevicesUse the virtual buttons on the touchscreen to steer the vehicle.Racing Cars 2 OverviewYour main objective is to reach the finish line without letting your car turn upside down by a pit or hill on the road.Start by choosing the vehicle you want to drive from the \"Car Selection\" menu. If you are a newbie, you have only two available cars to drive.Pick the one you want to drive most! As you collect coins on the way, you can unlock new ones or upgrade the current ones to have much more power.You can also choose a color for the car before entering the races. There are red, navy blue, black, orange, green and beige options at your disposal.After all is set, you are ready to enter the road with your customized car. Try to collect all the coins on your way!Bounce Your CarThe road you will drive is in a city. You will see many malls, banks, shops and other centers while steering your vehicle. But you will encounter many ups and downs until you reach the finish line. You will probably lose your steering ability if you enter them at high speed!So, we recommend driving at moderate speed and cautiously. If your car turns upside down, it will explode. When a hole or hill shakes the vehicle, you can try to return it to its normal position by bouncing it in this racing game!DeveloperFreezeNova developed Racing Cars 2.Previous VersionIf you haven't tried the first version of this game, you may also enjoy playing Racing Cars. The rules are the same: you must steer your car until you reach the finish line. Try not to blow up your car!For additional options, look up other online racing games on OnlineGames.io. The site has dozens of free online games, and you can play each one without requiring registration!Embed URL:https://www.onlinegames.io/games/2021/4/racing-cars-2/index.htmlThis article was updated on June 11, 20241 Player2DArcadeCarDrivingEmbeddableFreeKidsMobileRacingSpeed",
  "extractedAt": "2025-06-10T06:08:43.620Z",
  "localThumbnail": "Racing Cars 2_1749535723620.jpg"
}