{
  "url": "https://www.onlinegames.io/rainbow-survival/",
  "title": "Rainbow Survival",
  "category": "/t/action/",
  "thumbnail": "https://www.onlinegames.io/media/posts/882/rainbow-survival.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/882/rainbow-survival.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/882/responsive/rainbow-survival-xs.jpg 384w, https://www.onlinegames.io/media/posts/882/responsive/rainbow-survival-sm.jpg 600w, https://www.onlinegames.io/media/posts/882/responsive/rainbow-survival-md.jpg 768w, https://www.onlinegames.io/media/posts/882/responsive/rainbow-survival-lg.jpg 1200w",
    "alt": "Rainbow Survival Play Online",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://cloud.onlinegames.io/games/2024/gm/games5/rainbow-survival/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "How to Play Rainbow Survival"
      },
      {
        "type": "h2",
        "text": "What is the Story of Rainbow Survival?"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "Similar Games"
      }
    ],
    "controls": [
      "WASD or Arrow Keys: MoveQ / E: Lean Left / RightMouse: Look AroundLeft-Click: ShootSpace: JumpR: ReloadLeft-Shift: RunP: Pause"
    ],
    "howToPlay": "The colorful, once-beautiful rainbow is now cursed, and each color has transformed into a mischievous monster. As the brave hero of Pixelville, it's up to you to defeat these funny foes to restore the rainbow's beauty.\n\nEach level requires you to eliminate a set number of colorful enemies (starting with 10).Move by WASD and jump by pressing the spacebar. Use your mouse to aim and shoot and defeat monsters in no time. Check your health level often because it'll drain when you're near foes.  With every level you complete, you unlock a new, more powerful weapon to help you in your quest.You'll start with a basic deagle and work your way up through more powerful weapons like Kriss Vector.As the enemies get tougher, so does your weaponry, giving you the firepower you need to defeat the rainbow foes.Keep moving, aim well, and eliminate them one by one.",
    "tips": "",
    "developer": "Rainbow Survival was developed by G55 CO.",
    "similarGames": [
      {
        "title": "Funny Shooter Bro",
        "url": "https://www.onlinegames.io/funny-shooter-bro/"
      }
    ]
  },
  "fullContent": "Home› First Person ShooterRainbow SurvivalBy OnlineGames.ioMake Game Full ScreenRainbow Survival is a funny online FPS game that blends humor, color, and action in a wacky world. In this browser game, you'll be chased by quirky, colorful monsters that are more mischievous than they appear. Armed with a simple weapon, you'll need sharp reflexes and precision to defeat waves of foes and restore the rainbow to its rightful place in the sky!ControlsWASD or Arrow Keys: MoveQ / E: Lean Left / RightMouse: Look AroundLeft-Click: ShootSpace: JumpR: ReloadLeft-Shift: RunP: PauseHow to Play Rainbow SurvivalThe colorful, once-beautiful rainbow is now cursed, and each color has transformed into a mischievous monster. As the brave hero of Pixelville, it's up to you to defeat these funny foes to restore the rainbow's beauty.Each level requires you to eliminate a set number of colorful enemies (starting with 10).Move by WASD and jump by pressing the spacebar. Use your mouse to aim and shoot and defeat monsters in no time. Check your health level often because it'll drain when you're near foes.  With every level you complete, you unlock a new, more powerful weapon to help you in your quest.You'll start with a basic deagle and work your way up through more powerful weapons like Kriss Vector.As the enemies get tougher, so does your weaponry, giving you the firepower you need to defeat the rainbow foes.Keep moving, aim well, and eliminate them one by one.What is the Story of Rainbow Survival?Once upon a time, in the colorful world of Pixelville, there was a magical rainbow that stretched across the sky every day, spreading joy to everyone below. But one dark night, an evil wizard, tired of all the happiness, cast a curse on the rainbow. Each color of the rainbow turned into a monster! In this whimsical land, the colors took on their new, funny forms:Red became the Tomato Tango, hopping around with a mischievous grin, trying to squish you with tomato feet.Orange transformed into the Carrot Can-Can, spinning and dancing to confuse you.Yellow became the Banana Peel Pirate, sliding around on banana peels.Green morphed into the Pea Pod Popper, sneaking up to deliver powerful punches.Blue turned into the Blueberry Bouncer, bouncing toward you and threatening to flatten you like a pancake.Indigo was the Eggplant Egghead, and Violet became the Grape Grappler, tossing sticky grapes that could slow you down if they stuck.A brave kid (that's you!) with a big heart and an even bigger laugh decided to take action. Armed with a simple gun, which becomes more powerful as you progress, your mission is to defeat these colorful creatures and break the curse. With each defeated foe, the rainbow slowly returns to its former glory, restoring peace to Pixelville!DeveloperRainbow Survival was developed by G55 CO.Similar GamesIf you enjoyed Rainbow Survival, be sure to check out Funny Shooter Bro, another funny FPS game. You can also find more funny games on OnlineGames.io and explore other browser games to enjoy!This article was updated on November 27, 20241 Player3DActionBattle RoyaleCrazyDestroyFirst Person ShooterFreeGunShootingUnityWeapon",
  "extractedAt": "2025-06-10T05:03:50.719Z",
  "localThumbnail": "Rainbow Survival_1749531830719.jpg"
}