{
  "url": "https://www.onlinegames.io/rainbow-obby-parkour/",
  "title": "Rainbow Obby Parkour",
  "category": "/t/action/",
  "thumbnail": "https://www.onlinegames.io/media/posts/913/Rainbow-Obby.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/913/Rainbow-Obby.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/913/responsive/Rainbow-Obby-xs.jpg 384w, https://www.onlinegames.io/media/posts/913/responsive/Rainbow-Obby-sm.jpg 600w, https://www.onlinegames.io/media/posts/913/responsive/Rainbow-Obby-md.jpg 768w, https://www.onlinegames.io/media/posts/913/responsive/Rainbow-Obby-lg.jpg 1200w",
    "alt": "Rainbow Obby Parkour Free Online Game",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://playhop.com/app/397744?utm_source=distrib&is-united-page=1&skip-guard=1&header=no&utm_medium=cristian-ovidiu&clid=8531463",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "How To Play Rainbow Obby Parkour"
      },
      {
        "type": "h2",
        "text": "Obby, But Are You a Ball, Car or a Bike?"
      },
      {
        "type": "h2",
        "text": "More Roblox Games"
      }
    ],
    "controls": [
      "On PC:",
      "Use the WASD keys to move your character around.Press the spacebar to jump over hurdles.Move your mouse to look around.M key to access to skin shopR key to refresh your positionQ key to mute/unmute soundsHit the Escape key to pause or access the menu.",
      "On Mobile:",
      "Use the joystick on the left side to move your character around.Swipe on the right side to control the camera view.Tap the jump button in the bottom-right corner to leap over obstacles.Access the menu or pause by tapping the button in the top-left corner."
    ],
    "howToPlay": "As you load the game, you'll see four different mods: classic, car, bike and ball obstacle courses.Pick one and get playing. Run, drive or climb and jump over hurdles to reach the last flag. If you fall off from the platform, you'll start from the previous checkpoint.You can track how much of the courses you completed on the main menu.",
    "tips": "",
    "developer": "",
    "similarGames": []
  },
  "fullContent": "Home› ParkourRainbow Obby ParkourBy OnlineGames.ioMake Game Full ScreenRainbow Obby Parkour is a platformer game that has the wackiest, most colorful obstacle courses ever. With four hilariously fun modules that'll keep you on your toes (or wheels or ball, depending on the level). It's like Roblox's greatest hits wrapped up in one wild ride. And you can dive into it play right here on OnlineGames.io for free!ControlsOn PC:Use the WASD keys to move your character around.Press the spacebar to jump over hurdles.Move your mouse to look around.M key to access to skin shopR key to refresh your positionQ key to mute/unmute soundsHit the Escape key to pause or access the menu.On Mobile:Use the joystick on the left side to move your character around.Swipe on the right side to control the camera view.Tap the jump button in the bottom-right corner to leap over obstacles.Access the menu or pause by tapping the button in the top-left corner.How To Play Rainbow Obby ParkourAs you load the game, you'll see four different mods: classic, car, bike and ball obstacle courses.Pick one and get playing. Run, drive or climb and jump over hurdles to reach the last flag. If you fall off from the platform, you'll start from the previous checkpoint.You can track how much of the courses you completed on the main menu.Obby, But Are You a Ball, Car or a Bike?Each of the game modes offers a different kind of challenge on Rainbow Obby Parkour. They are as follows:   Classic Obby: A good ol' throwback to classic Roblox parkour. It's all about timing your jumps and anticipating traps. Dodge traps, leap over obstacles and keep your cool as the platform cranks up the difficulty. You've got this... maybe.Car Obby: Strap in and brace yourself for insane tracks filled with sharp turns, crazy jumps, and more surprises than your favorite mystery movie. Can you drive your way to victory without flipping over? (Spoiler: probably not on the first try.)Bike Obby: Channel your inner stunt pro as you pedal, jump, and trick your way through a long and tough course. Don't forget to adjust your camera view strategically to plan your next move.Rolling Ball Obby: Become a rolling champion! Navigate tracks as a physics-defying ball, bouncing, zooming, and occasionally flinging yourself into the void. (Pro tip: watch out for the edges.) Here, speed is your friend, but control is your bestie. The best part is the ball looks like the head of your avatar. How wacky is that?More Roblox GamesNot only is Rainbow Obby Parkour a blast, but it's also free to play. Whether you're just looking for the perfect way to procrastinate or need a break between all your chores, OnlineGames.io is where it's at. Plus, if you're a fan of Roblox-like games online, this one is sure to hit the spot.So, are you ready to conquer every wacky course this game throws at you? Jump in now and show the world what you've got! 🌈This article was updated on January 9, 20253DActionArcadeCrazyFreeMobileParkourPhysicsRobloxRunning",
  "extractedAt": "2025-06-10T05:04:06.015Z",
  "localThumbnail": "Rainbow Obby Parkour_1749531846015.jpg"
}