{
  "url": "https://www.onlinegames.io/rebel-forces/",
  "title": "Rebel Forces",
  "category": "/t/action/",
  "thumbnail": "https://www.onlinegames.io/media/posts/75/Rebel-Forces-3.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/75/Rebel-Forces-3.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/75/responsive/Rebel-Forces-3-xs.jpg 384w, https://www.onlinegames.io/media/posts/75/responsive/Rebel-Forces-3-sm.jpg 600w, https://www.onlinegames.io/media/posts/75/responsive/Rebel-Forces-3-md.jpg 768w, https://www.onlinegames.io/media/posts/75/responsive/Rebel-Forces-3-lg.jpg 1200w",
    "alt": "Rebel Forces Free",
    "width": 256,
    "height": 256,
    "className": "",
    "parentClass": "post__featured-image"
  },
  "gameFrame": "https://unblocked-games.s3.amazonaws.com/games/rebel-forces/index.html",
  "content": {
    "headings": [],
    "controls": [],
    "howToPlay": "",
    "tips": "",
    "developer": "",
    "similarGames": []
  },
  "fullContent": "Home› ShootingRebel ForcesBy OnlineGames.ioMake Game Full Screen Get ready for action in Rebel Forces game.You have the opportunity to live your dream being a soldier who eliminates the enemies.The game offers you weapons and armor to help you in the battle zone.In the weapon section, you are provided with a range of purchasable and upgradable weapons which are unlocked at different levels.Rebel Forces Weapons are:• Deagle • Smg• Flamethrower• Shotgun• Minigun • Revolver • Slugger • Thompson Smg• Sniper • HMG• GrenadeIn the Armor Section, you are provided with a range of purchasable equipment that propects you from the bullet attacks.• Watchdog Armor • Hellbound Armor • Undefeated Armor• Night Armor• Supreme Armor • Death Mask • Cataclysm Mask • Domm Squad Mask• Unforgiven Mask• Vanquisher MaskProfile SectionIn the Profile Section you will see the following details:• Level• Xp• Kills• MoneyDont forget to collect the daily gift reward !The game also has a daily reward feature which gifts players cash and XP every 24 hours, also as your player level increases you get cash rewards, be sure to claim yours.Rebel Forces GameplayThe gameplay is intense as players are deployed into a map to battle and the player with the highest number of kills wins the match. You never know when your opponents may come, so keep moving, aim cautiously, and be vigilant.Special feature in the gameplay is the ability to pick up enemies’ weapons after knock down.In Campaign section you are offered a variety of missions with different objectives. In level 1, you have 3 active missions to choose from.Mission 1 is to win a death match; in this mission 6 players are deployed to battle and the first player with 15 kills wins the match.Mission 2 is to eliminate 3 enemies; in this mission, your objective is to eliminate 3 enemies to pass the mission. However, if your player kills 2 enemies and gets knocked down, you must restart the mission. So ensure you get that 3 kill streak to complete the mission.Mission 3 is to survive for 50 seconds; in this mission you have to survive for 50 seconds and the player’s movement and speed is reduced. To survive, either you take down your enemies or you find cover for 50 seconds.Rewards for completion are $250 and 1000 XP each.In level 2, the active missions are quite the same only that some active missions are still level 1 difficulty with the same cash and XP reward. But level 2 difficulty has a cash price of $300 and 1100 XP.Rebel Forces Level 2 active missions are:• Win a death match (level 1 difficulty)• Eliminate 3 enemies (level 1 difficulty)• Win a death match (level 2 difficulty)Rebel Forces Level 3 active missions are:• Win a death match (level 3 difficulty)• Eliminate 3 enemies (level 1 difficulty)• Survive for 50 seconds (level 1 difficulty)There are several fascinating missions and objectives to enjoy in this game, which will provide you with a realistic sense of being on the battlefield.Online PvP ModeIn online PvP mode, a player can choose either to create a room or join an existing room. When creating a room, you get to choose the level and mode to play from. You can choose to select if you Speed x2, Jump force x2 and Armor x2. 16 is the maximum number of players that can join a room.Rebel Forces Levels are:• Garrison• Outpost • FactoryX• Towers• GasPlant• ArenaRebel Forces Modes are:• FFA• Teams• DoomsdayRebel Forces Display includes:• Kill feed (displayed on the top left)• HP and ammo (displayed on the bottom right)• Radar (displayed on the top right)Controls:WASD or arrow keys to moveLeft click to shootRight click to aimR to reloadMouse wheel to cycle through weaponsSpace to jumpF to pick up a weaponTab to toggle pause menuThis article was updated on December 20, 20233DActionArmorBattleBattle RoyaleFirst Person ShooterFreeGunMultiplayerShootingUnityWarWeapon",
  "extractedAt": "2025-06-10T05:05:58.499Z",
  "localThumbnail": "Rebel Forces_1749531958499.jpg"
}