{
  "url": "https://www.onlinegames.io/red-light-green-light/",
  "title": "Red Light Green Light",
  "category": "/t/action/",
  "thumbnail": "https://www.onlinegames.io/media/posts/1017/red-light-green-light.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/1017/red-light-green-light.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/1017/responsive/red-light-green-light-xs.jpg 384w, https://www.onlinegames.io/media/posts/1017/responsive/red-light-green-light-sm.jpg 600w, https://www.onlinegames.io/media/posts/1017/responsive/red-light-green-light-md.jpg 768w, https://www.onlinegames.io/media/posts/1017/responsive/red-light-green-light-lg.jpg 1200w",
    "alt": "Red Light Green Light Play Online",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://html5.gamedistribution.com/788f89d325d840f391139ce0e1212c46/?gd_sdk_referrer_url=https://www.onlinegames.io/red-light-green-light/",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "How to Play Red Light Green Light"
      },
      {
        "type": "h3",
        "text": "Tips & Tricks for Red Light, Green Light"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "Similar Games"
      }
    ],
    "controls": [
      "PC:Hold the Left Mouse Button or Spacebar to runRelease to stop when the doll turnsMobile:Tap and hold to move, release to stop"
    ],
    "howToPlay": "Start by entering your name to join the round.Line up with dozens of other players, all dressed in green tracksuits with their unique numbers.When the doll looks away, run toward the red line by tapping and holding. The moment she turns back release the tap and freeze instantly.If you get caught moving during \"Red Light,\" and you're eliminated on the spot.Make it to the finish line within the time limit to win and play the next round until you win the big prize. If you want to stand out from the crowd, unlock different hats and headgears in the shop.",
    "tips": "Watch the doll's head closely; her body starts turning a second before she says, \"Red Light.\"Stay calm when the timer is close to running out. Panic leads to mistakes.Don't try to sprint the whole way. Stop-start rhythm is your best strategy.Save up your coins to unlock cool hats that make your player stand out!",
    "developer": "This game is a fan-made experience created in the spirit of Squid Game, designed for quick, casual fun. With a clean design and responsive movement, it's easy to pick up and play on your browser.",
    "similarGames": [
      {
        "title": "Squid Shooter",
        "url": "https://www.onlinegames.io/squid-shooter/"
      }
    ]
  },
  "fullContent": "Home› RunningRed Light Green LightBy OnlineGames.ioMake Game Full ScreenRed Light Green Light is a game from the famous TV series Squid Game, and it is definitely one of the most iconic scenes. In this children game, players stand behind a starting line and must reach a finish line at the far end of the field. A giant, creepy doll stands at the finish line. It turns its back to the players and says \"Green light!\" This means players can move. Then, when it suddenly says \"Red light!\" and turns around. And players must freeze immediately. If the doll sees someone still moving during \"Red light,\" that player is eliminated (and in Squid Game, elimination is done by shooting the player).In this online video game version of Red Light Green Light on OnlineGames.io, you'll be put in the tracksuit of a numbered contestant and dropped into a deadly playground. Movement can mean either survival or death. Nothing in between. So hit the play button and enjoy the same thrill 456 lived in the first episode!ControlsPC:Hold the Left Mouse Button or Spacebar to runRelease to stop when the doll turnsMobile:Tap and hold to move, release to stopHow to Play Red Light Green LightStart by entering your name to join the round.Line up with dozens of other players, all dressed in green tracksuits with their unique numbers.When the doll looks away, run toward the red line by tapping and holding. The moment she turns back release the tap and freeze instantly.If you get caught moving during \"Red Light,\" and you're eliminated on the spot.Make it to the finish line within the time limit to win and play the next round until you win the big prize. If you want to stand out from the crowd, unlock different hats and headgears in the shop.Tips & Tricks for Red Light, Green LightWatch the doll's head closely; her body starts turning a second before she says, \"Red Light.\"Stay calm when the timer is close to running out. Panic leads to mistakes.Don't try to sprint the whole way. Stop-start rhythm is your best strategy.Save up your coins to unlock cool hats that make your player stand out!DeveloperThis game is a fan-made experience created in the spirit of Squid Game, designed for quick, casual fun. With a clean design and responsive movement, it's easy to pick up and play on your browser.Similar GamesIf you liked the tension and timing of Red Light Green Light, check out Squid Shooter on OnlineGames.io. It brings the Squid Game characters with a goofy style. Feel free to explore all other popular free games on our site. This article was updated on May 29, 20251 Player3DActionAvoidCrazyFreeFunMobileRunning",
  "extractedAt": "2025-06-10T04:10:12.555Z",
  "localThumbnail": "Red Light Green Light_1749528612556.jpg"
}