{
  "url": "https://www.onlinegames.io/run-3-space/",
  "title": "Run 3 Space",
  "category": "/new-games/",
  "thumbnail": "https://www.onlinegames.io/media/posts/579/Run-3-Space.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/579/Run-3-Space.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/579/responsive/Run-3-Space-xs.jpg 384w, https://www.onlinegames.io/media/posts/579/responsive/Run-3-Space-sm.jpg 600w, https://www.onlinegames.io/media/posts/579/responsive/Run-3-Space-md.jpg 768w, https://www.onlinegames.io/media/posts/579/responsive/Run-3-Space-lg.jpg 1200w",
    "alt": "Run 3 Space Free Online Game",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2023/construct/192/run-3-space/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "How to Play Run 3 Space"
      },
      {
        "type": "h3",
        "text": "Characters in Run 3 Space"
      },
      {
        "type": "h3",
        "text": "Free-Style Running"
      },
      {
        "type": "h2",
        "text": "FAQ"
      },
      {
        "type": "h3",
        "text": "When will the blue portal be visible?"
      },
      {
        "type": "h3",
        "text": "Are the light beams coming towards the spaceman in the tunnel harmful?"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Other Arcade Games"
      }
    ],
    "controls": [
      "To move the spaceman, use the A and D keys or the left and right arrow keys.To jump, press the Space key or the upper arrow key.Hold the Space key to jump higher."
    ],
    "howToPlay": "Help this galactic runner reach the blue portal at the end of the tunnel! There are 30 unique levels in the game. Overcome the obstacles in each level one by one and get to the next level. In order to pass a level, you must get the spaceman to the portal safely. Collecting diamonds on the road while running is also helpful in changing your spaceman's character.",
    "tips": "",
    "developer": "",
    "similarGames": []
  },
  "fullContent": "Home› EndlessRun 3 SpaceBy OnlineGames.ioMake Game Full ScreenRun 3 Space is a 3D arcade game where you help the spaceman run through the tunnel with obstacles on a galactical dimension. You need to guide this spaceman through the tunnel and bring him to the blue portal at the end of the platform. But you need to pay attention to the tiles on the platform. You will see gaps in some places. You need to avoid these gaps skillfully in this endless arcade game.How to Play Run 3 SpaceHelp this galactic runner reach the blue portal at the end of the tunnel! There are 30 unique levels in the game. Overcome the obstacles in each level one by one and get to the next level. In order to pass a level, you must get the spaceman to the portal safely. Collecting diamonds on the road while running is also helpful in changing your spaceman's character.Characters in Run 3 SpaceThere are 6 different amusing characters you can get. You can access the first character for free at the beginning of the game, but the other 5 characters can cost between 500 and 4000 diamonds.Free-Style RunningThis game offers you a level-up adventure, but it also has a mode where you can run endlessly so that you can challenge yourself and break your own record every time.When you come to the level selection screen, you can do free-style running by clicking on the double flag icon below. For your information, you need to pay extra attention to the tiles as you proceed here. Because some tiles in the tunnel may suddenly disappear while you are on them. You will be lost in the endless darkness of space if you fall off!FAQWhen will the blue portal be visible?As the spaceman moves through the tunnel, you will see a blue bar on the left side of the game screen. When you reach the end of this bar, you can see the blue portal at the end of the tunnel.Are the light beams coming towards the spaceman in the tunnel harmful?No, not at all. Contact with these light beams does not cause any damage to the spaceman. These beams are the natural state of space. Let the spaceman run with the shooting stars!ControlsTo move the spaceman, use the A and D keys or the left and right arrow keys.To jump, press the Space key or the upper arrow key.Hold the Space key to jump higher.Other Arcade GamesIf you enjoy playing Run 3 Space, you should definitely try X Trench Run. In this arcade game, the player controls a spacecraft while attempting to avoid several hazards and potential collisions. This platform moves along extremely quickly. You must trust your instincts. It won't be simple to navigate a spacecraft through the immensity of space.For more game options, look for other arcade games online. Choose the one that appeals to you best among dozens of games that you can play and enjoy!Embed URL:https://www.onlinegames.io/games/2023/construct/192/run-3-space/index.htmlThis article was updated on January 28, 20251 Player3DArcadeAvoidCrazyEmbeddableEndlessFreeHTML5MobileSkillSpace",
  "extractedAt": "2025-06-10T06:16:10.578Z",
  "localThumbnail": "Run 3 Space_1749536170578.jpg"
}