{
  "url": "https://www.onlinegames.io/run-away-3/",
  "title": "Run Away 3",
  "category": "/t/action/",
  "thumbnail": "https://www.onlinegames.io/media/posts/733/Run-Away-3.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/733/Run-Away-3.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/733/responsive/Run-Away-3-xs.jpg 384w, https://www.onlinegames.io/media/posts/733/responsive/Run-Away-3-sm.jpg 600w, https://www.onlinegames.io/media/posts/733/responsive/Run-Away-3-md.jpg 768w, https://www.onlinegames.io/media/posts/733/responsive/Run-Away-3-lg.jpg 1200w",
    "alt": "Run Away 3 Play Online",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://html5.gamedistribution.com/72b93213518244a5b9160348a91ec194/?gd_sdk_referrer_url=https://www.onlinegames.io/run-away-3/",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "About Run Away 3"
      },
      {
        "type": "h2",
        "text": "Game Modes of Run Away 3"
      },
      {
        "type": "h3",
        "text": "Explore Mode"
      },
      {
        "type": "h3",
        "text": "Infinite Mode"
      },
      {
        "type": "h2",
        "text": "Names of the New Aliens"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "Similar Running Games"
      }
    ],
    "controls": [
      "A/D or Left/Right Arrows: Steer Left and RightW/Upper Arrow/Spacebar: JumpHold Down W or Up Arrow: Jump Higher"
    ],
    "howToPlay": "",
    "tips": "",
    "developer": "GM Media developed Run Away 3.",
    "similarGames": [
      {
        "title": "Run 3 Space",
        "url": "https://www.onlinegames.io/run-3-space/"
      }
    ]
  },
  "fullContent": "Home› SpaceRun Away 3By OnlineGames.ioMake Game Full ScreenAre you ready to run unlimitedly in space as a little alien? Run Away 3 is a 3D running game where you run endlessly as an extraterrestrial in a galactic tunnel full of hazards.Strive to dodge all the obstacles coming your way by steering your alien left or right or making it jump. Take your part in the Explore Mode or run without limit in the Infinite mode in this arcade game!ControlsA/D or Left/Right Arrows: Steer Left and RightW/Upper Arrow/Spacebar: JumpHold Down W or Up Arrow: Jump HigherAbout Run Away 3In this running game, you will find yourself in outer space in the shoes of a cute alien.Your main objective is to move forward in the galactic tunnel by avoiding its obstacles.There are lots of holes and falling tiles in this tunnel. You must maneuver your character quickly when you encounter one of them.If you fall through the gaps, you must start running from the beginning, which resets your score!So, your ultimate job is to overcome these obstacles by steering your character from left to right or making it jump in this arcade game.On the other hand, you will earn coins while trying to move forward on the tunnel. Use them to unlock new alien skins for your cute extraterrestrial.Game Modes of Run Away 3This arcade game offers you two game modes: Explore Mode and Infinite Mode.Explore ModeIn the Explore Mode, you will advance level by level. In later levels, you will see falling tiles that look like dry lands. When stepped on, these tiles begin to fall into space. You must avoid getting in touch with them no matter what!Infinite ModeOn the other hand, the Infinite Mode has no leveling system. You are free to run on the platform endlessly. Try to beat your own highest score each time you start running. However, keep in mind that the platforms change with each attempt. You will encounter various platforms in different colors and obstacles.Names of the New AliensHalloween StickmanLady SkaterWinter SkaterChild StickmanStick RabbitLazymanWinter Lady SkaterGhost StickmanPriestScientistDuplicate StickmanAngel StickmanStickman PirateAristocratDeveloperGM Media developed Run Away 3.Similar Running GamesRun 3 Space may also draw your attention if you like playing Run Away 3. In the game, you need to help a galactic runner to reach the blue portal at the end of the tunnel. Try not to fall your spaceman into space!For more gaming options, you may look for other online running games on OnlineGames.io. Additionally, keep coming back to discover new and thrilling online games! We are constantly trying to offer new games to our players on our site.This article was updated on May 9, 20241 Player3DActionArcadeAvoidCrazyEndlessFreeRunningSpace",
  "extractedAt": "2025-06-10T04:15:00.347Z",
  "localThumbnail": "Run Away 3_1749528900348.jpg"
}