{
  "url": "https://www.onlinegames.io/shopping-mania/",
  "title": "Shopping Mania",
  "category": "/new-games/",
  "thumbnail": "https://www.onlinegames.io/media/posts/636/Shopping-Mania.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/636/Shopping-Mania.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/636/responsive/Shopping-Mania-xs.jpg 384w, https://www.onlinegames.io/media/posts/636/responsive/Shopping-Mania-sm.jpg 600w, https://www.onlinegames.io/media/posts/636/responsive/Shopping-Mania-md.jpg 768w, https://www.onlinegames.io/media/posts/636/responsive/Shopping-Mania-lg.jpg 1200w",
    "alt": "Shopping Mania Free Online Game",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://html5.gamedistribution.com/06af659e3820483f866bc3800c66a3b9/?gd_sdk_referrer_url=https://www.onlinegames.io/shopping-mania",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "How to Play Shopping Mania"
      },
      {
        "type": "h3",
        "text": "Get Discounted Products"
      },
      {
        "type": "h3",
        "text": "Home Decorations"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "Similar Games"
      }
    ],
    "controls": [
      "Mouse or touchscreen: Navigate and interact"
    ],
    "howToPlay": "The calendar shows the month of November. The awaited moment has come.Every girl in the world has been waiting for Black Friday to take advantage of all the discounts!After getting ready, take your dearest friend Kendall Jenner with you to the mall. She will give you advice on what to buy.Your first task is getting new outfits and cosmetics! Buying new decoration items for your home will be the following task.",
    "tips": "",
    "developer": "Shopping Mania was developed by Gamerina.",
    "similarGames": [
      {
        "title": "Spend Elon Musk Money",
        "url": "https://www.onlinegames.io/spend-elon-musk-money/"
      }
    ]
  },
  "fullContent": "Home› FashionShopping ManiaBy OnlineGames.ioMake Game Full ScreenShopping Mania is a fun dress up game where you go to the mall with Kendall Jenner on Black Friday to buy new stuff. You will purchase dressings and home decorations to create a new atmosphere. And this November is the perfect time for shopping. Do your make-up and get ready, we are going to the mall in this girl game!How to Play Shopping ManiaThe calendar shows the month of November. The awaited moment has come.Every girl in the world has been waiting for Black Friday to take advantage of all the discounts!After getting ready, take your dearest friend Kendall Jenner with you to the mall. She will give you advice on what to buy.Your first task is getting new outfits and cosmetics! Buying new decoration items for your home will be the following task.Get Discounted ProductsWhen you arrive at the shopping center, the time will count down! You have to pick designated products as soon as possible. You can view their icons at the bottom of the screen. When you see these products on the shelves, you should buy them immediately. Otherwise, someone else can take them. You will be given a minute. Try to have all the products with discounting labels within this limited time.Home DecorationsIt is time to shop for your home! Redecorating your home will bring fresh air to your life. Change can be refreshing. Give a shape to your interior first with the items you have. After you have done your job, we will go to the mall for the home products. Get yourself new curtains, wall decorations and couches. Grab what you can from the shelves in a short time. Then, you can start placing the newly purchased items in your home.ControlsMouse or touchscreen: Navigate and interactDeveloperShopping Mania was developed by Gamerina.Similar GamesIf you are a fan of Shopping Mania, you may also like Spend Elon Musk Money. You have access to all the money that this rich man has in the game. You can freely spend this money on whatever you want. Purchase the most expensive perfumes in the world, or get yourself a Nasa Spacesuit! The choice is yours.This article was updated on February 13, 20241 Player2DCrazyDress UpFashionFreeGirlHTML5KidsMobileMouse",
  "extractedAt": "2025-06-10T06:13:04.907Z",
  "localThumbnail": "Shopping Mania_1749535984908.jpg"
}