{
  "url": "https://www.onlinegames.io/skateboard-marathon/",
  "title": "Skateboard Marathon",
  "category": "/t/sports/",
  "thumbnail": "https://www.onlinegames.io/media/posts/518/Skateboard-Marathon.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/518/Skateboard-Marathon.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/518/responsive/Skateboard-Marathon-xs.jpg 384w, https://www.onlinegames.io/media/posts/518/responsive/Skateboard-Marathon-sm.jpg 600w, https://www.onlinegames.io/media/posts/518/responsive/Skateboard-Marathon-md.jpg 768w, https://www.onlinegames.io/media/posts/518/responsive/Skateboard-Marathon-lg.jpg 1200w",
    "alt": "Skateboard Marathon Play Online",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2022/unity3/skateboard-marathon/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Skateboarding as a Sport"
      },
      {
        "type": "h2",
        "text": "How to Play Skateboard Marathon"
      },
      {
        "type": "h3",
        "text": "Choose Your Avatar"
      },
      {
        "type": "h3",
        "text": "Perform Tricks on the board"
      },
      {
        "type": "h3",
        "text": "Switch to Crazy Track"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "What is More?"
      }
    ],
    "controls": [
      "Use the WASD or the Arrow keys to move your skater.Press the Space key to make your skater jump."
    ],
    "howToPlay": "In fact, to play this game, all you have to do is decide whether you want to play as multiplayer or single-player. Then, after choosing your skater avatar, you can start skating freely.You can play this game with your friends, family or other online players.",
    "tips": "Caramel Mountains is an ideal place for performing radical maneuvers on the platform. You can try different moves, especially by using the iron railings on it. You can also use ramps to make big jumps. Apart from that, what you can try while skateboarding is up to your creativity.",
    "developer": "",
    "similarGames": []
  },
  "fullContent": "Home› SkateboardingSkateboard MarathonBy OnlineGames.ioMake Game Full ScreenSkateboard Marathon is a 3D racing game where you slide with your board on a platform. Maximize your gaming pleasure by making your skater perform eccentric movements and maneuvers. Once you find your balance point, you can try anything on a skateboard. Just hop on your board and enjoy the game!Skateboarding as a SportSkateboarding is a really cool action sport that originated in America. Skaters use a board to perform various maneuvers and tricks, and there are even skateparks built specifically for this sport! Skateboarding has become increasingly popular all around the USA, and there's even a magazine called Skateboarder dedicated to covering this awesome sport.So, why not give it a try Skateboarding online, where there is a much lower risk of breaking any bones? Who knows, you might just fall in love with it!How to Play Skateboard MarathonIn fact, to play this game, all you have to do is decide whether you want to play as multiplayer or single-player. Then, after choosing your skater avatar, you can start skating freely.You can play this game with your friends, family or other online players.Choose Your AvatarBefore starting, you can proceed by choosing the one that appeals to you most among the avatars that Skateboard Marathon offers you.You will find many different characters here. It will be very enjoyable to skate with them. You can even make a giant blue avatar using a board.Perform Tricks on the boardCaramel Mountains is an ideal place for performing radical maneuvers on the platform. You can try different moves, especially by using the iron railings on it. You can also use ramps to make big jumps. Apart from that, what you can try while skateboarding is up to your creativity.Switch to Crazy TrackTo change the platform, you must successfully complete Caramel Mountains by reaching the finish line. Ride your board and make your way to the finish. The next platform, Crazy Track, looks forward to welcoming you.If you lose control and fall off the platform, don't worry; the game will automatically guide you back to the platform.ControlsUse the WASD or the Arrow keys to move your skater.Press the Space key to make your skater jump.What is More?Try Bus Subway Runner, where you are running from a policeman on the railway if you enjoy playing Skateboard Marathon. Or, you can look for other racing game collections on OnlineGames.io for further options. It is possible to access quality content on our platform with just one click. Stay connected, you will always find new games!Embed URL:https://www.onlinegames.io/games/2022/unity3/skateboard-marathon/index.htmlThis article was updated on May 9, 20243DEmbeddableFreeFunMultiplayerPixelRacingSimulatorSkateboardingSportsUnity",
  "extractedAt": "2025-06-10T05:54:15.793Z",
  "localThumbnail": "Skateboard Marathon_1749534855794.jpg"
}