{
  "url": "https://www.onlinegames.io/skater-girl/",
  "title": "Skater Girl",
  "category": "/t/running/",
  "thumbnail": "https://www.onlinegames.io/media/posts/618/Skater-Girl.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/618/Skater-Girl.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/618/responsive/Skater-Girl-xs.jpg 384w, https://www.onlinegames.io/media/posts/618/responsive/Skater-Girl-sm.jpg 600w, https://www.onlinegames.io/media/posts/618/responsive/Skater-Girl-md.jpg 768w, https://www.onlinegames.io/media/posts/618/responsive/Skater-Girl-lg.jpg 1200w",
    "alt": "Skater Girl Free Online Game",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://html5.gamedistribution.com/b1412215c7494027a821b21ce4f49d6d/?gd_sdk_referrer_url=https://www.onlinegames.io/skater-girl",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "How to Play Skater Girl"
      },
      {
        "type": "h3",
        "text": "Vehicles in Motion"
      },
      {
        "type": "h3",
        "text": "Unlock New Characters"
      },
      {
        "type": "h3",
        "text": "Power-ups in Skater Girl"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "What is More?"
      }
    ],
    "controls": [
      "To navigate the skateboard, use the WASD keys or the Arrow keys.On tablets and mobile devices, use the touchscreen."
    ],
    "howToPlay": "You are a skater lady on a two-way road. There are many obstacles on the road which can affect you negatively.If you can’t avoid the objects on the road, you will fall from your skateboard, resulting in a game over. So, try to overcome each challenge by navigating your skateboard skillfully.Jump over the objects or pass them by bending. Go as far as possible, and remember to collect coins on the road!",
    "tips": "",
    "developer": "Skater Girl is developed by FreezeNova.",
    "similarGames": []
  },
  "fullContent": "Home› SkateboardingSkater GirlBy OnlineGames.ioMake Game Full Screen Skater Girl is a 3D skateboarding game where you navigate your character on the road with many obstacles. You will encounter many potholes, tin cans, and collapsible barriers. There will even be cars coming towards you.Avoid crashing with any of them, and try to cover as much distance as possible. Reach the highest score possible in one of the most challenging skateboard games!🛹How to Play Skater GirlYou are a skater lady on a two-way road. There are many obstacles on the road which can affect you negatively.If you can’t avoid the objects on the road, you will fall from your skateboard, resulting in a game over. So, try to overcome each challenge by navigating your skateboard skillfully.Jump over the objects or pass them by bending. Go as far as possible, and remember to collect coins on the road!Vehicles in MotionIn addition to encountering potholes, barriers, boxes, and other kinds of stuff on the road, vehicles are also in motion.Be careful while passing near them as they may throw you something, such as a pothole. Or, you may crash with one of them. It won’t be good if such cases arise. Because they make you stumble and fall.Unlock New CharactersYou can use your collected coins to unlock new skater ladies. There are four characters: Laura, Jessica, Carolyn and Olivia. Laura is your skater’s name. The other three skater girls are at your disposal. Each skater has a different colored jacket on. Select your favorite one and be the ruler of the roads!Power-ups in Skater GirlPower-ups are also accessible in the Store section from the main menu. Magnet Power, Multiplier, Shield Power and Boost Power are there for you to enhance your gaming experience in the game.Magnet Power: Increasing your magnet power helps you collect every coin on the road while you are moving.Multiplier: It multiplies the number of coins you collect.Shield Power: It prevents you from colliding with anything.Boost Power: It helps you to move faster.ControlsTo navigate the skateboard, use the WASD keys or the Arrow keys.On tablets and mobile devices, use the touchscreen.DeveloperSkater Girl is developed by FreezeNova.What is More?If you enjoy playing Skater Girl, you may also try Skateboard Master. Make progress on the tube parkour with your skateboard in the game by overcoming the obstacles on the road. There will be other skateboarders besides you trying to get ahead of you. Don’t let them.Additionally, you may look up other running games on OnlineGames.io for further game options by following the link. Keep coming back; you will always find new and thrilling games on the site!This article was updated on March 18, 20241 Player3DArcadeAvoidCrazyEndlessFreeParkourRunningSkateboardingSportsTrafficUnity",
  "extractedAt": "2025-06-10T05:51:18.547Z",
  "localThumbnail": "Skater Girl_1749534678547.jpg"
}