{
  "url": "https://www.onlinegames.io/skibidi-toilet-shooting/",
  "title": "Skibidi Toilet Shooting",
  "category": "/t/action/",
  "thumbnail": "https://www.onlinegames.io/media/posts/782/Skibidi-Toilet-Shooting.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/782/Skibidi-Toilet-Shooting.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/782/responsive/Skibidi-Toilet-Shooting-xs.jpg 384w, https://www.onlinegames.io/media/posts/782/responsive/Skibidi-Toilet-Shooting-sm.jpg 600w, https://www.onlinegames.io/media/posts/782/responsive/Skibidi-Toilet-Shooting-md.jpg 768w, https://www.onlinegames.io/media/posts/782/responsive/Skibidi-Toilet-Shooting-lg.jpg 1200w",
    "alt": "Skibidi Toilet Shooting Play Online",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2024/gm/games7/skibidi-toilet-shooting/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Overview of Skibidi Toilet Shooting"
      },
      {
        "type": "h3",
        "text": "Keep Your Distance"
      },
      {
        "type": "h3",
        "text": "Eliminate 25 Skibidis"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "You May Also Like"
      }
    ],
    "controls": [
      "WASD or Arrow Keys: MoveLeft-Click: ShootRight-Click: AimSpacebar: JumpLeft-Shift: RunT: Slow MotionR: ReloadG: GrenadeV: MeleeH: Stand TallTab: PauseMouse Scroll: Switch Weapons"
    ],
    "howToPlay": "",
    "tips": "",
    "developer": "G55 developed Skibidi Toilet Shooting.",
    "similarGames": []
  },
  "fullContent": "Home› Skibidi ToiletSkibidi Toilet ShootingBy OnlineGames.ioMake Game Full ScreenYour most important mission is to destroy all the Skibidi Toilets! Skibidi Toilet Shooting is a 3D shooting game where you fight with many heads popping out of the toilets. They are trying to invade the metropolitan city that you live in.Your job is to survive their attacks as a soldier and clear them all from your homeland. Keep in mind that they outnumber you! You must proceed carefully in this action game to survive.ControlsWASD or Arrow Keys: MoveLeft-Click: ShootRight-Click: AimSpacebar: JumpLeft-Shift: RunT: Slow MotionR: ReloadG: GrenadeV: MeleeH: Stand TallTab: PauseMouse Scroll: Switch WeaponsOverview of Skibidi Toilet ShootingBefore they headbutt you, you must eliminate all the Skibidi Toilets coming towards you. Once they spot you, they will run to you nonstop. Remember that you are alone in this huge city, and you need to learn to protect yourself.In the beginning, you will have a gun in your hand. As you make progress, you will unlock new kinds of weapons. Destroy as many skibidis as you need to level up in this first-person shooter game.Keep Your DistanceIn Skibidi Toilet Shooting, you will encounter many toilet heads. The best strategy is to keep your distance and eliminate them from afar. Additionally, you will have a few grenades at your disposal.When they get too crowded, you can use your grenade to destroy more than one of them with a single shot. We recommend that you wait for the best time to throw the grenade because you have a limited number of them.Eliminate 25 SkibidisYou must take down 25 toilet heads from the city streets at each level. Otherwise, you cannot pass to the next level. There are ten challenging levels, each with unique weapons ranging from a shotgun to a M4A1.At level two, you will get a helmet. Luckily, this will protect you from headbutts a bit! Moreover, you can use the weapons you acquired at the previous level by scrolling your mouse at each level. DeveloperG55 developed Skibidi Toilet Shooting.You May Also LikePlaying Time Shooter may also be of interest to you. In the game, you will be face-to-face with red enemies. They are made of glass. When you shoot them down, they will shatter into a million pieces!For additional options, look up other online Skibidi Toilet games on OnlineGames.io. We are constantly trying to expand our game range. Please contact us if you have any suggestions or a wishlist!This article was updated on July 4, 20241 Player3DActionBattleCrazyFreeFunFunnyGunShootingSkibidi ToiletUnityWeapon",
  "extractedAt": "2025-06-10T05:02:37.381Z",
  "localThumbnail": "Skibidi Toilet Shooting_1749531757382.jpg"
}