{
  "url": "https://www.onlinegames.io/skibidi-toilet-io/",
  "title": "Skibidi Toilet io",
  "category": "/t/arcade/",
  "thumbnail": "https://www.onlinegames.io/media/posts/540/Skibidi-Toilet.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/540/Skibidi-Toilet.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/540/responsive/Skibidi-Toilet-xs.jpg 384w, https://www.onlinegames.io/media/posts/540/responsive/Skibidi-Toilet-sm.jpg 600w, https://www.onlinegames.io/media/posts/540/responsive/Skibidi-Toilet-md.jpg 768w, https://www.onlinegames.io/media/posts/540/responsive/Skibidi-Toilet-lg.jpg 1200w",
    "alt": "Skibidi Toilet io Free Online Game",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2023/construct/242/skibidi-toilet-io/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "What is Skibidi Toilet?"
      },
      {
        "type": "h2",
        "text": "How to Play Skibidi Toilet io?"
      },
      {
        "type": "h2",
        "text": "Tips for Skibidi Toilet io"
      },
      {
        "type": "h2",
        "text": "Play with a Friend"
      },
      {
        "type": "h2",
        "text": "Desktop Controls"
      },
      {
        "type": "h2",
        "text": "Mobile Controls"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "More Crazy Games"
      }
    ],
    "controls": [
      "Player 1 Controls: Use the WASD keys to move.Player 2 Controls: Use the Arrow keys to move."
    ],
    "howToPlay": "Select the head of your character and get into to fight immediately!Your aim is to stay on the platform as long as possible.Use arrow keys or drag your mouse to move around.Collect toilet rolls and red peppers on your way to gain XP.Try to push other toilets down. Every kill will bring you points according to the enemies' size.If you fall off the arena you should start over.",
    "tips": "Pay attention to the holes on the platform where you can fall down.If a tile is flashing, it will soon disappear, creating a hole. Avoid the spikes that throw you away when you touch.Try to stay away from the edges so that you can be safer in the center.",
    "developer": "Skibidi Toilet io was created by Zupga.",
    "similarGames": []
  },
  "fullContent": "Home› Skibidi ToiletSkibidi Toilet ioBy OnlineGames.ioMake Game Full ScreenHave you ever heard of a game called Skibidi Toilet io? It's a rather absurd concept - a battle royale game where toilets run around like crazy. The aim of the game is for the toilets to compete with each other by eating as much toilet paper and hot peppers as possible. As they consume more, they become bigger and stronger. Bigger toilets are able to push the smaller ones out of the platform. It's a hilarious and exciting game that will tickle your funny bones. If you're up for it, let's see if you can be the king of the toilets!What is Skibidi Toilet?Skibidi Toilet is a YouTube video series created by animator Alexey Gerasimov. In these short videos, heads popping out of toilets are fighting each other, bringing scary elements with a humorous sense. Skibidi Toilet short videos are loved by millions, so the idea behind them even inspired an io game.In the Skibidi Toilet io game, the player controls a toilet with a head popping out and fights in a battle royale on a platform to kick others out of the platform. To expand size and get stronger, toilets should eliminate more and more enemies besides consuming toilet paper and hot peppers.How to Play Skibidi Toilet io?Select the head of your character and get into to fight immediately!Your aim is to stay on the platform as long as possible.Use arrow keys or drag your mouse to move around.Collect toilet rolls and red peppers on your way to gain XP.Try to push other toilets down. Every kill will bring you points according to the enemies' size.If you fall off the arena you should start over.Tips for Skibidi Toilet ioPay attention to the holes on the platform where you can fall down.If a tile is flashing, it will soon disappear, creating a hole. Avoid the spikes that throw you away when you touch.Try to stay away from the edges so that you can be safer in the center.Play with a FriendYou can play Skibidi Toilet io with a friend on the same device. You can co-operate or play against each other on the arena! Learn 2 player controls below!Desktop ControlsPlayer 1 Controls: Use the WASD keys to move.Player 2 Controls: Use the Arrow keys to move.Mobile ControlsTouch the left side of the screen to move player 1Touch the right side of the screen to move player 2DeveloperSkibidi Toilet io was created by Zupga.More Crazy GamesIf you like absurd games online, give a shot to Snow War io, where you play as a snow plower and make giant snowballs to push your enemies. Or else, browse crazy games tag for a broader selection of free online games. Let us know your thoughts on this game in the comment box below!Embed URL:https://www.onlinegames.io/games/2023/construct/242/skibidi-toilet-io/index.htmlThis article was updated on July 4, 20242 Player3DArcadeArenaCo-OpCrazyEmbeddableFreeFunFunnyHexagonio GamesMobileSkibidi Toilet",
  "extractedAt": "2025-06-10T05:18:39.776Z",
  "localThumbnail": "Skibidi Toilet io_1749532719776.jpg"
}