{
  "url": "https://www.onlinegames.io/sort-resort/",
  "title": "Sort Resort",
  "category": "/t/arcade/",
  "thumbnail": "https://www.onlinegames.io/media/posts/977/sort-resort.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/977/sort-resort.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/977/responsive/sort-resort-xs.jpg 384w, https://www.onlinegames.io/media/posts/977/responsive/sort-resort-sm.jpg 600w, https://www.onlinegames.io/media/posts/977/responsive/sort-resort-md.jpg 768w, https://www.onlinegames.io/media/posts/977/responsive/sort-resort-lg.jpg 1200w",
    "alt": "Sort Resort Liquid Sorting Puzzle Online",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://html5.gamedistribution.com/5a6964fb2e934aa0a8cd594242689092/?gd_sdk_referrer_url=https://https://www.onlinegames.io/sort-resort/",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "How to Play Sort Resort"
      },
      {
        "type": "h2",
        "text": "More Relaxing Puzzle Games"
      }
    ],
    "controls": [
      "On Computer:",
      "Click a flask to pick it upClick another flask to pour the top liquid into it",
      "On Mobile:",
      "Tap to select a flaskTap another flask to pour into it"
    ],
    "howToPlay": "Start with a bunch of flasks filled with layers of liquid in different colorsYour job is to group the same colors into one flask without mixing themYou can only pour on top of the same color or into an empty flaskSome levels add fun goals like freeing hidden objects or filling specific flasksThink a few steps ahead and try not to block yourselfUse undo when needed. you can also buy boosters like removing a flask or adding an empty flask.Always look for flasks that are easy wins like ones with the two colorsTry to create an empty flask early on. It gives you space to move things around",
    "tips": "",
    "developer": "",
    "similarGames": []
  },
  "fullContent": "Home› PuzzleSort ResortBy OnlineGames.ioMake Game Full ScreenPouring colorful liquids from one flask to another all day like a mad scientist… yeah, that’s pretty much what Sort Resort feels like. It’s a satisfying puzzle game where your main goal is to organize messy flasks filled with different colored liquids. These liquids don’t mix —kind of like oil and water— so it’s all about stacking the same colors together until every flask is clean and neat.With increasing difficulties, each level has a special goal. Maybe you'll need to dig a star out from the bottom of a flask, or fill exactly two flasks with purple liquid. That little extra task keeps things interesting and makes you think before you pour.Sort Resort is casual, colorful, family-friendly and super satisfying when everything clicks into place. This is the kind of game that makes sorting oddly fun.Ready to start pouring like a pro? You can play Sort Resort right here at OnlineGames.io. It’s free, it’s online, and it’s perfect when you want a break that still makes your brain work a little. Give it a try, sorting has never been this fun.ControlsOn Computer:Click a flask to pick it upClick another flask to pour the top liquid into itOn Mobile:Tap to select a flaskTap another flask to pour into itHow to Play Sort ResortStart with a bunch of flasks filled with layers of liquid in different colorsYour job is to group the same colors into one flask without mixing themYou can only pour on top of the same color or into an empty flaskSome levels add fun goals like freeing hidden objects or filling specific flasksThink a few steps ahead and try not to block yourselfUse undo when needed. you can also buy boosters like removing a flask or adding an empty flask.Always look for flasks that are easy wins like ones with the two colorsTry to create an empty flask early on. It gives you space to move things aroundMore Relaxing Puzzle GamesIf you liked this satisfying sorting game, check out other puzzle games like Nuts and Bolts where you remove bolts to drop planks from the platform. It offers that same relaxing-but-addictive puzzle feeling.This article was updated on March 28, 20251 Player2DArcadeBrainFreeFunHTML5LogicMobileOrganizingPuzzle",
  "extractedAt": "2025-06-10T05:15:03.454Z",
  "localThumbnail": "Sort Resort_1749532503455.jpg"
}