{
  "url": "https://www.onlinegames.io/speed-pinball/",
  "title": "Speed Pinball",
  "category": "/new-games/",
  "thumbnail": "https://www.onlinegames.io/media/posts/448/Speed-Pinball.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/448/Speed-Pinball.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/448/responsive/Speed-Pinball-xs.jpg 384w, https://www.onlinegames.io/media/posts/448/responsive/Speed-Pinball-sm.jpg 600w, https://www.onlinegames.io/media/posts/448/responsive/Speed-Pinball-md.jpg 768w, https://www.onlinegames.io/media/posts/448/responsive/Speed-Pinball-lg.jpg 1200w",
    "alt": "Speed Pinball Play Online",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://html5.gamedistribution.com/782d285ae87c4d51bf4720a71184b9e0/?gd_sdk_referrer_url=https://www.onlinegames.io/speed-pinball",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "How to Play Speed Pinball?"
      },
      {
        "type": "h2",
        "text": "Speed Pinball Power-Ups"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "More Games Like This"
      }
    ],
    "controls": [
      "Use the A or Left arrow keys to move the left paddle.Use the D or Right Arrow keys to move the right paddle.Use the left-click after hovering over whichever flipper you want to move with your mouse."
    ],
    "howToPlay": "In Speed Pinball, you need to hit the gems with the ball. Use the flippers to direct it. Your primary mission is to collect as many gems as possible before the time bar drops to zero. In addition to the time bar, another bar allows you to hit gems unquestionably when it is full, the Sure Shot bar. You can also use the power-ups, such as magnet, which you can use to effortlessly attract gems around you.",
    "tips": "",
    "developer": "",
    "similarGames": []
  },
  "fullContent": "Home› ArcadeSpeed PinballBy OnlineGames.ioMake Game Full Screen Let's get pinball lovers here. Speed Pinball is an endless pinball game where you constantly try to beat your own score and not drop the ball between two flippers within a given time. You can play it as much as you want. You will need your fast reflexes a lot in this game!How to Play Speed Pinball?In Speed Pinball, you need to hit the gems with the ball. Use the flippers to direct it. Your primary mission is to collect as many gems as possible before the time bar drops to zero. In addition to the time bar, another bar allows you to hit gems unquestionably when it is full, the Sure Shot bar. You can also use the power-ups, such as magnet, which you can use to effortlessly attract gems around you.Speed Pinball Power-UpsYou will come to the update screen when you click on the upward-pointing arrow icon in the menu. Here, you can use the gems you acquire while playing the game to improve your game quality.Extra Ball: The game initially provides you only one ball, but you can get extra balls with this upgrade.Countdown Duration: You are given a certain amount of time in the game. And this extends the time given to you.Sure Shot Interval: You are entitled to the Sure Shot at specific intervals. This update reduces the time it takes for the Sure Shot bar to recharge.Magnet Duration: When you use the magnet, you attract all the gems around you. This update also extends the time you can use the magnet.Spring: When you receive this update, you can now get springs. This means that it is a spring system placed between two flippers. When the ball slips between two flippers, the spring catches it and returns it to play.ControlsUse the A or Left arrow keys to move the left paddle.Use the D or Right Arrow keys to move the right paddle.Use the left-click after hovering over whichever flipper you want to move with your mouse.More Games Like ThisTry Bricks and Ball Pinball, an arcade game where you eliminate bricks by directing the balls if you love playing Speed Pinball. For more game options, you may also look for other free arcade games on OnlineGames.io.This article was updated on January 28, 20251 Player2DArcadeBallEndlessFreePhysicsPinballSkill",
  "extractedAt": "2025-06-10T06:22:04.744Z",
  "localThumbnail": "Speed Pinball_1749536524744.jpg"
}