{
  "url": "https://www.onlinegames.io/speedrun-parkour/",
  "title": "Speedrun Parkour",
  "category": "/t/running/",
  "thumbnail": "https://www.onlinegames.io/media/posts/759/Speedrun-Parkour.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/759/Speedrun-Parkour.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/759/responsive/Speedrun-Parkour-xs.jpg 384w, https://www.onlinegames.io/media/posts/759/responsive/Speedrun-Parkour-sm.jpg 600w, https://www.onlinegames.io/media/posts/759/responsive/Speedrun-Parkour-md.jpg 768w, https://www.onlinegames.io/media/posts/759/responsive/Speedrun-Parkour-lg.jpg 1200w",
    "alt": "Speedrun Parkour Play Online",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2022/construct/145/speedrun-parkour/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Desktop Controls"
      },
      {
        "type": "h2",
        "text": "Mobile Controls"
      },
      {
        "type": "h2",
        "text": "How to Play Speedrun Parkour"
      },
      {
        "type": "h3",
        "text": "Make Use of Elevators"
      },
      {
        "type": "h3",
        "text": "Watch Out Chainsaws"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "More Parkour Games"
      },
      {
        "type": "h2",
        "text": "Share Your Thoughts"
      }
    ],
    "controls": [
      "Jump: W/ Up Arrow/SpacebarMove Forward: D or Right ArrowMove Backward: A or Left Arrow"
    ],
    "howToPlay": "Guide Alex in his adventure up in the sky.Start running rightward, climb over the objects scattered in the air.  Arrive at the finish line to complete a level.30 unique levels with increasing difficulty are available in Speedrun Parkour.You can encounter extra large holes moving chainsaws to jump over on later levels.No matter what you do, be sure you're climbing only up!",
    "tips": "",
    "developer": "Freezenova created Speedrun Parkour.",
    "similarGames": []
  },
  "fullContent": "Home› ParkourSpeedrun ParkourBy OnlineGames.ioMake Game Full ScreenAlex, a young boy with great athletic abilities, finds himself in a port. He is chased by the bad guys of the port. His only way out is to navigate a series of heart-pounding challenges, leaping, rolling, and climbing over containers, boxes, and various other objects scattered in the sky.Your mission is to guide him to safety. Ensure he completes each parkour with precision and speed because the clock is ticking.  Speedrun Parkour, an online platformer game, invites you to join Alex in his sky-high adventures. With gameplay mechanics reminiscent of the beloved console game Only Up, Speedrun Parkour offers a light and accessible experience. Perfect to play on mobile devices during commutes or downtime.Desktop ControlsJump: W/ Up Arrow/SpacebarMove Forward: D or Right ArrowMove Backward: A or Left ArrowMobile ControlsUse arrow buttons on your screen to move and jumpMove: Buttons on the leftJump: Button on the rightHow to Play Speedrun ParkourGuide Alex in his adventure up in the sky.Start running rightward, climb over the objects scattered in the air.  Arrive at the finish line to complete a level.30 unique levels with increasing difficulty are available in Speedrun Parkour.You can encounter extra large holes moving chainsaws to jump over on later levels.No matter what you do, be sure you're climbing only up!Make Use of ElevatorsYou may see some elevators and sliding floors on some levels.They're a bit trickier to climb over but they'll give you advantage in climbing higher.Show attention to how these elevators and floors move before jumping on them; timing is the key!Watch Out ChainsawsThe sky is full of dangers. Alex can encounter some rolling chainsaws on the parkour. Avoid them at all costs. Otherwise, you need to start over from the beginning of that level.DeveloperFreezenova created Speedrun Parkour.More Parkour GamesIf you enjoy platformer games like Speedrun Parkour, find dozens of them on Parkour Games Online.From sky adventures, where you climb only upward, to battle royale running races, a wide range of action-platformer games await you on OnlinGames.io!We do not ask you a single penny or sign up to play games. All games are free and accessible.Share Your ThoughtsWe're trying to improve our platform based on your thoughts and wishes. So do not hesitate to contact us and share your ideas. We appreciate any comments regarding your experience on our site.If you have any questions, you can ask Gamie. She'll try her best to give you the answers you seek!Embed URL:https://www.onlinegames.io/games/2022/construct/145/speedrun-parkour/index.htmlThis article was updated on June 11, 20241 Player2DArcadeEmbeddableFreeFunHTML5MobileParkourRunning",
  "extractedAt": "2025-06-10T05:51:36.182Z",
  "localThumbnail": "Speedrun Parkour_1749534696182.jpg"
}