{
  "url": "https://www.onlinegames.io/stabfish-io-2/",
  "title": "StabFish io 2",
  "category": "/t/io-games/",
  "thumbnail": "https://www.onlinegames.io/media/posts/869/stabfish.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/869/stabfish.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/869/responsive/stabfish-xs.jpg 384w, https://www.onlinegames.io/media/posts/869/responsive/stabfish-sm.jpg 600w, https://www.onlinegames.io/media/posts/869/responsive/stabfish-md.jpg 768w, https://www.onlinegames.io/media/posts/869/responsive/stabfish-lg.jpg 1200w",
    "alt": "StabFish.io 2 Free Online Game",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://stabfish2.io/#?p=ogio",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "How to Play StabFish io 2"
      },
      {
        "type": "h2",
        "text": "Team Spirit, Solo Stab or Armageddon?"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "More .io Games"
      }
    ],
    "controls": [
      "Computers",
      "Mouse: Move your fishLeft Click: Use normal SkillRight Click: Use special SkillSpacebar: Use weapon skillS key: Switch Newer WeaponA key: Switch Older Weapon",
      "Mobiles",
      "Swipe: Move your fishUse buttons to activate skills"
    ],
    "howToPlay": "Start as a small fish and swim around to eat smaller fish.Avoid bigger fish who will try to eat you!Use the boost to speed away from dangerous opponents.As you eat, you grow bigger, becoming more powerful.The numbers above each fish are their HP. Reduce them to 0 in order to impale the fish.Impale a fish by stabbing with your tusk. Crash the impaled fish into the wall or burn them on fire to get the XPs.Your goal is to become the biggest fish in the sea!Survive these events to get bigger and unlock other sea animals.",
    "tips": "",
    "developer": "StabFish io 2 was developed by the team at Zytech AI.",
    "similarGames": []
  },
  "fullContent": "Home› io GamesStabFish io 2By OnlineGames.ioMake Game Full ScreenDive into the ocean, but do not expect peace or tranquility. Chaos and a tusk-impaling frenzy welcome you into the water this time. Become a predator and start your marine adventure in StabFish.io 2!In this sequel to the StabFish game that offers a multiplayer challenge, you control a hungry shark that grows by eating smaller fish and avoiding dangerous opponents. Your goal is to become the mega-beast of the deep. The deeper you swim, the stronger you become, but watch out for larger enemies ready to turn the tables on you. Can you dominate the sea?ControlsComputersMouse: Move your fishLeft Click: Use normal SkillRight Click: Use special SkillSpacebar: Use weapon skillS key: Switch Newer WeaponA key: Switch Older WeaponMobilesSwipe: Move your fishUse buttons to activate skillsHow to Play StabFish io 2Start as a small fish and swim around to eat smaller fish.Avoid bigger fish who will try to eat you!Use the boost to speed away from dangerous opponents.As you eat, you grow bigger, becoming more powerful.The numbers above each fish are their HP. Reduce them to 0 in order to impale the fish.Impale a fish by stabbing with your tusk. Crash the impaled fish into the wall or burn them on fire to get the XPs.Your goal is to become the biggest fish in the sea!Survive these events to get bigger and unlock other sea animals.Team Spirit, Solo Stab or Armageddon?Whether you're going solo or teaming up like a school of piranhas, Stabfish.io 2 offers both paths. It's a lesson in teamwork or the art of being a lone, deadly predator.In Armageddon mode, an hourly event shows up where you can go full apocalypse mode. In this, a red poison will expand over the map until a single player remains alive and all other players have died.DeveloperStabFish io 2 was developed by the team at Zytech AI.More .io GamesIf you find yourself utterly captivated by the oceanic chaos of StabFish.io 2, don't let your adventures end there. Here is another .io game you like: Mope.io is a game where you start as a small creature and eat your way up the food chain. From a mouse to a dragon, the journey is long, and survival is key. It's the evolutionary tale of StabFish.io 2, where you evolve rather than just stab, but the thrill of growing larger remains.This article was updated on November 12, 20242DAnimalArenaFreeio GamesMobileMouseMultiplayerWater",
  "extractedAt": "2025-06-10T05:31:29.077Z",
  "localThumbnail": "StabFish io 2_1749533489078.jpg"
}