{
  "url": "https://www.onlinegames.io/stabfish-io/",
  "title": "StabFish io",
  "category": "/t/io-games/",
  "thumbnail": "https://www.onlinegames.io/media/posts/828/Stabfish-io.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/828/Stabfish-io.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/828/responsive/Stabfish-io-xs.jpg 384w, https://www.onlinegames.io/media/posts/828/responsive/Stabfish-io-sm.jpg 600w, https://www.onlinegames.io/media/posts/828/responsive/Stabfish-io-md.jpg 768w, https://www.onlinegames.io/media/posts/828/responsive/Stabfish-io-lg.jpg 1200w",
    "alt": "StabFish.o Free Online Game",
    "width": 256,
    "height": 256,
    "className": "",
    "parentClass": "post__featured-image"
  },
  "gameFrame": "https://stabfish.io/?p=ogio",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "How to Play StabFish.io"
      },
      {
        "type": "h2",
        "text": "Gamie Suggests Kraken!"
      },
      {
        "type": "h2",
        "text": "Unlock New Fishes"
      },
      {
        "type": "h2",
        "text": "Types of Melees"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "More Games Like This"
      }
    ],
    "controls": [
      "Computers",
      "Mouse: Move your fishLeft Click: Speed boost",
      "Mobiles",
      "Swipe: Move your fishHold two fingers: Speed boost"
    ],
    "howToPlay": "Swim around the ocean, and use your weapon to stab other fish.Each kill adds points to your score and makes your melee grow longer. Stay alert, and avoid exposing fish's sides without the weapon. And use speed boosts to outmaneuver opponents.You can eliminate bigger fishes if you approach them behind or sides.You may encounter some random events, such as a dark arena for 30 seconds. Survive them to boost your score even more.Customize your fish with various bodies, weapons, masks, and hats to make your character stand out in the crowd and gain more powers.",
    "tips": "",
    "developer": "Stabfish.io is developed by Zytech AI.",
    "similarGames": []
  },
  "fullContent": "Home› io GamesStabFish ioBy OnlineGames.ioMake Game Full ScreenStabfish io is a fun multiplayer game where you swim as a little shark in the ocean, striving to stab more and more fish! Eat other fish with your weapon to earn points, rack up kills, and stay alive as long as possible. Unlock new tusks, fish families and gear up masks and hats in Stabfish io. Look unique in the ocean and intimidate your opponents with your style.ControlsComputersMouse: Move your fishLeft Click: Speed boostMobilesSwipe: Move your fishHold two fingers: Speed boostHow to Play StabFish.ioSwim around the ocean, and use your weapon to stab other fish.Each kill adds points to your score and makes your melee grow longer. Stay alert, and avoid exposing fish's sides without the weapon. And use speed boosts to outmaneuver opponents.You can eliminate bigger fishes if you approach them behind or sides.You may encounter some random events, such as a dark arena for 30 seconds. Survive them to boost your score even more.Customize your fish with various bodies, weapons, masks, and hats to make your character stand out in the crowd and gain more powers.Gamie Suggests Kraken!Among all the great sea animals, one stands out with its extraordinary powers! Unlocking the Kraken is a fantastic boost in Stabfish.io! Its larger body size and extended weapon range make it easier to dominate the ocean. But, how to unlock Kraken? Here is the break-down:First, unlock Dumbo Octopus by achieving 4 kill streaks.Then perform 8 kill streaks while using Dumbo Octopus and unlock OctopusLastly, make 20 kill streaks using Octopus.Ta Da! Go back to main menu and wear Kraken skin in the fish menu!Unlock New FishesThere are 15 sea animal families in StabFish io. 3 of them are unlocked by default. To acquire a certain animal, first, you need to unlock the family and complete certain quests to upgrade it. For example, you should eat 1500 pts of food to unlock whale family, then you can upgrade your whale to Blue Whale or Jo Mama. Learn about how to unlock them and their special powers below:Shark: DefaultGreat White: Kill score +15%Megalodon: Kill score +25%Killer Whale: DefaultSerial Killer: Kill Streak Score +25%Psycho Killer: Kill Streak Score +50%Hammerhead: DefaultHammered Head: Boost speed +25%Whammyhead: Boost speed +50%Whale: Eat 1500 pts of food to unlock whale familyBlue Whale: Food radius +25%Jo Mama: Food radius +25%, Food score +100%Manta Ray: 2x chain bonus in one game to unlock ray familyMantra Ray: Boost consumption -50%Blue Ray: Filter heads, Chain Bonus +100%Puffer Fish: Accumulate 30x to unlock pufferfish familyPorcupine Fish: Spike level 2Onifugu: Spike level 2, Kill score +20%Dolphin: Boost non-stop for 2 secs to unlock dolphin familyCommon Dolphin: Speed +5%Spinner Dolphin: Speed +10%, Kill Streak Score +45%Goldfish: Accumulate 100k score to unlock fish familyGoldenfish: Killing grants 500ms shield, Kill score 10%Diamondfish: Killing grants 500ms shield, Kill score 10%Narwhal: Accumulate 200 kills to unlock narwhal familyBeluga: Weapon size +5%, Kill Streak Score +25%Archbeluga: Weapon size +15%, Kill Streak Score +45%Dumbo Octopus: Kill streak 4 times to unlock the octopus familyOctopus: Spit blinding ink while boostingKraken: Body Size +25%, Kill Streak score +50%, Kill Score +25%, Weapon Size +5%, Food Radius +25%Moray Eel: Stage 4 Tusk 5 times to unlock eel familyGulper Eel: Food Radius +50%Electric Eel: Kill Score +10%Sea Turtle: Score 5K points and survive 5 mins to unlock turtle familyLeatherback: Immune to attack from behind, Boost Speed +20%Snapping Turtle: Immune to attack from behind, Hide in invulnerable shell instead of boostStingray: 1 revenge kill is needed to unlock ray familyBat Ray: Extra 10K points revenge kills, Extra 2K points bounty killsElectric Ray: Thunderbolts while boosting, Kill Score +10%Sakura Shrimp: Pick up 5 loots to unlock shrimp familyPistol Shrimp: Shoot 3 fire bulletsMantis Shrimp: Shoot fire rings, Food score +50%Firebelly Newt: Use extra life 5x to unlock newt familyFire Salamander: Fire and electric ballsAxolotl: Use tail to avoid death, Kill score +15%Vampire Squid: Accumulate red 30x to unlock squid familyCuttlefish: Disguise foodColossal Squid: Chain bonus +10% and extrasSwordfish: 3 kills in a single boost to unlock fish familyMarlin: Boost speed +25%, Speed +3%Sailfish: Boost speed +35%, Speed +5%Blue Crab: Become the champ to unlock crab familyKing Crab: Kill Streak Score +20% and extrasSpider Crab: Kill Streak Score +30% and extrasCrocodile: Survive a random event to unlock crocodile familyKronosaurus: Kill Streak Score +20% and extrasMosasaurus: Lots of random extrasKoi: Unlock 15 fish and score 5k to unlock koi familyOarfish: Weapon size +5%, Kill Score +10%Dragon: Gain temporary powers of other fishes by chain bonusesTypes of MeleesImprove your fish’s stab powers with a variety of weapons, each offering unique powers. Here’s a breakdown of the melees available in Stabfish io:Tusks: Easy - Basic tusks suitable for beginners, offering balanced performance and ease of use.Trident: Normal - A standard upgrade from basic tusks, providing increased damage and versatility.Chill Blade: Hard - Advanced melee with enhanced features for experienced players.Chainsaw: Advanced - High-performance tusk with rapid attack capabilities. Suitable for aggressive playstyles, allowing you to slice through multiple opponents quickly.Firesaber: Expert - The ultimate tusk for expert players, featuring fiery attacks that can incinerate enemies. It provides exceptional power and is designed for those seeking to dominate the arena.Lightning Rod: Master - The most powerful tusk in the game, delivering devastating lightning strikes that can strike down multiple enemies at once. Ideal for mastering the game and becoming a champ in Stabfish.DeveloperStabfish.io is developed by Zytech AI.More Games Like ThisIf you love underwater action, check out our SeaDragons.io, a game where you control a dragon to eat as much food as possible in the ocean. Eat fish and orbs to grow bigger, but be careful not to crash into other opponents.This article was updated on September 9, 20242DAnimalArenaFreeio GamesMobileMouseMultiplayerWater",
  "extractedAt": "2025-06-10T05:34:56.927Z",
  "localThumbnail": "StabFish io_1749533696927.jpg"
}