{
  "url": "https://www.onlinegames.io/state-io-wars/",
  "title": "State io Wars",
  "category": "/t/io-games/",
  "thumbnail": "https://www.onlinegames.io/media/posts/685/State-io-Wars.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/685/State-io-Wars.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/685/responsive/State-io-Wars-xs.jpg 384w, https://www.onlinegames.io/media/posts/685/responsive/State-io-Wars-sm.jpg 600w, https://www.onlinegames.io/media/posts/685/responsive/State-io-Wars-md.jpg 768w, https://www.onlinegames.io/media/posts/685/responsive/State-io-Wars-lg.jpg 1200w",
    "alt": "State io Wars Online Game",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2024/construct/233/state-io-wars/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Overview of State io Wars"
      },
      {
        "type": "h3",
        "text": "Different Colored States"
      },
      {
        "type": "h3",
        "text": "Generate New Soldiers"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "Similar Games"
      }
    ],
    "controls": [
      "Desktops and Computers",
      "Left-Click and Drag: Send Troops",
      "Mobile Devices",
      "Use the touchscreen to send troops."
    ],
    "howToPlay": "",
    "tips": "",
    "developer": "FreezeNova developed State io Wars.",
    "similarGames": [
      {
        "title": "Battleship War",
        "url": "https://www.onlinegames.io/battleship-war/"
      }
    ]
  },
  "fullContent": "Home› WarState io WarsBy OnlineGames.ioMake Game Full ScreenGive commands to your mini soldiers and try to get new lands! State io Wars is a 2D war game where your objective is to conquer lands as much as possible. To do that, send your troops to a neutral or your opponent's area and take it. By directing your army wisely, you can achieve victory in this strategy game!Overview of State io WarsIf you enjoy conquering new lands, this war game is just for you! In the game, you will see a vast country with its states.Your main aim in the game is to capture the states until you get the whole map.To conquer the states, you must send your troops to gray or red areas.The red ones belong to your opponent. Getting his states will be challenging as he will try to seize yours in the meantime.To capture a state, you need to deploy as many soldiers as the number written in that area.To win this strategy game, you must keep trying to get all the states your opponent has. There should be no red areas left!Different Colored StatesYou will see states in three different colors. The states with neutral tones belong to none of you. They are available to be seized by either you or your opponent. On the other hand, the red states are your rival's territories.You must capture all the red areas by directing your troops on them to get the whole land. Finally, the blue ones are already yours. Keep in mind that while trying to expand your space, you can't let the red side take over areas that are already yours!Generate New SoldiersWhen you acquire states, they will produce new soldiers. More soldiers mean capturing provinces faster. Increase your soldiers' numbers to act more powerfully. To be able to seize an area, deploy troops to it as the exact numbers written on it. Otherwise, you will fail at getting it.As you pass levels successfully, you will gain coins. Use them to increase the attack speed of your army and increase their number at the beginning point. Additionally, you can raise the volume of your earned coins.ControlsDesktops and ComputersLeft-Click and Drag: Send TroopsMobile DevicesUse the touchscreen to send troops.DeveloperFreezeNova developed State io Wars.Similar GamesTry Battleship War if you enjoy playing this game. You will try to sink your opponent's fleet by launching rockets. But first, you must guess the location of his hidden ships!For further options, you may look for other strategy games online on OnlineGames.io. Please share your gaming experiences with us in the comment section below! We'd love to hear from you.Embed URL:https://www.onlinegames.io/games/2024/construct/233/state-io-wars/index.htmlThis article was updated on August 7, 20242DArmyBattle RoyaleEmbeddableFreeHTML5io GamesMobileMouseStrategyWar",
  "extractedAt": "2025-06-10T05:33:46.625Z",
  "localThumbnail": "State io Wars_1749533626625.jpg"
}