{
  "url": "https://www.onlinegames.io/stealing-the-diamond/",
  "title": "Stealing the Diamond",
  "category": "/new-games/",
  "thumbnail": "https://www.onlinegames.io/media/posts/957/Henry-Stikmin-Stealing-the-Diamond.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/957/Henry-Stikmin-Stealing-the-Diamond.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/957/responsive/Henry-Stikmin-Stealing-the-Diamond-xs.jpg 384w, https://www.onlinegames.io/media/posts/957/responsive/Henry-Stikmin-Stealing-the-Diamond-sm.jpg 600w, https://www.onlinegames.io/media/posts/957/responsive/Henry-Stikmin-Stealing-the-Diamond-md.jpg 768w, https://www.onlinegames.io/media/posts/957/responsive/Henry-Stikmin-Stealing-the-Diamond-lg.jpg 1200w",
    "alt": "Henry Stickmin Stealing the Diamond Play Online",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://cloud.onlinegames.io/games/2025/flash/stealing-the-diamond/index-og.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "How to Play Stealing the Diamond"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "Other Henry Stickmin Games"
      },
      {
        "type": "h2",
        "text": "Bust or Sneak in the Museum"
      }
    ],
    "controls": [
      "Use the mouse to click on different options as they appear.Follow any on-screen prompts during some quick-time events"
    ],
    "howToPlay": "Guide Henry through his bold museum heist. You’re presented with choices on how to proceed. For example, do you want to sneak in quietly or crash through with a disguise? Each option comes with funny outcomes. And let me give you a secret: not all of them are successful! Sometimes you’ll fall flat on your face if you pick the wrong tool or plan, but don’t sweat it. Give it a good laugh and just click “Retry” to go back and try another path because failing is part of the fun here.  You can also collect all the fails if you want a completion challenge. This is a perfect browser game for anyone who likes interactive stories, comedy, and wacky crime adventures.",
    "tips": "",
    "developer": "Henry Stickmin: Stealing the Diamond was created by PuffballsUnited and released on July 8, 2011. The Henry Stickmin series is known for its humor, cartoonish style, and silly storytelling. Although the game was highly popular during its era, it lost some of its popularity due to Adobe discontinuing Flash in 2020. PuffballsUnited later co-founded Innersloth, the studio behind the popular game Among Us. PuffballsUnited also worked on other Henry Stickmin episodes, each with its own unique theme. You can still enjoy Stealing the Diamond for free on OnlineGames.io, supporting indie creators who pour their hearts into their work!​",
    "similarGames": []
  },
  "fullContent": "Home› FunnyStealing the DiamondBy OnlineGames.ioMake Game Full ScreenHenry Stickmin Stealing the Diamond is a point-and-click adventure game where you help Henry Stickmin (the famous criminal) attempt the biggest art heist of his life. He wants to sneak (or bust) into a museum and steal a precious diamond without getting caught. This free flash game is perfect for anyone who enjoys comedy animations mixed with some action. You can play it right in your browser on OnlineGames.io, so there’s no need to download any file or flush plugin. It’s simple to start playing, and the silly moments keep you smiling from start to finish.Every choice you make leads to a different path.  With funny situations, silly animations, and plenty of LOL moments, Henry Stickmin Stealing the Diamond is kind of a game you'll want to play again and again. Unlike regular cartoons, you're in control of the action. So expect lots of funny surprises. Try it once, and it’ll quickly become one of your favorite online games!ControlsUse the mouse to click on different options as they appear.Follow any on-screen prompts during some quick-time eventsHow to Play Stealing the DiamondGuide Henry through his bold museum heist. You’re presented with choices on how to proceed. For example, do you want to sneak in quietly or crash through with a disguise? Each option comes with funny outcomes. And let me give you a secret: not all of them are successful! Sometimes you’ll fall flat on your face if you pick the wrong tool or plan, but don’t sweat it. Give it a good laugh and just click “Retry” to go back and try another path because failing is part of the fun here.  You can also collect all the fails if you want a completion challenge. This is a perfect browser game for anyone who likes interactive stories, comedy, and wacky crime adventures.DeveloperHenry Stickmin: Stealing the Diamond was created by PuffballsUnited and released on July 8, 2011. The Henry Stickmin series is known for its humor, cartoonish style, and silly storytelling. Although the game was highly popular during its era, it lost some of its popularity due to Adobe discontinuing Flash in 2020. PuffballsUnited later co-founded Innersloth, the studio behind the popular game Among Us. PuffballsUnited also worked on other Henry Stickmin episodes, each with its own unique theme. You can still enjoy Stealing the Diamond for free on OnlineGames.io, supporting indie creators who pour their hearts into their work!​Other Henry Stickmin GamesIf you’re enjoying Henry Stickmin Stealing the Diamond, there are other funny point-and-click adventures worth checking out. Escaping the Prison and Infiltrating the Airship are also part of the Henry Stickmin series. They have a similar style and sense of humor. You can also explore other free browser games like Papa’s Pizzeria for a more casual, food-based challenge or Help the Hero for a slightly puzzling vibe. Each offers a unique twist but still sticks to the quick-play style, perfect for players who want fast-paced fun.Bust or Sneak in the MuseumHenry Stickmin Stealing the Diamond is a fantastic game if you love short 5-minute games with lighthearted comedy and interactive storytelling. With its amusing fail scenes, quirky style, and multiple endings, it’s easy to see why this browser game has stayed popular. Head to OnlineGames.io and play right now to see if you can help Henry pull off the biggest art heist without totally messing up! Enjoy the silly mishaps, experiment with different plans, and share the laugh-out-loud moments with your friends. This is one free game that will keep you and your buddies entertained for hours. Have fun and good luck grabbing that diamond!This article was updated on March 12, 20251 Player2DCrashCrazyDestroyFlashFreeFunFunnyStickman",
  "extractedAt": "2025-06-10T06:03:54.628Z",
  "localThumbnail": "Stealing the Diamond_1749535434629.jpg"
}