{
  "url": "https://www.onlinegames.io/stickman-gta-city/",
  "title": "Stickman GTA City",
  "category": "/t/action/",
  "thumbnail": "https://www.onlinegames.io/media/posts/900/Stickman-GTA-Keyboard-Controls.webp",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/900/Stickman-GTA-Keyboard-Controls.webp",
    "srcset": "https://www.onlinegames.io/media/posts/900/responsive/Stickman-GTA-Keyboard-Controls-xs.webp 384w, https://www.onlinegames.io/media/posts/900/responsive/Stickman-GTA-Keyboard-Controls-sm.webp 600w, https://www.onlinegames.io/media/posts/900/responsive/Stickman-GTA-Keyboard-Controls-md.webp 768w, https://www.onlinegames.io/media/posts/900/responsive/Stickman-GTA-Keyboard-Controls-lg.webp 1200w",
    "alt": "Stickman GTA Controls",
    "width": 800,
    "height": 239,
    "className": "is-loaded",
    "parentClass": "post__image post__image--center is-loaded"
  },
  "gameFrame": "https://cloud.onlinegames.io/games/2024/unity3/stickman-gta-city/index-og.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "How to Play Stickman GTA City"
      },
      {
        "type": "h2",
        "text": "Cheats"
      },
      {
        "type": "h2",
        "text": "Stickman Skins"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "More Free GTA Games"
      }
    ],
    "controls": [
      "Movement",
      "W, A, S, D: MoveSpacebar: JumpLMB: Look AroundShift: SprintC: CrouchF: Enter or exit vehicles",
      "Shooting / Attacking",
      "Z: AimRMB or Ctrl: Shoot/AttackR: Reload1-9 or Q key or Mouse Scroll: Switch WeaponsJ, K, L Keys: Rocket Launcher, RDP and Barret"
    ],
    "howToPlay": "Start by picking a place to spawn on the GTA city map.You'll begin with your first mission of evading the police and driving to the mafia escape house.After completing the first mission, you're free to follow mafia missions or explore the city at your own pace. You can access main and side missions using Stickman's phone. Completing missions will bring lots of cash.  Use your Stickman's skills to steal vehicles, take down enemies, and evade the cops. Collect money and weapons scattered across the city.Check your Stickman's health level often. If health is zero, you need to start over!\n\nNote: Remember there's no one-size-fits-all approach to playing open-world games. So, grab the controls, go out there and find your own way. Maybe you can tell us about your story in the comment section below.",
    "tips": "",
    "developer": "Stickman GTA City is developed by FreezeNova.",
    "similarGames": []
  },
  "fullContent": "Home› GTAStickman GTA CityBy OnlineGames.ioMake Game Full ScreenYou've been digging the internet for ages, looking for a free GTA game to play on your browser, only to end up with games that disappoint faster than a balloon losing air. You might have given up hope, reminiscing about the days of cruising through GTA San Andreas or Vice City with your bro. Think of how much you missed even hearing that iconic sound, the one that plays right as the screen fades to black with a bold \"Wasted!\" slapped across it? Ah, the good old days. But wipe that frown off your face because your miserable search ends here! We have brought you an online GTA game that captures the essence of San Andreas as much as possible. Stickman GTA City is a 3D action adventure game that you can play on your browser, absolutely free. You'll be stealing cars, dodging cops, and probably accidentally running over some stick pedestrians who didn't look both ways. And tanks? Helicopters? It's like Santa's gone rogue in the crime world!Whether you're following orders from your Mafia Boss or just exploring the vast open world, Stickman GTA City lets you play it your way. Have fun!ControlsMovementW, A, S, D: MoveSpacebar: JumpLMB: Look AroundShift: SprintC: CrouchF: Enter or exit vehiclesShooting / AttackingZ: AimRMB or Ctrl: Shoot/AttackR: Reload1-9 or Q key or Mouse Scroll: Switch WeaponsJ, K, L Keys: Rocket Launcher, RDP and Barret⚠ Mature Content WarningStickman GTA City is recommended for mature players due to frequent violence, crime-focused missions, and intense action sequences. These elements may be unsuitable for younger audiences. If you prefer a more casual or family-friendly experience, check out other free games on our site. Player discretion is advised.How to Play Stickman GTA CityStart by picking a place to spawn on the GTA city map.You'll begin with your first mission of evading the police and driving to the mafia escape house.After completing the first mission, you're free to follow mafia missions or explore the city at your own pace. You can access main and side missions using Stickman's phone. Completing missions will bring lots of cash.  Use your Stickman's skills to steal vehicles, take down enemies, and evade the cops. Collect money and weapons scattered across the city.Check your Stickman's health level often. If health is zero, you need to start over!Note: Remember there's no one-size-fits-all approach to playing open-world games. So, grab the controls, go out there and find your own way. Maybe you can tell us about your story in the comment section below.CheatsLet's face it; sometimes you just want to fly around in a jetpack without all that pesky \"earning it\" stuff. Experiment with cheats using your in-game phone to make the game even more exciting. You can spawn tanks, helicopters and even jetpacks, fill your ammo or unlock new weapons without writing down those rusty cheat codes like GIVEUSATANK or GUNSGUNSGUNS.Stickman SkinsLast but not least, you change your Stickman's skin in the shop. Each avatar comes with different power, health and attack stats, so you can decide if you want to be the Usain Bolt or the Hulk of stickmen.DeveloperStickman GTA City is developed by FreezeNova.More Free GTA GamesIn the end, Stickman GTA City is the love child of chaos and simplicity, wrapped in a stick-figure blanket. It's not taking itself seriously, and neither should you. It's where you can enjoy the thrill of GTA without the guilt of actual crime - unless you count stick-figure murder and grand theft auto as crimes. Dive in, laugh a lot, and maybe learn that even stickmen have dreams of becoming crime lords. If you enjoy Stickman GTA City, don't forget to check out our other free GTA games for more action-packed fun! Play now and embrace the chaos!Embed URL:https://cloud.onlinegames.io/games/2024/unity3/stickman-gta-city/index-og.htmlThis article was updated on March 17, 20251 Player3DActionAdventureBattleCarDrivingEmbeddableFreeGTAGunShootingSimulatorTrafficUnityWeapon",
  "extractedAt": "2025-06-10T04:11:52.531Z",
  "localThumbnail": "Stickman GTA City_1749528712531.jpg"
}