{
  "url": "https://www.onlinegames.io/stickman-destruction/",
  "title": "Stickman Destruction",
  "category": "/new-games/",
  "thumbnail": "https://www.onlinegames.io/media/posts/233/Stickman-Destruction.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/233/Stickman-Destruction.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/233/responsive/Stickman-Destruction-xs.jpg 384w, https://www.onlinegames.io/media/posts/233/responsive/Stickman-Destruction-sm.jpg 600w, https://www.onlinegames.io/media/posts/233/responsive/Stickman-Destruction-md.jpg 768w, https://www.onlinegames.io/media/posts/233/responsive/Stickman-Destruction-lg.jpg 1200w",
    "alt": "Stickman Destruction Play Online",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2021/unity3/stickman-destruction/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "How to play Stickman Destruction?"
      },
      {
        "type": "h2",
        "text": "How can I create obstacles in Stickman Destruction?"
      },
      {
        "type": "h2",
        "text": "Vehicles"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "PvP"
      },
      {
        "type": "h2",
        "text": "More Games Like This"
      }
    ],
    "controls": [
      "Click on Start on the playing screen, hold it until it reaches a specific speed, and then release it. It will cause your Stickman to burst."
    ],
    "howToPlay": "The whole purpose of Stickman Destruction is to increase the damage the character takes and gain points by creating as many obstacles as possible. You have 22 different map options, and every one of them has various obstacle alternatives. By earning points, you can get these map options and create a more dangerous environment.",
    "tips": "",
    "developer": "",
    "similarGames": []
  },
  "fullContent": "Home› StickmanStickman DestructionBy OnlineGames.ioMake Game Full ScreenHow many parts can you divide a virtual character into? Stickman Destruction is an action-oriented stickman ragdoll game in which you tear the virtual character apart a million times. The whole point of this game is to break the Stickman’s bones as much as possible by hitting him from right to left! Use your creativity and strategically calculate how you can get the most points. Break as many bones as you can and earn points!How to play Stickman Destruction?The whole purpose of Stickman Destruction is to increase the damage the character takes and gain points by creating as many obstacles as possible. You have 22 different map options, and every one of them has various obstacle alternatives. By earning points, you can get these map options and create a more dangerous environment.How can I create obstacles in Stickman Destruction?You can create obstacles in numerous ways. As mentioned, you can unlock new levels like Big Stairs or Free Slide. These maps offer you a variety of hurdles. Thus, allows you different damage setups.You can change the character’s jump positions by clicking Next Pose or Prev Pose and choosing whichever is best for significant damage. Adjust the jump speed by tapping and holding to Start. The faster the jump, the greater the damage the Stickman takes.Like unlocking new levels, you can unlock different vehicles, too. There are 11 vehicles. You can choose one of them and increase the number of broken bones.You have two aid tools, Magnet and Vane Bamboo, which you can get from the left side of the screen. You can get them with your points or by watching videos.Additionally, various tools named Props are at your disposal to deal the most damage.VehiclesYou can find the types of vehicles in the game listed below. Each vehicle creates a different impact according to its characteristics.Power CartBoss SeatBaby ScooterHospital BedHoverboardMotor BikeJeep SUVsSport BikeRoadsterJeep BombsBulldozersControlsClick on Start on the playing screen, hold it until it reaches a specific speed, and then release it. It will cause your Stickman to burst.PvPStickman Destruction provides you with a multiplayer game experience. You can create a room or join one available to play with others.More Games Like ThisIf you take pleasure in playing Stickman Destruction, you should definitely try Stickman Ragdoll on OnlineGames.io.Embed URL:https://www.onlinegames.io/games/2021/unity3/stickman-destruction/index.htmlThis article was updated on May 9, 20241 Player2DCrashCrazyDestroyEmbeddableFreeFunFunnyMobilePhysicsSimulatorStickman",
  "extractedAt": "2025-06-10T06:24:57.844Z",
  "localThumbnail": "Stickman Destruction_1749536697845.jpg"
}