{
  "url": "https://www.onlinegames.io/stick-guys-defense/",
  "title": "Stick Guys Defense",
  "category": "/t/strategy/",
  "thumbnail": "https://www.onlinegames.io/media/posts/476/Stick-Guys-Defense.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/476/Stick-Guys-Defense.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/476/responsive/Stick-Guys-Defense-xs.jpg 384w, https://www.onlinegames.io/media/posts/476/responsive/Stick-Guys-Defense-sm.jpg 600w, https://www.onlinegames.io/media/posts/476/responsive/Stick-Guys-Defense-md.jpg 768w, https://www.onlinegames.io/media/posts/476/responsive/Stick-Guys-Defense-lg.jpg 1200w",
    "alt": "Stick Guys Defense Play Online",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2022/unity3/stick-guys-defense/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "How to Play Stick Guys Defense"
      },
      {
        "type": "h3",
        "text": "Upgrading Units"
      },
      {
        "type": "h3",
        "text": "Power Ups in Stick Guys Defense"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Discover More Games"
      }
    ],
    "controls": [
      "Use your mouse click to defend your castle."
    ],
    "howToPlay": "You are under attack from all directions. And your mission is to slow down this attack as much as possible. The best thing you can do to protect your castle is to upgrade your units. As you strengthen them, they will be able to defend you more strongly. Remember that you will lose the game if 20 enemies enter the castle.",
    "tips": "",
    "developer": "",
    "similarGames": []
  },
  "fullContent": "Home› ActionStick Guys DefenseBy OnlineGames.ioMake Game Full Screen Protecting your towers is your most significant duty. Stick Guys Defense is a 3D tower defense game where you need to defend your castle with your stickman soldiers. There will be a non-stop invasion. Evil creatures are here to attack you by gathering everything they have. There will be no end to this invasion. You have to resist as much as you can.How to Play Stick Guys DefenseYou are under attack from all directions. And your mission is to slow down this attack as much as possible. The best thing you can do to protect your castle is to upgrade your units. As you strengthen them, they will be able to defend you more strongly. Remember that you will lose the game if 20 enemies enter the castle.Upgrading UnitsIt would be in your greatest interest to upgrade your units as soon as possible. Because the attacks will get bigger and bigger as the game progresses. You will see 3 different icons at the bottom of the game screen. The first one is for you to strengthen your front-row sword units. The icon next to it is for the archer units in the back. And the last one increases the money you earn from killing enemies.Power Ups in Stick Guys DefenseDuring the game, you will see a question mark at the top of the game screen. When the round blue bar around it is filled, it will give you a random power-up. This could be a poison, a soldier carrying a bomb, or a power-up that regenerates the health of all your soldiers. This is a complete surprise. Just trust your luck.ControlsUse your mouse click to defend your castle.Discover More GamesIf you are a fan of Stick Guys Defense, you should definitely try Fantasy Tower Defense, where the ugly creatures try to destroy your land. In this game, you are expected to protect your land with all your might. Additionally, you may look up other strategy game collections on OnlineGames.io for further options. Please tell us about your gaming experience in the comment section below!Embed URL:https://www.onlinegames.io/games/2022/unity3/stick-guys-defense/index.htmlThis article was updated on February 6, 20241 Player3DActionArmorBattleCrazyDefenseEmbeddableFreeMouseSimulatorStickmanStrategyTower DefenseUnityWar",
  "extractedAt": "2025-06-10T05:56:31.458Z",
  "localThumbnail": "Stick Guys Defense_1749534991457.jpg"
}