{
  "url": "https://www.onlinegames.io/stickman-war/",
  "title": "Stickman War",
  "category": "/t/shooting/",
  "thumbnail": "https://www.onlinegames.io/media/posts/543/Stickman-War.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/543/Stickman-War.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/543/responsive/Stickman-War-xs.jpg 384w, https://www.onlinegames.io/media/posts/543/responsive/Stickman-War-sm.jpg 600w, https://www.onlinegames.io/media/posts/543/responsive/Stickman-War-md.jpg 768w, https://www.onlinegames.io/media/posts/543/responsive/Stickman-War-lg.jpg 1200w",
    "alt": "Stickman War Free Online Game",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2023/q/6/stickman-war/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "How to Play Stickman War"
      },
      {
        "type": "h3",
        "text": "Shoot the Stickmen Precisely"
      },
      {
        "type": "h3",
        "text": "Bombs on the Platform"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "More Stickman Games"
      }
    ],
    "controls": [
      "To shoot the stickmen, use the left mouse button.To reload the gun, press the R key."
    ],
    "howToPlay": "There are 27 levels in Stickman War, and each has its own difficulty. Stickmen will enter the platform by jumping from left to right on each level. They can climb onto the gray barriers on the platform and do backflips. Don't be surprised! You just focus on your target and shoot them.",
    "tips": "",
    "developer": "Stickman War was created by Qky Games.",
    "similarGames": []
  },
  "fullContent": "Home› StickmanStickman WarBy OnlineGames.ioMake Game Full ScreenStickman War is a 2D shooting game where you try to shoot the running stickmen on the platform. It is impossible to predict their movements, where they will enter the platform and from where they will escape. They are everywhere. So, your eyes should be everywhere on the platform. You need to aim quickly and eliminate them one by one.How to Play Stickman WarThere are 27 levels in Stickman War, and each has its own difficulty. Stickmen will enter the platform by jumping from left to right on each level. They can climb onto the gray barriers on the platform and do backflips. Don't be surprised! You just focus on your target and shoot them.Shoot the Stickmen PreciselyYour gun only has a capacity of 12 bullets. This means that you should make your shots accurately.There will be places where you cannot shoot all the stickmen with one full magazine. In such cases, you will need to reload your magazine using the R key.But, since reloading will take time, you need to determine the time to reload your magazine carefully. Otherwise, all stickmen will be able to escape from the platform until you fill your magazine.Bombs on the PlatformThe number of stickmen will gradually increase in the following levels. And that will make your job harder. However, the game will make it easier for you by placing time bombs on the platform. You can preserve your bullet count by detonating these bombs in areas where stickmen are dense. Shoot the bombs and cause them to explode!ControlsTo shoot the stickmen, use the left mouse button.To reload the gun, press the R key.DeveloperStickman War was created by Qky Games.More Stickman GamesYou may try OvO if you enjoy playing Stickman War. OvO is a popular stickman game where the player runs to complete each level. There are many levels with sharp obstacles, and the player needs to jump, slide or dive to avoid them.Or, you may look for other free stickman games on OnlineGames.io. There are lots of game collections you can access easily on the site. If you keep an eye on the website, you will discover many more intriguing games!This article was updated on January 28, 20252DActionArcadeCrazyFirst Person ShooterFreeGunHTML5MobileShootingSkillStickmanWar",
  "extractedAt": "2025-06-10T05:44:00.439Z",
  "localThumbnail": "Stickman War_1749534240439.jpg"
}