{
  "url": "https://www.onlinegames.io/stick-run/",
  "title": "Stick Run",
  "category": "/t/running/",
  "thumbnail": "https://www.onlinegames.io/media/posts/741/Stick-Run.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/741/Stick-Run.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/741/responsive/Stick-Run-xs.jpg 384w, https://www.onlinegames.io/media/posts/741/responsive/Stick-Run-sm.jpg 600w, https://www.onlinegames.io/media/posts/741/responsive/Stick-Run-md.jpg 768w, https://www.onlinegames.io/media/posts/741/responsive/Stick-Run-lg.jpg 1200w",
    "alt": "Stick Run Play Online",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://html5.gamedistribution.com/8ade51370cd7424ea0a67eb7452abd82/?gd_sdk_referrer_url=https://www.onlinegames.io/stick-run",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Stick Run Overview"
      },
      {
        "type": "h3",
        "text": "City, Desert or Rocky Mountain"
      },
      {
        "type": "h3",
        "text": "Run without Limits"
      },
      {
        "type": "h2",
        "text": "Characters in Stick Run"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "Discover More Games"
      }
    ],
    "controls": [
      "W or Up Arrow Keys: JumpA or Left Arrow Keys: Move LeftD or Right Arrow Key: Move Right"
    ],
    "howToPlay": "",
    "tips": "",
    "developer": "GM Media developed this arcade game.",
    "similarGames": []
  },
  "fullContent": "Home› RunningStick RunBy OnlineGames.ioMake Game Full ScreenReady to get lost in the tunnels of the city or the desert? Stick Run is a 3D running game where you control a cute character in an endless tunnel. You have no choice but to run!Avoid stepping on the disappearing tiles and move as far as possible in the tunnel. Just like you do in Run 3! Make progress level by level, or try to beat your highest score in Infinite Mode in this arcade game!ControlsW or Up Arrow Keys: JumpA or Left Arrow Keys: Move LeftD or Right Arrow Key: Move RightStick Run OverviewThis arcade game offers you two game modes: Explore and Infinite. In each mode, your main objective is to move forward in the tunnel by covering the longest distances. You must avoid falling from the gaps or disappearing tiles on the tunnel to do that.Guide your little character and overcome each obstacle on your way one by one. Keep in mind that you can unlock new characters from the shop section using your earned coins.City, Desert or Rocky MountainThe Exploration Mode has three game maps: The City, The Desert and The Rocky Mountain. Each map comes with 65 challenging levels. Your mission in these three locations is the same in this running game.You need to advance in the tunnel as much as you can and level up. As you level up, you will earn coins. Unlock new characters using your in-game currencies, such as Halloween Stickman and Lady Skater.Run without LimitsIn Infinite Mode, you are free to run as many as you can. Your only goal in this mode is to break your own record each time you try. You will see gold bars on the way. Don't forget to collect them!Additionally, the platforms you run in Infinite Mode can change color and shape, adding color to your gaming experience. How many meters can you run the highest on the changing platforms?Characters in Stick RunThere are 15 unique characters that you can get in Stick Run. The first one is the Stick Runner, which is available in the first place. You can unlock the remaining 14 characters with the coins you earn! We will leave you the names of the characters below.Stick RunnerHalloween StickmanLady SkaterWinter Lady SkaterChild StickmanStick RabbitLazymanWinter Lady Skater 2Ghost StickmanPriestScientistDuplicate StickmanAngel StickmanStickman PirateAristocratDeveloperGM Media developed this arcade game.Discover More GamesTry playing Run Away 3. This time, you will direct a cute alien in a galactical tunnel in outer space. Dodge all the obstacles coming in your way in the game and try to go as far as you can!Look up the running games online on OnlineGames.io for additional gaming options. Keep coming back to discover new and thrilling online games by bookmarking the site!This article was updated on May 20, 20241 Player3DActionArcadeAvoidCrazyEndlessFreeRunningSpace",
  "extractedAt": "2025-06-10T05:51:52.822Z",
  "localThumbnail": "Stick Run_1749534712823.jpg"
}