{
  "url": "https://www.onlinegames.io/storm-city-mafia/",
  "title": "Storm City Mafia",
  "category": "/new-games/",
  "thumbnail": "https://www.onlinegames.io/media/posts/480/Storm-City-Mafia.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/480/Storm-City-Mafia.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/480/responsive/Storm-City-Mafia-xs.jpg 384w, https://www.onlinegames.io/media/posts/480/responsive/Storm-City-Mafia-sm.jpg 600w, https://www.onlinegames.io/media/posts/480/responsive/Storm-City-Mafia-md.jpg 768w, https://www.onlinegames.io/media/posts/480/responsive/Storm-City-Mafia-lg.jpg 1200w",
    "alt": "Storm City Mafia Play Online",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2022/unity/storm-city-mafia/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "How to Play Storm City Mafia"
      },
      {
        "type": "h3",
        "text": "Power-ups in Storm City Mafia"
      },
      {
        "type": "h2",
        "text": "Master the Controls"
      },
      {
        "type": "h2",
        "text": "Games Similar to Storm City Mafia"
      }
    ],
    "controls": [
      "Use your Mouse to aimUse the WASD keys or the Arrow keys to moveUse the Space key or the J key to jumpUse the Left Mouse button or the Z key to fireUse the X key to throw a grenadeUse the Left Shift or the C key to activate Hammer TimeUse the Mouse wheel or Q or E keys to cycle weaponsUse the Enter key to enter the vehicleUse ESC or the P key to pause the gameUse the M key to mute the audio toggle"
    ],
    "howToPlay": "In the game Storm City Mafia, you advance by finishing objectives. There are thirty missions to complete, each requiring you to carry out distinct tasks. The goal of the first mission is to take out 100 adversaries. The next mission becomes available once each assignment has been completed satisfactorily. And you're in for a different kind of obligation. At the end of the thirty-episode story, you defeat the Big Boss.",
    "tips": "",
    "developer": "",
    "similarGames": [
      {
        "title": "Mob City",
        "url": "https://www.onlinegames.io/mob-city/"
      }
    ]
  },
  "fullContent": "Home› ShootingStorm City MafiaBy OnlineGames.ioMake Game Full Screen Welcome to the world of cyberpunk! Storm City Mafia is a themed mafia game with many missions. Each task must be accomplished successfully. You are the key in this cyber world. It is your primary mission to defeat the enemies. But be careful because they are much more than you. Make each of them, including the big boss, history using your strategy skills!How to Play Storm City MafiaIn the game Storm City Mafia, you advance by finishing objectives. There are thirty missions to complete, each requiring you to carry out distinct tasks. The goal of the first mission is to take out 100 adversaries. The next mission becomes available once each assignment has been completed satisfactorily. And you're in for a different kind of obligation. At the end of the thirty-episode story, you defeat the Big Boss.Power-ups in Storm City MafiaYou can open the section with power-ups by clicking on the label icon from the main menu. You need to save money by collecting the money dropped by the enemies you eliminate in the games, and the best place to use them is power-ups. We have compiled a few of the best power-ups for you below.Godmode: You can not die when god mode is activated.Jetpack: Fly over the whole city with your jetpack without the need for a car.Golden Gun: Reflect the splendor of gold on your weapon.Unlimited Grenade Ammo: Your grenades will never ever run out.Vehicle Generator: Use the number keys between 0 and 9 to land the vehicle you want on the street.Master the ControlsUse your Mouse to aimUse the WASD keys or the Arrow keys to moveUse the Space key or the J key to jumpUse the Left Mouse button or the Z key to fireUse the X key to throw a grenadeUse the Left Shift or the C key to activate Hammer TimeUse the Mouse wheel or Q or E keys to cycle weaponsUse the Enter key to enter the vehicleUse ESC or the P key to pause the gameUse the M key to mute the audio toggleGames Similar to Storm City MafiaMob City is a game similar to Storm City Mafia. If you enjoy playing this game, you will absolutely like Mob City, where you wage war on bad guys in the city. You may also look for our shooting game collections on OnlineGames.io for more game alternatives. Don't forget to bookmark this website to be able to visit again easily!Embed URL:https://www.onlinegames.io/games/2022/unity/storm-city-mafia/index.htmlThis article was updated on December 20, 20231 Player3DActionArmorBattleEmbeddableFreeShootingTankUnityWarWeapon",
  "extractedAt": "2025-06-10T06:20:34.838Z",
  "localThumbnail": "Storm City Mafia_1749536434839.jpg"
}