{
  "url": "https://www.onlinegames.io/stunt-simulator-multiplayer/",
  "title": "Stunt Simulator Multiplayer",
  "category": "/t/car/",
  "thumbnail": "https://www.onlinegames.io/media/posts/682/Stunt-Simulator-Multiplayer-Play.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/682/Stunt-Simulator-Multiplayer-Play.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/682/responsive/Stunt-Simulator-Multiplayer-Play-xs.jpg 384w, https://www.onlinegames.io/media/posts/682/responsive/Stunt-Simulator-Multiplayer-Play-sm.jpg 600w, https://www.onlinegames.io/media/posts/682/responsive/Stunt-Simulator-Multiplayer-Play-md.jpg 768w, https://www.onlinegames.io/media/posts/682/responsive/Stunt-Simulator-Multiplayer-Play-lg.jpg 1200w",
    "alt": "Stunt Simulator Multiplayer Online Game",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2021/unity/stunt-simulator-multiplayer/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "About This Game"
      },
      {
        "type": "h3",
        "text": "Hazelgreen, Silverstone and Ironbark"
      },
      {
        "type": "h3",
        "text": "Compact Cars"
      },
      {
        "type": "h3",
        "text": "Night Drives"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "Explore Other Games"
      }
    ],
    "controls": [
      "WASD or the Arrow Keys: MoveSpace: BrakeLeft-Shift: NitroR: ResetT: ChatTab: PauseF: Headlights"
    ],
    "howToPlay": "",
    "tips": "",
    "developer": "FreezeNova created the Stunt Simulator Multiplayer.",
    "similarGames": []
  },
  "fullContent": "Home› StuntStunt Simulator MultiplayerBy OnlineGames.ioMake Game Full ScreenPerform flyover with real players in Stunt Simulator Multiplayer! It is a multiplayer stunt game where your aim is to make acrobatic flying across a map. There are many jumping ramps and hilly and grassy roads. Use them and perform the craziest flyovers to earn points. Unlock ten new cars with your money and experience the excitement of driving each one in this multiplayer car game.About This GameCreate a private room or join one of the available ones and take your place on one of the thrilling maps. All of them offer sky-high jumping platforms and rolling terrains. Press the gas pedal with all your strength and move forward at full speed. Use one of the platforms or the terrains and fly with your car. While high, try to make flipovers and perform a variety of stunts. You will earn points in this way. Use them to unlock new kinds of compact vehicles.Hazelgreen, Silverstone and IronbarkThe stunt game has three unique maps: Hazelgreen, Silverstone and Ironbark. Hazelgreen is a map with futuristic touches. It includes modern jumping ramps. Also, driving on this map has an extremely soothing effect. On the other hand, the Silverstone map combines a forestry road with mountains. You will find many trees and rocks near the ramps. This map is the most special map for those who want to be in touch with nature. And the third map is the Ironbark. Ironbark is a map with lots of shipments by sea. You are free to do whatever you want in this huge plain area.Compact CarsThere are ten unique cars at your disposal. But in the beginning, the Compact Car, Coupe Car and Pickup are accessible. As you perform flyovers, you will gain points.Use them to unlock the other ones. There are many vehicles that catch your attention, and the Concept Car is one of them. If you want something crazier, we recommend you try the 6-wheeled Car.Night DrivesSome people are crazy for night drives. If you are one of them, you have the option to drive your vehicle at night. You only need to join one of the rooms with the night mode or create a private room by clicking on the \"Night\" option. This way, you can enjoy your dark rides. Don't forget to turn on the headlights by pressing the F key.ControlsWASD or the Arrow Keys: MoveSpace: BrakeLeft-Shift: NitroR: ResetT: ChatTab: PauseF: HeadlightsDeveloperFreezeNova created the Stunt Simulator Multiplayer.Explore Other GamesYou may also try Ultimate Flying Car. In the game, you will find many cars with wings—yes, they can fly! You can freely roam the city streets or engage in races with other supercars.View other stunt games online on OnlineGames.io. The collection includes a wide range of games. Additionally, if you stay tuned, you will always find new and thrilling games on the site.This article was updated on March 12, 20243DCarCrashCrazyDriftDrivingFreeMultiplayerSimulatorSpeedStuntUnity",
  "extractedAt": "2025-06-10T05:27:42.324Z",
  "localThumbnail": "Stunt Simulator Multiplayer_1749533262325.jpg"
}