{
  "url": "https://www.onlinegames.io/stunt-rider/",
  "title": "Stunt Rider",
  "category": "/t/car/",
  "thumbnail": "https://www.onlinegames.io/media/posts/674/Stunt-Rider-Online.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/674/Stunt-Rider-Online.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/674/responsive/Stunt-Rider-Online-xs.jpg 384w, https://www.onlinegames.io/media/posts/674/responsive/Stunt-Rider-Online-sm.jpg 600w, https://www.onlinegames.io/media/posts/674/responsive/Stunt-Rider-Online-md.jpg 768w, https://www.onlinegames.io/media/posts/674/responsive/Stunt-Rider-Online-lg.jpg 1200w",
    "alt": "Stunt Rider Online Game",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2024/unity/stunt-rider/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Top View of Stunt Rider"
      },
      {
        "type": "h3",
        "text": "Try Acrobatic Moves"
      },
      {
        "type": "h3",
        "text": "Objects that Crash"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "Explore More"
      }
    ],
    "controls": [
      "WASD/Arrow Keys: MoveShift: NitroM: Rearview MirrorC: Change CameraR: ResetF: FixU: KMH/MPHI: Start/Stop EngineP: FullscreenZ: Up Shift"
    ],
    "howToPlay": "",
    "tips": "",
    "developer": "FreezeNova created Stunt Rider.",
    "similarGames": []
  },
  "fullContent": "Home› StuntStunt RiderBy OnlineGames.ioMake Game Full ScreenAre you fond of driving the best cars in the world and performing backflips? Stunt Rider is a 3D driving game where your main aim is to jump from sky-high ramps. Get on the pedal and move quickly towards platforms. Turn your car entirely by maneuvering left or right while in the air. What a trembling car game, isn’t it?Top View of Stunt RiderThere are four playgrounds to participate in: the city center, the rural road, and the industrial and snowy area. All the maps have many ramps, tunnels and crashing platforms. Your job is to take pleasure while moving into these at high speed.Earn points by performing spectacular jumps or drifts. Don’t forget to collect the F points on the road, as they earn you a certain amount of points. Feel free to do the craziest things with your car! Don’t worry about whether it gets scratched. You can always fix it by using the F key.Try Acrobatic MovesThe best part of this car game is that you can perform barrel rolls and somersaults with your car. The only thing you need to do is use the ramps. Have your eye on one of them and drive your car on it at a killing pace. While your vehicle is in the air, give it a direction. You can even test what the car can do by combining different maneuvers. For example, try turning it full circle and see what happens.Objects that CrashNone of us wants our cars to get damaged. But this stunt game allows you to wreck your vehicle as you wish. No matter what you do with it, you can return it to its original state with one click. In each map, there are lots of crashing objects lined up. Release your daily stress by letting these wild crashing platforms oppress your car. Or challenge yourself to pass each obstacle successfully and reach the finish line without getting damaged.ControlsWASD/Arrow Keys: MoveShift: NitroM: Rearview MirrorC: Change CameraR: ResetF: FixU: KMH/MPHI: Start/Stop EngineP: FullscreenZ: Up ShiftDeveloperFreezeNova created Stunt Rider.Explore MorePlaying Drift Hunters 2 will also give you a great deal of pleasure. You have access to many elegant sports cars in the game. Pick your favorite one and perform crazy drifts!View other online stunt games on Online Games.io. You are free to access them whenever you want. Additionally, if you have any suggestions or wishes, please contact us! We will be happy to hear from you.This article was updated on March 7, 20241 Player3DCarCrashCrazyDestroyDriftDrivingFreeSimulatorSpeedStuntUnity",
  "extractedAt": "2025-06-10T05:23:44.713Z",
  "localThumbnail": "Stunt Rider_1749533024713.jpg"
}