{
  "url": "https://www.onlinegames.io/stunt-simulator-2/",
  "title": "Stunt Simulator 2",
  "category": "/t/car/",
  "thumbnail": "https://www.onlinegames.io/media/posts/765/Stunt-simulator-2.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/765/Stunt-simulator-2.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/765/responsive/Stunt-simulator-2-xs.jpg 384w, https://www.onlinegames.io/media/posts/765/responsive/Stunt-simulator-2-sm.jpg 600w, https://www.onlinegames.io/media/posts/765/responsive/Stunt-simulator-2-md.jpg 768w, https://www.onlinegames.io/media/posts/765/responsive/Stunt-simulator-2-lg.jpg 1200w",
    "alt": "Stunt Simulator 2 Play Online",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2021/unity3/stunt-simulator-2/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Overview of Stunt Simulator 2"
      },
      {
        "type": "h3",
        "text": "The Muscle or the Truck"
      },
      {
        "type": "h3",
        "text": "The Rotating Bars"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "You May Also Like"
      }
    ],
    "controls": [
      "WASD or the Arrow Keys: MoveSpacebar: HandbrakeLeft-Shift: NitroESC: Pause"
    ],
    "howToPlay": "",
    "tips": "",
    "developer": "FreezeNova developed Stunt Simulator 2.",
    "similarGames": []
  },
  "fullContent": "Home› StuntStunt Simulator 2By OnlineGames.ioMake Game Full ScreenAre you ready to perform stunts with any car you can think of? Jump in the driver's seat, and we're going! Stunt Simulator 2 is a 3D driving game that provides free access to many kinds of cars.Choose the car you favor most and set for the road to perform stunts. Press the gas pedal and target the giant ramps to soar into the air in this simulator game! Explore each of the six unique maps.ControlsWASD or the Arrow Keys: MoveSpacebar: HandbrakeLeft-Shift: NitroESC: PauseOverview of Stunt Simulator 2Begin by deciding which map you want to use to do the craziest things in this car game. There are six game maps at your disposal.The first three of them are similar to playing fields but created for cars. They have many ramps to perform stunts and a green background.The fourth map has a futuristic setting on which to drive your car. On the other hand, the fifth map offers you mountainous roads.Finally, if you want to wander in the city streets, the sixth map is the best option for you.After choosing the map you want to play on, choose your car and switch to driving mode!Drift, perform stunts or barrel rolls! Jump from the ramp and flip at high speed to enjoy this stunt game to the fullest.The Muscle or the TruckThis car game has ten different cars to drive, spin, and perform stunts. You can find a truck or a speedy car among them. Alternatively, you have the option to slide a large rig or drive a coupe.Here, we completely leave the driving experience up to your imagination. The names of the cars are listed below!CompactMuscleCoupeSportSuperTruckRacerConceptAPCBig RigThe Rotating BarsIn the game maps, you will encounter many rotating bars. They are moving quite fast. When you move forward toward these bars, they will throw you and your car very forcefully. By making the car jump or performing barrel rolls due to impact, these bars will earn you a lot of score points.DeveloperFreezeNova developed Stunt Simulator 2.You May Also LikeIf you love playing Stunt Simulator 2 but are searching for a stunt game with a multiplayer option, you may also try playing Stunt Simulator Multiplayer. The game's objective is the same. However, this time, you will have fellas next to you!Look for other online stunt games on OnlineGames.io for additional options. Our community constantly tries to extend its online game range. If you have any suggestions or a wishlist, please contact us!Embed URL:https://www.onlinegames.io/games/2021/unity3/stunt-simulator-2/index.htmlThis article was updated on September 2, 20241 Player3DCarCrashCrazyDriftDrivingEmbeddableFreeSimulatorSpeedStuntUnity",
  "extractedAt": "2025-06-10T05:26:58.133Z",
  "localThumbnail": "Stunt Simulator 2_1749533218134.jpg"
}