{
  "url": "https://www.onlinegames.io/su-battle-royale/",
  "title": "Su Battle Royale",
  "category": "/t/action/",
  "thumbnail": "https://www.onlinegames.io/media/posts/897/Su-Battle-Royale.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/897/Su-Battle-Royale.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/897/responsive/Su-Battle-Royale-xs.jpg 384w, https://www.onlinegames.io/media/posts/897/responsive/Su-Battle-Royale-sm.jpg 600w, https://www.onlinegames.io/media/posts/897/responsive/Su-Battle-Royale-md.jpg 768w, https://www.onlinegames.io/media/posts/897/responsive/Su-Battle-Royale-lg.jpg 1200w",
    "alt": "Su Battle Royale Online Game",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://cloud.onlinegames.io/games/2024/su-battle-royale/index-og.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "How to Play Su Battle Royale"
      },
      {
        "type": "h2",
        "text": "Looting: What You Can Collect in Su Battle Royale"
      },
      {
        "type": "h2",
        "text": "Editor's Review"
      },
      {
        "type": "h2",
        "text": "Who Created Su Battle Royale?"
      },
      {
        "type": "h3",
        "text": "Can I play a game like Surviv io?"
      },
      {
        "type": "h3",
        "text": "Is Su Battle Royale multiplayer?"
      },
      {
        "type": "h3",
        "text": "How do I stay alive longer?"
      },
      {
        "type": "h2",
        "text": "More Free Battle Royale Games"
      }
    ],
    "controls": [
      "Movement: W, A, S, DAim: MouseMelee/Shoot: Left-ClickSwitch Weapons: 1-4 / Scroll WheelStow Weapon: 3 / ESwap Weapon: QReload: RScope Zoom: Left-ClickPickup/Revive: FUse Med Items: Left-Click on item / 7-0Drop Item: Right-ClickCancel Action: XMap: M / G | Minimap: VTeam Ping: Hold C + Right-Click, drag, releaseEmote Wheel: Hold Right-Click, drag, release"
    ],
    "howToPlay": "You and other players are scattered across the 2D map. Search houses, open boxes, and explore the environment for weapons, ammo, armor, grenades, and healing items. Prioritize finding protective gear and a reliable gun early on.If you prefer to sneak your way up, you can hang out in less crowded areas for a safer start but fewer resources.The map shrinks over time as toxic orange gas spreads. Keep an eye on your minimap and move into the safe zone to survive.Use strategy and skill to defeat your enemies. Set traps, ambush players, or engage in all-out combat—the choice is yours.Keep moving and avoid staying in one spot for too long.Keep an eye on your health and adrenaline levels. Use items like bandages, medkits, and cola to stay in the fight.Be the last player (or team) alive to claim victory and dominate the leaderboard!",
    "tips": "",
    "developer": "",
    "similarGames": []
  },
  "fullContent": "Home› SurvivalSu Battle RoyaleBy OnlineGames.ioMake Game Full ScreenLet's face it, we all miss Surviv.io. But there's no need to throw in the towel. Su Battle Royale is a free game that captures the essence of Surviv.io and delivers the exact same gameplay.If you're familiar with battle royale games like PUBG, you'll pick up how to play in no time. You start with nothing but your wits. In short, you'll start with nothing but your instincts. Scavenge for weapons, armor, and supplies scattered across the map while outsmarting your enemies. Dodge bullets, survive the toxic gas, and claim victory as the last player or team standing!Explore abandoned buildings, loot hidden crates, and prepare for intense battles as the playable zone shrinks over time. Will you fight head-on, set ambushes, or sneak your way to the top? The choice is yours.ControlsMovement: W, A, S, DAim: MouseMelee/Shoot: Left-ClickSwitch Weapons: 1-4 / Scroll WheelStow Weapon: 3 / ESwap Weapon: QReload: RScope Zoom: Left-ClickPickup/Revive: FUse Med Items: Left-Click on item / 7-0Drop Item: Right-ClickCancel Action: XMap: M / G | Minimap: VTeam Ping: Hold C + Right-Click, drag, releaseEmote Wheel: Hold Right-Click, drag, releaseHow to Play Su Battle RoyaleYou and other players are scattered across the 2D map. Search houses, open boxes, and explore the environment for weapons, ammo, armor, grenades, and healing items. Prioritize finding protective gear and a reliable gun early on.If you prefer to sneak your way up, you can hang out in less crowded areas for a safer start but fewer resources.The map shrinks over time as toxic orange gas spreads. Keep an eye on your minimap and move into the safe zone to survive.Use strategy and skill to defeat your enemies. Set traps, ambush players, or engage in all-out combat—the choice is yours.Keep moving and avoid staying in one spot for too long.Keep an eye on your health and adrenaline levels. Use items like bandages, medkits, and cola to stay in the fight.Be the last player (or team) alive to claim victory and dominate the leaderboard!Looting: What You Can Collect in Su Battle RoyaleWeapons: Find pistols, shotguns, SMGs, sniper rifles, and grenades to suit every combat style. Attachments like scopes and grips help improve your aim and control.Ammo and Backpacks: Keep your weapons loaded and expand your carrying capacity to hold more loot.Armor: Equip vests and helmets for added protection against enemy fire.Healing Items: These items include Bandages, which restore 15 health, Medikits for full health recovery, Cola to boost adrenaline by 25, and Tablets, which provide a 50 adrenaline boost.Editor's ReviewFollowing the removal of Surviv.io in 2023, fans like me (or you) have been on a quest for a worthy successor. In my view, Su Battle Royale admirably fills the void left by its predecessor, offering a fun multiplayer 2D battle royale experience.Each decision and move becomes critically significant, as you never know whether you'll accidentally detonate a box of grenades or uncover some rare loot. This feature alone was enough to keep me hooked, given the high stakes involved. I believe you'll find it equally fascinating.Another standout aspect of Su Battle Royale is its clean, minimalist visual style. It's one of those rare testaments to how engaging gameplay can be achieved without relying on elaborate 3D graphics or excessive visual effects. This simplicity not only appeals aesthetically but also ensures performance consistency across a wide range of devices, from high-end to lower-spec systems like Chromebooks.Overall, Su Battle Royale is a must-try for fans of Surviv io and battle royales looking for quick, exciting matches without the need for downloads.Who Created Su Battle Royale?Su Battle Royale was developed by Hasanger Games.Can I play a game like Surviv io?Yes there are lots of battle royale games that embraces the core mechanics of Surviv io. If you're looking for an almost the same experience, Su Battle Royale is the perfect option you can play for free.Is Su Battle Royale multiplayer?Yes, Su Battle Royale is a 100% multiplayer game.How do I stay alive longer?Focus on looting quickly, staying mobile, hiding in bushes and managing your health. Avoid the toxic gas at all costs!More Free Battle Royale GamesIf you enjoy Su Battle Royale, check out these other free survival games like Surviv Bros. While the survival essence of the game mainly remains the same, there are unique twists like more game modes or available servers for less ping gameplay.This article was updated on December 17, 20242DActionArenaBattleBattle RoyaleFreeFunio GamesMouseMultiplayerShootingSurvivalWarWeapon",
  "extractedAt": "2025-06-10T04:16:16.048Z",
  "localThumbnail": "Su Battle Royale_1749528976049.jpg"
}