{
  "url": "https://www.onlinegames.io/subway-clash-2/",
  "title": "Subway Clash 2",
  "category": "/t/strategy/",
  "thumbnail": "https://www.onlinegames.io/media/posts/657/Subway-Clash-2-Play.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/657/Subway-Clash-2-Play.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/657/responsive/Subway-Clash-2-Play-xs.jpg 384w, https://www.onlinegames.io/media/posts/657/responsive/Subway-Clash-2-Play-sm.jpg 600w, https://www.onlinegames.io/media/posts/657/responsive/Subway-Clash-2-Play-md.jpg 768w, https://www.onlinegames.io/media/posts/657/responsive/Subway-Clash-2-Play-lg.jpg 1200w",
    "alt": "Subway Clash 2 Online Game",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://html5.gamedistribution.com/a60b5ec05a304966bb4e590ed47a0c3e/?gd_sdk_referrer_url=https://https://www.onlinegames.com/subway-clash-2",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "How to Play Subway Clash 2"
      },
      {
        "type": "h3",
        "text": "Three Minute Battles"
      },
      {
        "type": "h3",
        "text": "Pick Up Dropped Weapons"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "More Games Like This"
      }
    ],
    "controls": [
      "WASD/Arrow Keys: MoveC: CrouchG: GrenadeL: Lock/Unlock MouseTab: ScoreboardNumber Keys: Switch WeaponsLeft-Click: ShootRight-Click: AimSpacebar: JumpUse screen buttons on mobile devices"
    ],
    "howToPlay": "When you enter the game, you will open your eyes in the subway with many tunnels and sanctuaries. There are lots of huge circular doors and rails.The subway is a very dark and large area. Anything can happen at any moment as you move forward.You are the commander of the green team. And you will deal with red enemy forces. Lead your soldiers strategically.Try eliminating as many opponents as possible to get the highest kill/death rate. The less you die, the higher the rate. View the scoreboard by pressing the Tab key.",
    "tips": "",
    "developer": "Subway Clash 2 was developed by Freeway Interactive.",
    "similarGames": []
  },
  "fullContent": "Home› ShootingSubway Clash 2By OnlineGames.ioMake Game Full ScreenSubway Clash 2 is a multiplayer shooting game where you, as the commander, fight with the enemy forces along with your soldiers. You and your army will take place in the dark, labyrinthine tunnels of the subway in Moscow. Here, your enemies can appear from anywhere. Keep your eyes wide open and be ready for any attack in one of the coolest action games on Online Games!How to Play Subway Clash 2When you enter the game, you will open your eyes in the subway with many tunnels and sanctuaries. There are lots of huge circular doors and rails.The subway is a very dark and large area. Anything can happen at any moment as you move forward.You are the commander of the green team. And you will deal with red enemy forces. Lead your soldiers strategically.Try eliminating as many opponents as possible to get the highest kill/death rate. The less you die, the higher the rate. View the scoreboard by pressing the Tab key.Three Minute BattlesYou have three minutes in each battle with the red forces. In this short period of time, you are expected to kill more and die less. At the end of this time, the team with the highest kill score wins the game. And a new game begins shortly after. Your objective is the same in every war: move silently through the tunnels, catch your opponents off guard, or fight side by side with your team against enemies in the square!Pick Up Dropped WeaponsThere are many weapons at your disposal. Your options are an AK47, sniper rifle, shotgun, and grenade launcher. The AK47 and shotgun are preferable in close combat than the other weapons. Meanwhile, the Sniper Rifle will allow you to shoot down your enemies from afar. The best place to use the grenade launcher is the area where the enemy is large in number. Apart from these weapons, you are free to pick up the guns on the floor dropped from your enemies.ControlsWASD/Arrow Keys: MoveC: CrouchG: GrenadeL: Lock/Unlock MouseTab: ScoreboardNumber Keys: Switch WeaponsLeft-Click: ShootRight-Click: AimSpacebar: JumpUse screen buttons on mobile devicesDeveloperSubway Clash 2 was developed by Freeway Interactive.More Games Like ThisIf you like playing Subway Clash 2, you may also try Mech Shooter. You will take part in wars between robots in the game. Your robot, Humanoid Mech, is ready to battle with its minigun weapon! For further options, you may look for other online shooting games on OnlineGames.io by clicking on the link.Bookmark this website to access new games easily. Online Games constantly offers its players free games in different categories without any registration.This article was updated on February 25, 20243DActionArmyBattleFreeGunMobileMultiplayerShootingStrategyWarWeapon",
  "extractedAt": "2025-06-10T05:58:23.635Z",
  "localThumbnail": "Subway Clash 2_1749535103636.jpg"
}