{
  "url": "https://www.onlinegames.io/survival-karts/",
  "title": "Survival Karts",
  "category": "/t/io-games/",
  "thumbnail": "https://www.onlinegames.io/media/posts/887/survival-karts-play.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/887/survival-karts-play.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/887/responsive/survival-karts-play-xs.jpg 384w, https://www.onlinegames.io/media/posts/887/responsive/survival-karts-play-sm.jpg 600w, https://www.onlinegames.io/media/posts/887/responsive/survival-karts-play-md.jpg 768w, https://www.onlinegames.io/media/posts/887/responsive/survival-karts-play-lg.jpg 1200w",
    "alt": "Survival Karts Play Online",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://cloud.onlinegames.io/games/2024/unity3/survival-karts/index-og.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "How to Play Survival Karts"
      },
      {
        "type": "h2",
        "text": "Style Your Kart"
      },
      {
        "type": "h2",
        "text": "Developers"
      },
      {
        "type": "h2",
        "text": "More Karts Games"
      }
    ],
    "controls": [
      "Computers",
      "Arrow Keys: Steer your kartSpacebar: JumpDouble Press Spacebar: Toggle fly mode.",
      "Mobiles",
      "Use on screen buttons to drive your kart"
    ],
    "howToPlay": "Choose your game mode and get ready to race! Compete with friends in private rooms or join public matches to make new rivals.Once you hit start, the round begins in just a few seconds. When the match starts, all players will dash to the center of the arena at full speed. Race to collect boosters and coins before your opponents can grab them!Each kart leaves colorful skid marks that temporarily erase parts of the ground, creating holes. You'll need to avoid these holes—whether they're made by you or others.As the gaps grow wider and the arena shrinks, the challenge intensifies, and more players tumble into the abyss.If you fall in a hole, you're out! Keep moving, dodging, and jumping to stay in the game.Stay sharp, dodge the hazards, and outlast your competitors. Be the last kart standing to claim victory and earn XP to level up!",
    "tips": "",
    "developer": "FreezeNova brought Survival Kart game. It's a frosty fun, where every race is a wild adventure.",
    "similarGames": []
  },
  "fullContent": "Home› KartSurvival KartsBy OnlineGames.ioMake Game Full ScreenLooking for the coolest, most chaotic online racing game? Play Survival Karts on OnlineGames.io! It's a survival showdown on an icy, hole-riddled track! Imagine zooming around on an icy playground where the ground could swallow you up at any moment. Here's the deal: Navigate around giant, gaping holes, dodge and survive with your cool kart. Collect shiny coins to pimp your ride or grab cool power-ups! Everyone else on the arena is your rival, trying to push you off the track into oblivion. Let's see how long you can stay on that icy track in Survival Karts. Remember, in this game, it's not about finishing first; it's about not finishing last!ControlsComputersArrow Keys: Steer your kartSpacebar: JumpDouble Press Spacebar: Toggle fly mode.MobilesUse on screen buttons to drive your kartHow to Play Survival KartsChoose your game mode and get ready to race! Compete with friends in private rooms or join public matches to make new rivals.Once you hit start, the round begins in just a few seconds. When the match starts, all players will dash to the center of the arena at full speed. Race to collect boosters and coins before your opponents can grab them!Each kart leaves colorful skid marks that temporarily erase parts of the ground, creating holes. You'll need to avoid these holes—whether they're made by you or others.As the gaps grow wider and the arena shrinks, the challenge intensifies, and more players tumble into the abyss.If you fall in a hole, you're out! Keep moving, dodging, and jumping to stay in the game.Stay sharp, dodge the hazards, and outlast your competitors. Be the last kart standing to claim victory and earn XP to level up!Style Your KartMake your kart stand out:Pick from awesome karts that'll make you the coolest kid on ice.6 bright colors to make your kart pop or blend in.Dress up your driver in one of 18 skins to look super cool or super funny.Top your driver's head with crazy hats – from a superhero mask to a chef's hat!DevelopersFreezeNova brought Survival Kart game. It's a frosty fun, where every race is a wild adventure.More Karts GamesIf you love the chaos of Survival Karts, why not explore other fun kart games? Enter Smash Karts, where the action is just as intense but with a twist: weapons! Instead of just racing to outlast your opponents, you'll arm your kart with powerful gear like rockets, grenades, and machine guns to wreak havoc on your rivals. This game brings a fresh layer of excitement as you balance racing skills with strategic combat to dominate the arena. Whether you prefer the icy survival strategy of Survival Karts or the explosive chaos of Smash Karts, there's always a karting adventure waiting for you on OnlineGames.io!Embed URL:https://cloud.onlinegames.io/games/2024/unity3/survival-karts/index-og.htmlThis article was updated on December 19, 20243DBattleBattle RoyaleCrazyDestroyDrivingEmbeddableFreeFunio GamesKartMobileMultiplayerRacingUnity",
  "extractedAt": "2025-06-10T05:31:47.099Z",
  "localThumbnail": "Survival Karts_1749533507100.jpg"
}