{
  "url": "https://www.onlinegames.io/survival-craft/",
  "title": "Survival Craft",
  "category": "/t/adventure/",
  "thumbnail": "https://www.onlinegames.io/media/posts/593/Survival-Craft-Game.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/593/Survival-Craft-Game.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/593/responsive/Survival-Craft-Game-xs.jpg 384w, https://www.onlinegames.io/media/posts/593/responsive/Survival-Craft-Game-sm.jpg 600w, https://www.onlinegames.io/media/posts/593/responsive/Survival-Craft-Game-md.jpg 768w, https://www.onlinegames.io/media/posts/593/responsive/Survival-Craft-Game-lg.jpg 1200w",
    "alt": "Survival Craft Free Online Game",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2022/unity/survival-craft/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "How to Play Survival Craft"
      },
      {
        "type": "h2",
        "text": "Getting Started: Crafting Items"
      },
      {
        "type": "h2",
        "text": "Check Out Farmer’s Needs"
      },
      {
        "type": "h2",
        "text": "Build A Shelter"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Other Crafting Games"
      }
    ],
    "controls": [
      "To move the farmer, use the WASD keys.Use your mouse to craft items.Use the right mouse click to equip, drop, or eat an item or sow seeds."
    ],
    "howToPlay": "You will find yourself with nothing in your pocket in an open world.In the forest, you can find oak trees, pine trees, rocks, flying birds, and lakes for fishing.Before crafting any necessary item for yourself, take a look around.Collect things that might be useful to you.The first thing you will need most is an axe.Open the crafting section by clicking on the icon in the lower-left corner of the screen.You will see many categories here. Learn which materials are needed to craft anything in this section.You can start by tapping on the tools section and choosing the axe. You need wood and a rock to craft it.",
    "tips": "",
    "developer": "",
    "similarGames": []
  },
  "fullContent": "Home› CraftingSurvival CraftBy OnlineGames.ioMake Game Full Screen Survival Craft is a sandbox game where the player crafts tools such as an axe and a shovel, weapons and even wearables in order to survive in the jungle. Gather the necessary materials to craft any item.Do not forget to construct buildings for yourself to take shelter. Create an environment for yourself where you can survive under the harsh conditions of raw nature! How to Play Survival CraftYou will find yourself with nothing in your pocket in an open world.In the forest, you can find oak trees, pine trees, rocks, flying birds, and lakes for fishing.Before crafting any necessary item for yourself, take a look around.Collect things that might be useful to you.The first thing you will need most is an axe.Open the crafting section by clicking on the icon in the lower-left corner of the screen.You will see many categories here. Learn which materials are needed to craft anything in this section.You can start by tapping on the tools section and choosing the axe. You need wood and a rock to craft it.Getting Started: Crafting ItemsExploring the forest and gathering resources are your first tasks.Craft yourself an axe to obtain more wood from trees.You will also need to use the axe to get rocks from the small cliffs. So, your most fundamental tool is an axe to collect stuff.Other than these materials, collect grasses, blackberries, and corn.You may even catch fish from the lake. But you will need a fishing rod to do that.Check Out Farmer’s NeedsYour character needs to sleep and eat well to stay alive like an ordinary human.Watch for the bars at the top right of the screen to follow his overall condition.The health bar especially must not fall to zero. Otherwise, he will lose his life.Build A ShelterBuilding a shelter is essential for your character's survival. A shelter will protect him from dangers and provide a safe place to rest.Before construction, you need to craft basic materials such as wood, stone, and grass.Obtain wood by chopping down trees with your trusty axe. Find stones by mining rocks with your pickaxe. And harvest grass from the ground using an axe.Once you have collected these materials, you can use them to build a shelter, hut, cabin, wood decks, and even an alchemy station.For a basic shelter, start by collecting 5 decks wood to create a foundation. Craft a rope made of grass. You will need it to combine parts of your shelter.As you progress in the game, you can upgrade your shelter. You can also build a proper house by crafting parts of walls and roofs.Master the art of building. Then you can make home as comfortable and functional as it can be for your character in this challenging wilderness.For example, you can build a furnace to cook food or construct a workshop station where you can craft more advanced tools and equipment.So gather your tools, collect resources. Let your creativity soar as you work on the perfect place in this vast and untamed world.ControlsTo move the farmer, use the WASD keys.Use your mouse to craft items.Use the right mouse click to equip, drop, or eat an item or sow seeds.Other Crafting GamesIf you love playing crafting games, you may give a chance to Colony Simulator. With the help of the villagers, the player crafts and builds tools. You have the complete control of the villagers. They are waiting for your commands!For further options, look up other survival games online on OnlineGames.io. If you have any suggestions or wishlist, please contact us!Embed URL:https://www.onlinegames.io/games/2022/unity/survival-craft/index.htmlThis article was updated on January 22, 20241 Player3DAdventureCraftingEmbeddableFreeMinecraftSandboxSimulatorSurvivalUnityWeapon",
  "extractedAt": "2025-06-10T05:10:20.954Z",
  "localThumbnail": "Survival Craft_1749532220954.jpg"
}