{
  "url": "https://www.onlinegames.io/swordbattle-io/",
  "title": "SwordBattle io",
  "category": "/t/io-games/",
  "thumbnail": "https://www.onlinegames.io/media/posts/679/SwordBattle-io.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/679/SwordBattle-io.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/679/responsive/SwordBattle-io-xs.jpg 384w, https://www.onlinegames.io/media/posts/679/responsive/SwordBattle-io-sm.jpg 600w, https://www.onlinegames.io/media/posts/679/responsive/SwordBattle-io-md.jpg 768w, https://www.onlinegames.io/media/posts/679/responsive/SwordBattle-io-lg.jpg 1200w",
    "alt": "SwordBattle.io Online Game",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://html5.gamemonetize.co/m2yzvbmyf75dl11i5lrtzlykjkzrgb85/",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "How to Play SwordBattle.io"
      },
      {
        "type": "h3",
        "text": "Beware of the Animals!"
      },
      {
        "type": "h3",
        "text": "The Lava Field"
      },
      {
        "type": "h3",
        "text": "Throw the Sword"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "Discover Other Games"
      }
    ],
    "controls": [
      "Desktops and Computers",
      "Mouse: To Look AroundWASD or the Arrow Keys: MoveLeft-Click or the Spacebar: Swing the SwordC Key or Right-Click: Throw the SwordEnter: Chat",
      "Mobile Devices",
      "Use the touchscreen and the virtual joystick."
    ],
    "howToPlay": "Grab your virtual sword and get ready to face many other players worldwide. Everyone here is alone. So, you must protect yourself and attack when needed.There is a vast map divided into three parts. Each has specific settings: The Snowy Area, The Grassy Area and The Lava Field.These settings are connected to each other by water channels. Right in the middle is the spawning point.Head towards an area, and you will encounter players. Use your left mouse button or the space key to attack them.The more you eliminate opponents, the more you earn coins. You can use them to get new skins from the shop section.",
    "tips": "",
    "developer": "Coder Gautam developed SwordBattle.io.",
    "similarGames": []
  },
  "fullContent": "Home› BattleSwordBattle ioBy OnlineGames.ioMake Game Full ScreenWelcome to the sword duels! SwordBattle.io is a 2D battle game where you will use your sword often. There will be many online players on the map. Some are big, some are minor. When you come across them, feel free to chop them up! As you eliminate the players, you will level up and get bigger. Try to take your place on the leaderboard in this io game!How to Play SwordBattle.ioGrab your virtual sword and get ready to face many other players worldwide. Everyone here is alone. So, you must protect yourself and attack when needed.There is a vast map divided into three parts. Each has specific settings: The Snowy Area, The Grassy Area and The Lava Field.These settings are connected to each other by water channels. Right in the middle is the spawning point.Head towards an area, and you will encounter players. Use your left mouse button or the space key to attack them.The more you eliminate opponents, the more you earn coins. You can use them to get new skins from the shop section.Beware of the Animals!Besides other swordsmen, there are many wild animals on the map. You should pay attention to them as they may hurt you. Avoid the ones with the red eye. They can attack you. To dodge their attacks, you can run to the water channels. They can't get in there. The other animals won't touch you unless you do anything to them.The Lava FieldThe red area you see on the mini-map is the Lava Field. It has lots of igneous rocks. If you touch any of them, your health bar will start to decrease. When you enter the field, move forward cautiously. Stay away from the hot rocks. Remember, if you encounter an enemy while in contact with one of them, they will have the upper hand.Throw the SwordIn close combat, swing your sword to your opponent. On the other hand, if you want to attack a rival who is far away, then use the C key and throw your sword at them. This way, you can hurt the opponents from afar. But keep in mind that you can't send swords successively. You have to wait a few seconds to send the second sword.ControlsDesktops and ComputersMouse: To Look AroundWASD or the Arrow Keys: MoveLeft-Click or the Spacebar: Swing the SwordC Key or Right-Click: Throw the SwordEnter: ChatMobile DevicesUse the touchscreen and the virtual joystick.DeveloperCoder Gautam developed SwordBattle.io.Discover Other GamesMini Shooter may also take your interest. In the game, you will take control of your mini-character. You will encounter many other players in every corner. Take them down when you see them immediately!If you are looking for more, we recommend you look at the io games online on OnlineGames.io. We believe you will find another enjoyable game. Additionally, keep coming back to discover new and thrilling games!This article was updated on July 23, 20242DActionArenaBattleFreeFunio GamesMobileMouseMultiplayerShootingWar",
  "extractedAt": "2025-06-10T05:35:25.864Z",
  "localThumbnail": "SwordBattle io_1749533725864.jpg"
}