{
  "url": "https://www.onlinegames.io/sword-play-ninja-slice-runner/",
  "title": "Sword Play Ninja Slice Runner",
  "category": "/t/arcade/",
  "thumbnail": "https://www.onlinegames.io/media/posts/1016/sword-play.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/1016/sword-play.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/1016/responsive/sword-play-xs.jpg 384w, https://www.onlinegames.io/media/posts/1016/responsive/sword-play-sm.jpg 600w, https://www.onlinegames.io/media/posts/1016/responsive/sword-play-md.jpg 768w, https://www.onlinegames.io/media/posts/1016/responsive/sword-play-lg.jpg 1200w",
    "alt": "Sword Play Ninja Slice Runner Play Online",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://html5.gamedistribution.com/f37e6802a81944d7bbe172e496b79eb9/?gd_sdk_referrer_url=https://www.onlinegames.io/sword-play-ninja-slice-runner/",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "How to Play Sword Play Ninja Slice Runner Online"
      },
      {
        "type": "h2",
        "text": "Customize Your Blade and Style Your Swings"
      },
      {
        "type": "h3",
        "text": "Sword Skins"
      },
      {
        "type": "h3",
        "text": "Sword Trails"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "More Ninja Games Await"
      }
    ],
    "controls": [
      "Swipe on the screen to slash enemies and obstacles.Hold and drag to control your sword’s direction.Timing and precision are everything!"
    ],
    "howToPlay": "Start running down a path filled with enemies.As you move, swipe to slice through foes who rush at you with weapons.Time your moves to dodge traps like swinging axes or bullets.Finish each level by defeating the final enemy or completing a stylish slow-motion slash. Along the way, you'll face:Shielded enemies who need multiple hits.Special weapons like dual katanas or energy blades.Satisfying cinematic slow-mo kills that make you feel like a true ninja.",
    "tips": "",
    "developer": "Sword Play! Ninja Slice Runner game was developed by PlayGama for quick fun.",
    "similarGames": []
  },
  "fullContent": "Home› NinjaSword Play Ninja Slice RunnerBy OnlineGames.ioMake Game Full ScreenGrab your katana and get ready to slice your way through waves of enemies! Sword Play Ninja Slice Runner is an action runner game where you become a blade-wielding ninja on a high platform filled with enemies. You'll be slicing flying shurikens, bullets, shields or dodging massive bullets, just with your fingers moving.The game throws you into a simple but colorful 3D world that changes in each level. Complete sword fights, slicing action, and enjoy satisfying slow-motion effects. It’s a mix of Fruit Ninja’s slicing satisfaction and the fun of endless runners.ControlsSwipe on the screen to slash enemies and obstacles.Hold and drag to control your sword’s direction.Timing and precision are everything!How to Play Sword Play Ninja Slice Runner OnlineStart running down a path filled with enemies.As you move, swipe to slice through foes who rush at you with weapons.Time your moves to dodge traps like swinging axes or bullets.Finish each level by defeating the final enemy or completing a stylish slow-motion slash. Along the way, you'll face:Shielded enemies who need multiple hits.Special weapons like dual katanas or energy blades.Satisfying cinematic slow-mo kills that make you feel like a true ninja.Customize Your Blade and Style Your SwingsOne of the coolest parts of Sword Play! Ninja Slice Runner is the wide range of sword skins and trail effects you can unlock in the shop. They make your slicing feel even more fun and rewarding. Here’s what you’ll find:Sword SkinsYou can unlock random swords with 700 coins or collect specific ones by leveling up or completing challenges. Change up your blade with unique weapons, from classic katanas to quirky alternatives:A jagged flame-shaped sword (your default)A giant black cleaverA sci-fi energy blade (pixel-style!)A chainsaw sword for intense slicingA key-shaped sword (unlock it with keys from gameplay)Even a hockey stick or a curved fantasy bow at higher levelsSword TrailsLeave a mark, literally. Leave a trail when you swing your sword. These visual effects make every attack more exciting, especially during slow-mo moments.Trails add an extra flair to every slash. Unlock them in the shop and have trail effects like:Smooth white arcs or star-studded slashesBubble trails or lightning-style swingsColorful effects like glowing pink trails (unlocked at level 10)Fiery orange swings (unlocked at level 20)Tip: Trails don’t change gameplay but they do make every hit more stylish and VR-like experience. Try combining swords and trails to match your ninja vibe!DeveloperSword Play! Ninja Slice Runner game was developed by PlayGama for quick fun. More Ninja Games AwaitIf you're craving more stealthy swordplay, check out Blocky Parkour Ninja. It’s a 3D ninja platformer where you sneak through enemy bases, dodge traps with swift precision. With its blocky visuals and fun gameplay, it’s a great pick for players who enjoy ninja games online.This article was updated on May 29, 20251 Player3DArcadeAvoidCombatFreeMobileMouseNinjaParkourRunning",
  "extractedAt": "2025-06-10T05:12:36.720Z",
  "localThumbnail": "Sword Play Ninja Slice Runner_1749532356720.jpg"
}