{
  "url": "https://www.onlinegames.io/ultimate-flying-car-2/",
  "title": "Ultimate Flying Car 2",
  "category": "/t/car/",
  "thumbnail": "https://www.onlinegames.io/media/posts/880/ultimate-flying-car-2.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/880/ultimate-flying-car-2.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/880/responsive/ultimate-flying-car-2-xs.jpg 384w, https://www.onlinegames.io/media/posts/880/responsive/ultimate-flying-car-2-sm.jpg 600w, https://www.onlinegames.io/media/posts/880/responsive/ultimate-flying-car-2-md.jpg 768w, https://www.onlinegames.io/media/posts/880/responsive/ultimate-flying-car-2-lg.jpg 1200w",
    "alt": "Ultimate Flying Car 2 Online Game",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://html5.gamedistribution.com/33ac31671df249cb964b7b0fd44ec464/?gd_sdk_referrer_url=https://www.onlinegames.io/ultimate-flying-car-2/",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Free Drive Mode"
      },
      {
        "type": "h2",
        "text": "Racing Mode"
      },
      {
        "type": "h2",
        "text": "2-Player Split-Screen Car Game"
      },
      {
        "type": "h2",
        "text": "Explore More Car Games"
      }
    ],
    "controls": [
      "Player 1",
      "Move: Use W, A, S, D oNOS: Press Left Shift.Explode: Press F.Camera: Press C.Look Back: Press T.Reset: Press R.",
      "Player 2",
      "Move: Use Arrow Keys.NOS: Press M.Explode: Press J.Camera: Press O.Look Back: Press L.Reset: Press U."
    ],
    "howToPlay": "",
    "tips": "",
    "developer": "",
    "similarGames": []
  },
  "fullContent": "Home› CarUltimate Flying Car 2By OnlineGames.ioMake Game Full ScreenEver imagined racing high-speed cars that can fly? In Ultimate Flying Car 2, you'll experience the perfect blend of ground-pounding races and gravity-defying stunts. Explore sprawling cities or challenge your friends in epic competitions. This game offers everything a car gamer could dream of. With jaw-dropping visuals, detailed and diverse maps, and unique physics, it is even more advanced than the first installment of the series, Ultimate Flying Car. Last but not least, there are two exhilarating game modes: free ride and racing. So, it's time to buckle up and let your imagination take the wheel!ControlsPlayer 1Move: Use W, A, S, D oNOS: Press Left Shift.Explode: Press F.Camera: Press C.Look Back: Press T.Reset: Press R.Player 2Move: Use Arrow Keys.NOS: Press M.Explode: Press J.Camera: Press O.Look Back: Press L.Reset: Press U.Free Drive ModeIn Free Drive, you're not bound by tracks or time limits. It's all about exploration and creativity. Drive through massive open-world cities, complete with ramps and teleport points that let you fly your car and unlock new areas.Gather gems scattered throughout the world to unlock hidden surprises or upgrades.Launch your car off ramps and glide through the skies. Flying your car mid-air feels as thrilling as it sounds!Head to the stadium in the city and switch gears to an entirely different game—car football! Smash, dash, and score goals while driving your vehicle.From bustling urban landscapes to industrial zones where you can drive in the mining fields, there's always something new to discover in San Saint Cali and White Forest State.Find teleportation points scattered around the map to zip across the world in seconds, giving you access to harder-to-reach areas or simply saving time.Racing ModeRacing Mode takes the adrenaline to a whole new level. Compete in thrilling four-player races where the action is nonstop, and every second counts.Play against your friends in split-screen mode, keeping the competition close and the action intense.Navigate through tracks teeming with barriers, hazards, and unexpected twists.Clear the way by destroying obstacles with a press of a button—Player 1 can use F, and Player 2 uses J. Time it right for maximum impact!Each track is designed to test your reflexes, strategy, and driving skills. Whether you're racing solo against AI or battling your friends, every race is a unique challenge!2-Player Split-Screen Car GameUltimate Flying Car 2 shines with its split-screen mode. Grab a friend and compete in Free Drive or Racing Mode on the same screen. Whether you're working together to explore or going head-to-head in a race, the split-screen feature enhances the fun tenfold.In Free Drive, team up to uncover hidden gems or pull off synchronized stunts for double the excitement.In racing mode, face off and see who has the best driving and tactical skills.Explore More Car GamesUltimate Flying Car 2 is more than just a racing game—it's a playground for adventurers alike. Fly through ramps, smash through obstacles or score goals in car football; the gameplay is so diverse that it'll keep you hooked at your desk. If you ever like to play a similar split-screen challenge, take a look at the 2 player Crazy Racer. Remember, boredom ends when OnlineGames.io opens. Have fun, pals!  This article was updated on November 25, 20242 Player3DCarCrazyDrivingFlyingFreeFunRacingSimulatorSpeedStuntUnity",
  "extractedAt": "2025-06-10T05:24:38.682Z",
  "localThumbnail": "Ultimate Flying Car 2_1749533078682.jpg"
}