{
  "url": "https://www.onlinegames.io/vegas-crime-city/",
  "title": "Vegas Crime City",
  "category": "/t/car/",
  "thumbnail": "https://www.onlinegames.io/media/posts/721/Vegas-Crime-City-Online.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/721/Vegas-Crime-City-Online.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/721/responsive/Vegas-Crime-City-Online-xs.jpg 384w, https://www.onlinegames.io/media/posts/721/responsive/Vegas-Crime-City-Online-sm.jpg 600w, https://www.onlinegames.io/media/posts/721/responsive/Vegas-Crime-City-Online-md.jpg 768w, https://www.onlinegames.io/media/posts/721/responsive/Vegas-Crime-City-Online-lg.jpg 1200w",
    "alt": "Vegas Crime City Play Online",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://unblocked-games.s3.amazonaws.com/games/vegas-crime-city/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "How To Play"
      },
      {
        "type": "h2",
        "text": "GTA-like Missions"
      },
      {
        "type": "h2",
        "text": "More Games Like This"
      }
    ],
    "controls": [
      "WASD: to moveLeft Shift: SprintSpace to jumpQ to rollE or 1 to change weaponLeft mouse click to shootRight mouse click to aimTab to toggle pause"
    ],
    "howToPlay": "Complete the task within the time limit to pass each level.In the first few levels, you will learn to steer a motorbike or car and practice shooting. After that, you will be given more challenging tasks to complete within a specific time limit. As the clock is ticking, don't forget to sprint by pressing the left shift key while walking. As you progress through the levels, the number of enemies will increase, so it is essential to get accustomed to the available weapons. You can change weapons by pressing the E key when you need to.Try to find the ideal weapon for each task. For instance, with sniper rifles, it takes a few bullets to eliminate an enemy, whereas using a bazooka, one shot is enough to clear a few of them.",
    "tips": "",
    "developer": "",
    "similarGames": []
  },
  "fullContent": "Home› ShootingVegas Crime CityBy OnlineGames.ioMake Game Full ScreenWelcome to the crime-ridden city of Vegas! With bad guys lurking around every corner, the streets are far from safe. As a skilled and athletic female spy with exceptional shooting abilities, your mission is to clear the mafia in Vegas. Don't delay - it's time to take action and make this city a safer place for all.Vegas Crime City is a GTA-inspired mission-based shooting and driving game. Walk, ride or drive to certain destinations, eliminate the targets and pass levels. The game has good-quality 3D graphics and realistic sound effects. The difficulty of the levels is adjusted so as not to exhaust or deter any gamer. ControlsWASD: to moveLeft Shift: SprintSpace to jumpQ to rollE or 1 to change weaponLeft mouse click to shootRight mouse click to aimTab to toggle pauseHow To PlayComplete the task within the time limit to pass each level.In the first few levels, you will learn to steer a motorbike or car and practice shooting. After that, you will be given more challenging tasks to complete within a specific time limit. As the clock is ticking, don't forget to sprint by pressing the left shift key while walking. As you progress through the levels, the number of enemies will increase, so it is essential to get accustomed to the available weapons. You can change weapons by pressing the E key when you need to.Try to find the ideal weapon for each task. For instance, with sniper rifles, it takes a few bullets to eliminate an enemy, whereas using a bazooka, one shot is enough to clear a few of them.GTA-like MissionsYou may encounter levels where you drive or ride to a certain stop and engage in battles on various parts of the city.Make use of the red dots on the map and try to arrive early using shortcuts.More Games Like ThisIf you enjoy GTA games, where you complete missions and collect bonuses, our recommendation is GTA Simulator. That game will give you a more in-depth storyline, city traffic, pedestrians coming along your way, and more complex duties to complete. GTA Simulator is one of the most played games on OnlineGames.io in its category, but not your only alternative. Take a look at the shooting games to pick among hundreds of titles appealing to many gamers every day.This article was updated on November 7, 20241 Player3DActionBattleCarFreeGTAGunShootingSimulatorWeapon",
  "extractedAt": "2025-06-10T05:30:06.049Z",
  "localThumbnail": "Vegas Crime City_1749533406049.jpg"
}