{
  "url": "https://www.onlinegames.io/venge-io/",
  "title": "Venge io",
  "category": "/t/io-games/",
  "thumbnail": "https://www.onlinegames.io/media/posts/391/Venge-Io-Keyboard-Controls.webp",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/391/Venge-Io-Keyboard-Controls.webp",
    "srcset": "https://www.onlinegames.io/media/posts/391/responsive/Venge-Io-Keyboard-Controls-xs.webp 384w, https://www.onlinegames.io/media/posts/391/responsive/Venge-Io-Keyboard-Controls-sm.webp 600w, https://www.onlinegames.io/media/posts/391/responsive/Venge-Io-Keyboard-Controls-md.webp 768w, https://www.onlinegames.io/media/posts/391/responsive/Venge-Io-Keyboard-Controls-lg.webp 1200w",
    "alt": "Venge Io Keyboard Controls",
    "width": 750,
    "height": 224,
    "className": "is-loaded",
    "parentClass": "post__image post__image--center is-loaded"
  },
  "gameFrame": "https://venge.io/",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Official Maps in Venge io"
      },
      {
        "type": "h2",
        "text": "Weapons"
      },
      {
        "type": "h2",
        "text": "Features"
      },
      {
        "type": "h2",
        "text": "How to Play Venge io?"
      },
      {
        "type": "h2",
        "text": "How to Play with Friends in Venge io?"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "More Games Like Venge io"
      }
    ],
    "controls": [],
    "howToPlay": "WASD - MoveSpace Bar - JumpLMB - ShootRMB or Shift - Aim Down SightScroll Wheel - Switch Between WeaponsR - ReloadE - Melee attackF - Throw GrenadeB - BuyH - DanceEnter - ChatEscape - LeaderboardsHold B - Turn Cards",
    "tips": "",
    "developer": "Venge io was created by OnRush Studio.",
    "similarGames": []
  },
  "fullContent": "Home› ShootingVenge ioBy OnlineGames.ioMake Game Full ScreenVenge io is a fun online shooting game with fast-paced and competitive gameplay. Be on full alert since Venge io is an FPS (first-person shooter) game. Enemies might approach stealthily from anywhere. Venge io offers hours of addictive playing thanks to its rich features, realistic sound effects, and smooth loading on your browser. Start the battle now with great weapons. Stay connected with your squad in the chat section. And remember to make your victory dance after eliminating rivals cruelly. Play Venge io for free without downloading on OnlineGames.io and put your name on the leaderboard.Official Maps in Venge ioSierra: The primary map with a compact design that is packed with action. To unlock new abilities, capture the flag point within a minute.Tundra: Experience combat in the freezing winter of the Tundra map with the Arms Race mod enabled. This mode will switch your weapon after each successful kill.Mistle: The largest map in Venge io. Perfect for team playing and sniping. In order to win in Mistle map, push the minecart towards your opponent's side.Temple: Collect the blackcoins after eliminating enemies. Summon the coins to the temple after each kill.SandStormBlitz: Ideal for snipers, especially in deathmatch mode.WeaponsScarAK47M4ShotgunTec-9 (SMG)SniperLight Machine Gun (LMG)Desert Eagle (pistol)Features5 maps to explore10 different parkour mapsplay with your friends in private roomsSniper Game ModeCustomizable heroesVarious weapons and charmsPlay with your fellow continentals by selecting between serversProgress can be saved by registrationHow to Play Venge io?WASD - MoveSpace Bar - JumpLMB - ShootRMB or Shift - Aim Down SightScroll Wheel - Switch Between WeaponsR - ReloadE - Melee attackF - Throw GrenadeB - BuyH - DanceEnter - ChatEscape - LeaderboardsHold B - Turn CardsHow to Play with Friends in Venge io?Click the \"+Play with Friends\" button in the bottom right of the screen. Copy the invitation link and send it to your friends to play together.DeveloperVenge io was created by OnRush Studio.More Games Like Venge ioIf you like FPS io games, we strongly suggest trying out any of these:Armed Forces.ioMasked Special ForcesShooterZ.ioThis article was updated on February 2, 20243DActionBattleBattle RoyaleCombatFirst Person ShooterFreeGunio GamesMultiplayerShootingSniperSurvivalWarWeapon",
  "extractedAt": "2025-06-10T05:33:56.404Z",
  "localThumbnail": "Venge io_1749533636405.jpg"
}