{
  "url": "https://www.onlinegames.io/watermelon-suika/",
  "title": "Watermelon Suika",
  "category": "/t/puzzle/",
  "thumbnail": "https://www.onlinegames.io/media/posts/780/Watermelon-Suika.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/780/Watermelon-Suika.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/780/responsive/Watermelon-Suika-xs.jpg 384w, https://www.onlinegames.io/media/posts/780/responsive/Watermelon-Suika-sm.jpg 600w, https://www.onlinegames.io/media/posts/780/responsive/Watermelon-Suika-md.jpg 768w, https://www.onlinegames.io/media/posts/780/responsive/Watermelon-Suika-lg.jpg 1200w",
    "alt": "Watermelon Suika Play Online",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://html5.gamedistribution.com/893500b2a6ac4d08889dd6a93cc08700/?gd_sdk_referrer_url=https://www.onlinegames.io/watermelon-suika-game/",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "How to Play Watermelon Suika"
      },
      {
        "type": "h2",
        "text": "Shake the Box"
      },
      {
        "type": "h2",
        "text": "Star Suika and Cat Suika"
      },
      {
        "type": "h2",
        "text": "Adventure Levels"
      },
      {
        "type": "h2",
        "text": "More Online Merging Games"
      }
    ],
    "controls": [
      "Mouse Controls",
      "Hold LMB to move and release to drop",
      "Keyboard Controls",
      "Use arrow keys to movePress the spacebar to drop",
      "Mobile Controls",
      "Drag your finger to move and release to drop"
    ],
    "howToPlay": "It's easy to play but captivating. Start with a blueberry. Drop into the box.You have endless sources of fruits. A new one will be on your tweezers after dropping one. Drop them all in a way that identical fruits collide with each other.A new fruit will emerge when two of the same shape collide.For example, two blueberries can be transformed into one strawberry.Merge your way to much bigger fruits such as pears, kiwis, coconuts, and melons.",
    "tips": "",
    "developer": "",
    "similarGames": []
  },
  "fullContent": "Home› MergeWatermelon SuikaBy OnlineGames.ioMake Game Full ScreenSummer surrounds us with upcoming vacations, ice cream trucks on every corner and DELICOUS FRUITS! Everybody knows that fruits taste very different and come in various colors and shapes in the summertime, from berries to cherries, bananas to ananas, coconuts to WATERMELONS!If you're fond of summer fruits like us, you will love this game: Watermelon Suika is an online merging game. You start with tiny little blueberries, drop them into a box, and match them up with identical ones until they change into huge watermelons. Engage and merge, or challenge yourself with puzzle levels! Let's get started!ControlsMouse ControlsHold LMB to move and release to dropKeyboard ControlsUse arrow keys to movePress the spacebar to dropMobile ControlsDrag your finger to move and release to dropHow to Play Watermelon SuikaIt's easy to play but captivating. Start with a blueberry. Drop into the box.You have endless sources of fruits. A new one will be on your tweezers after dropping one. Drop them all in a way that identical fruits collide with each other.A new fruit will emerge when two of the same shape collide.For example, two blueberries can be transformed into one strawberry.Merge your way to much bigger fruits such as pears, kiwis, coconuts, and melons.Shake the BoxOnce in a while, fruits might use some help to reach each other. You can push the box by pressing the icons at the bottom of your screen.You have 5 push limits for each side in a game. But if you shake the box too hard, fruits may drop out of the box, leading to the end of the game.Star Suika and Cat SuikaStar Suika: Suppose you'd like to play the game with star-shaped fruits. Open star mode on the main menu. Playing star mode is a bit harder as the fruits will not roll as much as in classic mode.Cat Suika: You can play the game with cats as well. From orange tabbies to chubby Persian cats, you can merge them until you get the Balinese Cat. You'll explore many cat species along the way.Adventure LevelsWatermelon Suika is an online game offering diversity in gameplay. Adventure levels twist the game by adding a touch of logic problems. Puzzle levels offer physics puzzles, where you drop the fruit in specific locations to jump over a platform. On the other hand, draw levels involve drawing objects around the box to move fruits so that they merge into one another.More Online Merging GamesIf you like merging games, here is a great game that'll appetize you even more. Combine cakes to run a bakery and discover new recipes, such as cupcakes and donuts.Find more online puzzle games on OnlineGames.io by following the link.This article was updated on January 14, 20251 Player2DClickerColorCozyCuteFreeHTML5IdleLogicMergeMobileMousePuzzle",
  "extractedAt": "2025-06-10T05:45:59.445Z",
  "localThumbnail": "Watermelon Suika_1749534359445.jpg"
}