{
  "url": "https://www.onlinegames.io/we-become-what-we-behold/",
  "title": "We Become What We Behold",
  "category": "/t/adventure/",
  "thumbnail": "https://www.onlinegames.io/media/posts/728/We-Become-What-We-Behold.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/728/We-Become-What-We-Behold.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/728/responsive/We-Become-What-We-Behold-xs.jpg 384w, https://www.onlinegames.io/media/posts/728/responsive/We-Become-What-We-Behold-sm.jpg 600w, https://www.onlinegames.io/media/posts/728/responsive/We-Become-What-We-Behold-md.jpg 768w, https://www.onlinegames.io/media/posts/728/responsive/We-Become-What-We-Behold-lg.jpg 1200w",
    "alt": "We Become What We Behold Play Online",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2024/more/we-become-what-we-behold/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "How to Play We Become What Behold"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "Editor's Note"
      },
      {
        "type": "h2",
        "text": "More Games Like This"
      }
    ],
    "controls": [
      "Hover your mouse to move the cameraLeft click to capture"
    ],
    "howToPlay": "The scene is yours. Go and capture silly scenes of conflicts, exaggerate the news, and guide people to a craze. With a left click, take pictures of unusual events.Find the unhappy individuals walking around and observe them closely. When they take action (this might be yelling at someone or something bigger), picture them. Each piece of news will negatively influence and offend people. Soon they'll split into groups, increasing the conflict more and more.Repeat this vicious circle until the violence starts and see how the media corrupts and disrupts the peace in society.Despite all the negativity bias, WBWWB offers funny and entertaining gameplay.",
    "tips": "",
    "developer": "Nicky Case created this game.",
    "similarGames": []
  },
  "fullContent": "Home› CrazyWe Become What We BeholdBy OnlineGames.ioMake Game Full ScreenWe Become What Behold is a point-and-click game with a strong message. As a player, you step into the shoes of a news reporter tasked with observing the lives of the people of a town.Inhabitants of the town are circles, squares, and even crickets. All are busy with their own lives, walking around the city square. Some are angry while some are loving. Your job is to catch interesting scenes and broadcast news on a jumbotron. But here is the twist: the people of this town do not appreciate peaceful news at all. So, capture minor misunderstandings, amplify them, and see how people react accordingly. We Become What Behold offers 5 minutes of playing time. However, what the game emphasizes is enormous. In We Become What Behold, you will experience a psychological phenomenon known as \"negativity bias\". This concept was first proposed by two psychologists in 1982. They suggested that humans are more influenced by negative news revoking conflict, violence, and fear. We can say that this bias is deeply transfused in human cognition. The game's developer, Nicky Case, has masterfully incorporated this notion into the gameplay, allowing players to witness its effects firsthand in a tragicomic way.ControlsHover your mouse to move the cameraLeft click to captureHow to Play We Become What BeholdThe scene is yours. Go and capture silly scenes of conflicts, exaggerate the news, and guide people to a craze. With a left click, take pictures of unusual events.Find the unhappy individuals walking around and observe them closely. When they take action (this might be yelling at someone or something bigger), picture them. Each piece of news will negatively influence and offend people. Soon they'll split into groups, increasing the conflict more and more.Repeat this vicious circle until the violence starts and see how the media corrupts and disrupts the peace in society.Despite all the negativity bias, WBWWB offers funny and entertaining gameplay.DeveloperNicky Case created this game.Editor's NoteWhat I love most about the game is how the developer, Nicky Case, kept the gameplay and visuals simple so as not to overshadow the game's thought-provoking concept. This is why he features people as small stickmen with circle and square heads. Despite the simplicity, the artworks and sounds of WBWWB are well-crafted. In conclusion, I think We Become What We Behold is a kind of game that many game designers might admire for its authenticity and regret not having thought of themselves.More Games Like ThisIf you'd like to play games with a strong message behind them, we recommend playing Spend Elon Musk Money. It is a game that highlights the wealth of the world's top 0.001%. You get to be the multibillionaire Elon Musk and try to consume all the money in a virtual market. All are available on that single webpage, from a slice of pizza to mansions, yachts, and ultra-expensive artwork. This article was updated on May 2, 20241 Player2DAdventureArcadeCrazyFreeFunnyHTML5MouseSimulator",
  "extractedAt": "2025-06-10T05:08:47.884Z",
  "localThumbnail": "We Become What We Behold_1749532127885.jpg"
}