{
  "url": "https://www.onlinegames.io/wedding-planner/",
  "title": "Wedding Planner",
  "category": "/new-games/",
  "thumbnail": "https://www.onlinegames.io/media/posts/489/Wedding-Planner.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/489/Wedding-Planner.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/489/responsive/Wedding-Planner-xs.jpg 384w, https://www.onlinegames.io/media/posts/489/responsive/Wedding-Planner-sm.jpg 600w, https://www.onlinegames.io/media/posts/489/responsive/Wedding-Planner-md.jpg 768w, https://www.onlinegames.io/media/posts/489/responsive/Wedding-Planner-lg.jpg 1200w",
    "alt": "Wedding Planner Play Online",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://html5.gamedistribution.com/a994bec074df4094898896cc89cf318b/?gd_sdk_referrer_url=https://www.onlinegames.io/wedding-planner",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "How to Play Wedding Planner?"
      },
      {
        "type": "h3",
        "text": "Preparing the Bride"
      },
      {
        "type": "h3",
        "text": "Preparing the Groom"
      },
      {
        "type": "h3",
        "text": "Wedding Cake"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "What is More?"
      }
    ],
    "controls": [
      "Simply use your mouse click to prepare the wedding."
    ],
    "howToPlay": "Take charge of every aspect of a wedding ceremony in Wedding Planner, the ultimate wedding preparation game! From choosing the perfect bridal attire to designing the wedding cake, create your dream wedding celebration.",
    "tips": "",
    "developer": "",
    "similarGames": []
  },
  "fullContent": "Home› WeddingWedding PlannerBy OnlineGames.ioMake Game Full ScreenAs an organizer, all wedding preparations are on your shoulders! Wedding Planner is a browser game where you are responsible for planning a wedding ceremony. You literally have to take care of everything. The bride's dress, veil, the groom's suit and even the wedding cake… Create your dream wedding!How to Play Wedding Planner?Take charge of every aspect of a wedding ceremony in Wedding Planner, the ultimate wedding preparation game! From choosing the perfect bridal attire to designing the wedding cake, create your dream wedding celebration.Preparing the BrideWe will start by preparing the bride first and then move on to the groom. Priority goes to the queen of the night. We must choose the bride's dress and veil carefully. These will be the most eye-catching part of the wedding ceremony.The shoes and accessory choices that follow should also be compatible with the wedding dress. A suggestion from us: if the wedding dress is flashy, you can go for simple accessories!Then we came to the bride's head area. Give her hair an image and then put the crown on it.Finally, decide on the flower bouquet and proceed to prepare the groom.Preparing the GroomIt's the groom's turn! First of all, decide which groom suits your bride. Then start preparing himCreate a suit by choosing the groom's jacket and trousers. Also, choose a shirt that fits his suit.Complete the groom's preparation by choosing his shoes and tie. If you want, you can also select a bow tie instead of a regular tie.Wedding CakeDeciding on a wedding cake is even more complex than preparing the groom! You need to determine the cake's design and what it will be served with.Choose the cream between the layers and on top of the cake according to your taste.After determining the decorations and flowers you will place on the cake, you are now ready for the big day!ControlsSimply use your mouse click to prepare the wedding.What is More?Try Wedding Beauty Salon, another wedding game where you make a bride to marry if you love playing Wedding Planner. You are the bride's stylist in this game, and she needs your taste in fashion. Alternatively, you can also check the kids games collection on OnlineGames.io for further options. To be able to find new games, keep coming back!This article was updated on February 20, 20242DDress UpFashionFreeGirlHTML5KidsLoveMobileMouseWedding",
  "extractedAt": "2025-06-10T06:20:08.152Z",
  "localThumbnail": "Wedding Planner_1749536408152.jpg"
}