{
  "url": "https://www.onlinegames.io/weird-dance-on-wednesday/",
  "title": "Weird Dance on Wednesday",
  "category": "/new-games/",
  "thumbnail": "https://www.onlinegames.io/media/posts/589/Weird-Dance-on-Wednesday.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/589/Weird-Dance-on-Wednesday.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/589/responsive/Weird-Dance-on-Wednesday-xs.jpg 384w, https://www.onlinegames.io/media/posts/589/responsive/Weird-Dance-on-Wednesday-sm.jpg 600w, https://www.onlinegames.io/media/posts/589/responsive/Weird-Dance-on-Wednesday-md.jpg 768w, https://www.onlinegames.io/media/posts/589/responsive/Weird-Dance-on-Wednesday-lg.jpg 1200w",
    "alt": "Weird Dance on Wednesday Free Online Game",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://play.wgplayground.com/ifr/621312364da0473ac6839a0c6d918b0d",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "How to Play Weird Dance on Wednesday"
      },
      {
        "type": "h3",
        "text": "Choose Wednesday's Makeup"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "Similar Girl Games"
      }
    ],
    "controls": [
      "Swipe or drag your mouse as instructed on the screen."
    ],
    "howToPlay": "You will see Wednesday with three different makeup options when you enter the game. You will choose one and apply that makeup to Wednesday. All three makeup options are very gothic and extraordinary. Wednesday will be so attractive that all eyes will be on her at the prom, especially when it's time for that dance performance!",
    "tips": "",
    "developer": "Weird Dance on Wednesday is created by Dl Girls.",
    "similarGames": [
      {
        "title": "Witch Beauty Salon",
        "url": "https://www.onlinegames.io/witch-beauty-salon/"
      }
    ]
  },
  "fullContent": "Home› MakeupWeird Dance on WednesdayBy OnlineGames.ioMake Game Full ScreenWeird Dance on Wednesday is a fantastic girl game where you are responsible for doing Wednesday's makeup for her high school prom. There will be a special dance show at the prom. Wednesday has been preparing for this for weeks. Give her such makeup for this dance performance that she will remain in everyone's memory for years to come. If you're ready, let's start preparing the goth daughter of the Addams family in one of the craziest girl games. 🪄How to Play Weird Dance on WednesdayYou will see Wednesday with three different makeup options when you enter the game. You will choose one and apply that makeup to Wednesday. All three makeup options are very gothic and extraordinary. Wednesday will be so attractive that all eyes will be on her at the prom, especially when it's time for that dance performance!Choose Wednesday's MakeupStart by choosing one of these three scary makeups the game gives you. The game will guide you with signs while applying makeup. You will perform the makeup by following these signs with the mouse. Sometimes, you will click where the arrow points; sometimes, you will complete the process by making different movements with your mouse. Each move will complete a specific makeup step.Depending on the makeup type you choose, you will give color to Wednesday's eyebrows and apply lipstick to her.Don't forget to apply eyeliner and contour to her face. You can even make freckles and moles on her face with eyeliner. Illuminating her face and giving it a completely white appearance makes things even more gothic. Finally, send her on stage by plumping her eyebrows and eyelashes.When the makeup process is completed, she will take the stage and be the most famous creature of the high school prom with all her self-confidence!ControlsSwipe or drag your mouse as instructed on the screen.DeveloperWeird Dance on Wednesday is created by Dl Girls.Similar Girl GamesIf you like playing Weird Dance on Wednesday, you may also try Witch Beauty Salon. In this dress up game, you take on the role of a witch with roots in the thirteenth century. You have an obligation to make sure she looks her best at a witch party! Make her the most terrifying creature among the other witches by using all your imagination. You can share in the comments section which makeup you like on Wednesday!This article was updated on February 20, 20241 Player2DCrazyDress UpFreeGirlHTML5KidsMakeupMobileMouse",
  "extractedAt": "2025-06-10T06:15:36.026Z",
  "localThumbnail": "Weird Dance on Wednesday_1749536136026.jpg"
}