{
  "url": "https://www.onlinegames.io/words-of-wonders/",
  "title": "Words of Wonders",
  "category": "/t/puzzle/",
  "thumbnail": "https://www.onlinegames.io/media/posts/975/words-of-wonders-online.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/975/words-of-wonders-online.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/975/responsive/words-of-wonders-online-xs.jpg 384w, https://www.onlinegames.io/media/posts/975/responsive/words-of-wonders-online-sm.jpg 600w, https://www.onlinegames.io/media/posts/975/responsive/words-of-wonders-online-md.jpg 768w, https://www.onlinegames.io/media/posts/975/responsive/words-of-wonders-online-lg.jpg 1200w",
    "alt": "Words of Wonders Play Online",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://html5.gamedistribution.com/c8ba1cb2f23d40b5a19fd606fcc3e50b/?gd_sdk_referrer_url=https://www.onlinegames.io/words-of-wonders/",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Form Words"
      },
      {
        "type": "h2",
        "text": "Complete Crosswords"
      },
      {
        "type": "h2",
        "text": "Use Hints to Fill Up"
      },
      {
        "type": "h2",
        "text": "The Hammer Tool"
      },
      {
        "type": "h3",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "Similar Word Games"
      },
      {
        "type": "h2",
        "text": "Technical Info"
      }
    ],
    "controls": [
      "Computer: Click and drag your mouse to connect letters.Mobile/Tablet: Just tap and swipe your finger across the letters to form words."
    ],
    "howToPlay": "",
    "tips": "",
    "developer": "Words of Wonders was created by Fugo Games and Famobi. They make fun puzzle games for all ages, and they love helping players learn new words while having fun. The best part is they localized the game so you can play Words of Wonders in 38 languages besides English. Just go to settings to switch to one of the available languages. You can see a list of languages available below.",
    "similarGames": [
      {
        "title": "Text Talk",
        "url": "https://www.onlinegames.io/text-talk/"
      },
      {
        "title": "Wordle",
        "url": "https://www.onlinegames.io/wordle/"
      }
    ]
  },
  "fullContent": "Home› WordWords of WondersBy OnlineGames.ioMake Game Full ScreenWords of Wonders is a fun online puzzle game for crossword lovers. In this free word game, you’ll use a set of letters to build words and solve crossword puzzles. The game not just lets you test your word skills but also introduces wonders of world. Each puzzle is set in a different famous landmark, making you feel like you're traveling the globe. Serene backgrounds, calming sound design and relatively easy puzzles sets the stage for you to relax and practice mindfulness. So, grab your laptop or tablet or phone, get a cup of coffee and enjoy this peaceful game. Play this browser game online on OnlineGames.io anytime, anywhere!ControlsComputer: Click and drag your mouse to connect letters.Mobile/Tablet: Just tap and swipe your finger across the letters to form words.Form WordsAt the start of each puzzle, you'll see a circle with letters at the right of your screen. At left, there's a crossword board with blank spaces. Your job is to use these letters to form words and fill in all the empty spaces.For example, if you have letters like T, O, P, you can form words like TOP, POT, or OPT. Drag your mouse or finger from one letter to the next, in the correct order, to create the word. As you progress through crossword levels, you'll have more letters to form longer words.Complete CrosswordsWhen you correctly guess a word, it fills the crossword spaces on the board. Your goal is to fill all the blanks. Each time you finish a puzzle, you move forward to explore a new famous place, like the Eiffel Tower or the Great Wall of China.Use Hints to Fill UpIf you get stuck, don't worry! You have hints to help you out. Tap or click the hint button, and the game will reveal a letter in the puzzle. This helps you when you can't figure out a tricky word. For example, if you're stuck on a word with spaces like \"T_P,\" using a hint might show the missing letter \"O,\" helping you complete the word \"TOP.\"The Hammer ToolAnother useful feature is the hammer. When you use the hammer, you can choose any specific space on the crossword board to reveal that letter. It’s great for when you’re totally stuck and hints aren't enough. But use it wisely, because hammers are limited!DeveloperWords of Wonders was created by Fugo Games and Famobi. They make fun puzzle games for all ages, and they love helping players learn new words while having fun. The best part is they localized the game so you can play Words of Wonders in 38 languages besides English. Just go to settings to switch to one of the available languages. You can see a list of languages available below.Similar Word GamesIf you enjoy Words of Wonders, you'll probably like other word games such as Text Talk, and Wordle. These online games are also great for improving your vocabulary while having fun.Technical InfoGame Title: Words of WondersGenre: PuzzleMode: SingleplayerPlatforms: Web, iOS, AndroidControls: Mouse click or tapSave: Automatically saved in browser cacheGame Provider: Fugo Games, Famobi Dev and PlayinLanguages: Afrikaans, Shqip, لغة عربية, Azərbaycanca, Português brasileiro, Български, Čeština, Dansk, Deutsch, English, Español, Suomi, Français, Ελληνικά, עברית, Hrvatski, Magyar, Indonesia, Íslenska, Italiano, 日本語, Қазақша, Lietuvių Kalba, Latviešu valoda, Bahasa Melayu, Nederlands, Bokmål, Polski, Português, Română, Русский, Svenska, Slovenský, Slovenščina, Türkçe, УкраїнськаRelease Date: May 2023 (HTML5), 2018 (Android & iOS)This article was updated on March 27, 20251 Player2DBrainFreeHTML5LogicMobileMousePuzzleWord",
  "extractedAt": "2025-06-10T05:45:01.877Z",
  "localThumbnail": "Words of Wonders_1749534301878.jpg"
}