{
  "url": "https://www.onlinegames.io/words-from-words/",
  "title": "Words from Words",
  "category": "/t/puzzle/",
  "thumbnail": "https://www.onlinegames.io/media/posts/983/words-from-words.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/983/words-from-words.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/983/responsive/words-from-words-xs.jpg 384w, https://www.onlinegames.io/media/posts/983/responsive/words-from-words-sm.jpg 600w, https://www.onlinegames.io/media/posts/983/responsive/words-from-words-md.jpg 768w, https://www.onlinegames.io/media/posts/983/responsive/words-from-words-lg.jpg 1200w",
    "alt": "Words from Words Play Online",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://html5.gamedistribution.com/607f9f304899446aaf075339ba3dff81/?gd_sdk_referrer_url=https://www.onlinegames.io/words-from-words/",
  "content": {
    "headings": [
      {
        "type": "h3",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "How to Play Words by Words"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "Other Words Games"
      }
    ],
    "controls": [
      "On Computers",
      "Click letters to form wordsClick the word list to see definitions",
      "On Mobiles",
      "Tap letters to build wordsTap any word to learn what it means"
    ],
    "howToPlay": "At each level, you'll start with one long word, like example or chalkboard.Use the letters from that word to build as many smaller common nouns as you can. For instance, you can form words like APE, MEAL, PALM using the letters of EXAMPLE. Words must be at least 3 letters long.No proper nouns, verbs, or made-up words allowed.When you think of a valid word, click or tap the letters in order.Submit it and it'll be added to your list.Want to learn something new? Click on a word to see its definition!\n\nSome words are easy, but others are hiding in plain sight. Think creatively, sometimes even short words like \"map\" or \"cab\" can help push your total higher. You can get 3 stars by completing a level fully. If you get one star you can move onto the next level. There are 18 levels awaiting. Can you conquer them all?",
    "tips": "",
    "developer": "Words from Words was crafted by Wit Games.",
    "similarGames": []
  },
  "fullContent": "Home› WordWords from WordsBy OnlineGames.ioMake Game Full ScreenWords from Words is a brain-teasing word puzzle game that's all about stretching your vocabulary! You're given one big word, like example or synchrony, and your goal is to create as many smaller words as you can using only the letters from that word. It's the kind of game that sounds easy… until you find yourself staring at the screen thinking, \"Is lam even a word?\" LOL. Whether you're a spelling bee champ or just have a love for online word games, this one's got just the right amount of anagram challenge. Plus, it's relaxing, with no timers and no pressure. Just letters, logic, and lots of \"aha!\" moments.ControlsOn ComputersClick letters to form wordsClick the word list to see definitionsOn MobilesTap letters to build wordsTap any word to learn what it meansHow to Play Words by WordsAt each level, you'll start with one long word, like example or chalkboard.Use the letters from that word to build as many smaller common nouns as you can. For instance, you can form words like APE, MEAL, PALM using the letters of EXAMPLE. Words must be at least 3 letters long.No proper nouns, verbs, or made-up words allowed.When you think of a valid word, click or tap the letters in order.Submit it and it'll be added to your list.Want to learn something new? Click on a word to see its definition!Some words are easy, but others are hiding in plain sight. Think creatively, sometimes even short words like \"map\" or \"cab\" can help push your total higher. You can get 3 stars by completing a level fully. If you get one star you can move onto the next level. There are 18 levels awaiting. Can you conquer them all?DeveloperWords from Words was crafted by Wit Games.Other Words GamesIf you enjoy word games that really make you think, you'll definitely want to check out a few other favorites. One of the most popular is Wordle, where you get six chances to guess a five-letter word. It's quick, clever, and super satisfying when you get it right. Another great pick is Words of Wonders, a travel-themed puzzle game where you build words from a handful of letters to complete crossword-style boards. It's relaxing and feels like a mental vacation. Each of these games gives your brain a nice workout, whether you're into quick guessing, long puzzles, or creative word-building. Try them out and see which one becomes your new favorite!This article was updated on April 11, 20251 Player2DBrainFreeHTML5LogicMobileMousePuzzleWord",
  "extractedAt": "2025-06-10T05:44:45.996Z",
  "localThumbnail": "Words from Words_1749534285996.jpg"
}