{
  "url": "https://www.onlinegames.io/world-guesser/",
  "title": "World Guesser",
  "category": "/t/puzzle/",
  "thumbnail": "https://www.onlinegames.io/media/posts/888/world-guesser.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/888/world-guesser.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/888/responsive/world-guesser-xs.jpg 384w, https://www.onlinegames.io/media/posts/888/responsive/world-guesser-sm.jpg 600w, https://www.onlinegames.io/media/posts/888/responsive/world-guesser-md.jpg 768w, https://www.onlinegames.io/media/posts/888/responsive/world-guesser-lg.jpg 1200w",
    "alt": "World Guesser Play For Free",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://www.worldguessr.com/",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "How to Play World Guesser"
      },
      {
        "type": "h2",
        "text": "The Community Maps Bonanza!"
      },
      {
        "type": "h2",
        "text": "Duels in World Guesser"
      },
      {
        "type": "h2",
        "text": "World Guesser with Friends: Party Rooms"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "Languages"
      },
      {
        "type": "h3",
        "text": "Is there a free version of GeoGuessr?"
      },
      {
        "type": "h2",
        "text": "More Guess Games"
      }
    ],
    "controls": [
      "Computer",
      "Navigate the map with the mouse.Zoom in and out using the scroll wheel.Left-click to guess",
      "Smartphone",
      "Pinch to zoom in and out.Drag your finger across the screen to move the map.Tap to make your guess."
    ],
    "howToPlay": "Pick your language solo or duel and start a round to get dropped into a random map location.Explore the area by moving around to gather clues. These clues can be in the form of anything, such as street signs, architectural style, people, terrain, vegetation, weather, mountains, rivers, lakes, and seas.You can take a hint from World Guesser, if you'd like narrow down the region to make the guess. When you have a guess, zoom in on the map and click to guess your location.After you make the guess you'll see how close your guess is to the actual location. (You can change units from meters to miles in-game settings.)At this point, you will earn points based on the accuracy. Each game has 5 rounds of exploring and guessing. The aim is to achieve 25,000 points in total.Play multiple rounds to improve your score and compete with friends!",
    "tips": "",
    "developer": "World Guesser (WorldGuessr) is brought to you by Coder Gautam.",
    "similarGames": []
  },
  "fullContent": "Home› PuzzleWorld GuesserBy OnlineGames.ioMake Game Full ScreenPut your geography knowledge to the test with World Guesser! This fun and educational game drops you into random locations on the map, and your goal is to guess where you are. It's like the game developers' way of saying, \"You think you know geography, huh? Let's see you pinpoint a random street in Kazakhstan!\" It's a game where the world is your playground, and every click could lead you from the bustling streets of Tokyo to the serene landscapes of Patagonia.In this free online game similar to GeoGuessr, you're dropped into a random Google Street View location somewhere on Earth. Use your wit, knowledge, and a dash of luck to guess where you are on the globe. Seek visual clues like landmarks, road signs, or even the terrain to pinpoint your location. Each correct guess gets you closer to becoming a geography master. Explore the world, improve your map-reading skills, and have fun with World Guesser on OnlineGames.io! Perfect for explorers, trivia buffs, or anyone looking to spice up their geography knowledge with a game that's as educational as it is entertaining. Plus, it's the only place where getting lost feels like an achievement.ControlsComputerNavigate the map with the mouse.Zoom in and out using the scroll wheel.Left-click to guessSmartphonePinch to zoom in and out.Drag your finger across the screen to move the map.Tap to make your guess.How to Play World GuesserPick your language solo or duel and start a round to get dropped into a random map location.Explore the area by moving around to gather clues. These clues can be in the form of anything, such as street signs, architectural style, people, terrain, vegetation, weather, mountains, rivers, lakes, and seas.You can take a hint from World Guesser, if you'd like narrow down the region to make the guess. When you have a guess, zoom in on the map and click to guess your location.After you make the guess you'll see how close your guess is to the actual location. (You can change units from meters to miles in-game settings.)At this point, you will earn points based on the accuracy. Each game has 5 rounds of exploring and guessing. The aim is to achieve 25,000 points in total.Play multiple rounds to improve your score and compete with friends!The Community Maps Bonanza!  Dive into community-made maps for endless fun! These community maps are like the world's most chaotic treasure hunt, where every player is both the hunter and the creator of the chaos. Who knew geography could be this much of a party? Must-explores are as follows:Capitals of the World: Can you spot the difference between Washington D.C., and Ottawa? No? Good luck!  Soccer Fields: Ever thought you could identify a stadium by the grass pattern? Now's your chance to prove it.Country Flags: Match the flag to the land unless you think the Swiss flag flies over Sydney.  Airports: From LAX to LHR, see if you can navigate the world of aviation without a boarding pass. It's a brilliant mode for those who love to wander virtually but can't afford the plane tickets. 🤑And More: From \"Skibidi Ohio the Ultimate Map\" to \"Famous Street Food Stalls,\" the community's creativity knows no bounds.Duels in World GuesserChallenge your geography skills in thrilling online duels! World Guesser lets you compete head-to-head with players worldwide to see who can guess locations more accurately and faster. Here's how it works:Hit the duel button and let the game pair you with opponents of similar skill levels.Both players are dropped into the same location and must explore, analyze, and make their guesses before the timer runs out (15 seconds by default).Points are awarded based on the accuracy and speed of your guess. Outperform your opponent to win the round! Compete, climb the leaderboard, and prove you're the ultimate geography expert.World Guesser with Friends: Party RoomsYou can also create custom party rooms to play with friends and set your own rules. Customize the experience by adjusting:The number of rounds.Time limits for each round.Movement options (allow or restrict movement).Zooming (enable or disable zooming and panning).Street name visibility (toggle on or off).Specific maps or themes to play on.Make every game unique and tailored to your preferences—perfect for friendly competitions or testing your skills!DeveloperWorld Guesser (WorldGuessr) is brought to you by Coder Gautam.LanguagesWorld Guesser is available in five languages, making it accessible to players worldwide:EnglishSpanishRussianGermanFrenchIs there a free version of GeoGuessr?Yes, World Guesser has similar mechanics to GeoGuessr and is completely free to play on OnlineGames.io.More Guess GamesIf you love the thrill of exploring and guessing, World Guesser is just the beginning! Discover more free games on OnlineGames.io, like Google Feud and dive into challenges that test your knowledge and intuition. Whether you're identifying patterns or making clever guesses, there's always something fun waiting for you. Explore now and expand your gaming adventure!This article was updated on December 4, 20243DBrainFreeFunHTML5LogicMobileMouseMultiplayerPuzzle",
  "extractedAt": "2025-06-10T05:45:26.610Z",
  "localThumbnail": "World Guesser_1749534326611.jpg"
}