{
  "url": "https://www.onlinegames.io/x-trench-run/",
  "title": "X Trench Run",
  "category": "/t/shooting/",
  "thumbnail": "https://www.onlinegames.io/media/posts/562/X-Trench-Run.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/562/X-Trench-Run.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/562/responsive/X-Trench-Run-xs.jpg 384w, https://www.onlinegames.io/media/posts/562/responsive/X-Trench-Run-sm.jpg 600w, https://www.onlinegames.io/media/posts/562/responsive/X-Trench-Run-md.jpg 768w, https://www.onlinegames.io/media/posts/562/responsive/X-Trench-Run-lg.jpg 1200w",
    "alt": "X Trench Run Free Online Game",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://html5.gamedistribution.com/24d6db9a49d94cc28cf6c5b0073adb28/?gd_sdk_referrer_url=https://www.onlinegames.io/x-trench-run",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "How to Play X Trench Run"
      },
      {
        "type": "h3",
        "text": "Turrets on the Platform"
      },
      {
        "type": "h3",
        "text": "Boss Fight"
      },
      {
        "type": "h3",
        "text": "Boosters in X Trench Run"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "Other Arcade Games"
      }
    ],
    "controls": [
      "To move, use the WASD keys or the Arrow keys.To shoot, press the Spacebar or use the left mouse button."
    ],
    "howToPlay": "It will not be easy to move forward with a spacecraft on this platform in space. You will encounter all kinds of obstacles. There are many turrets and laser fields. You will also need to destroy some of the walls in front of you by shooting them with the spacecraft's gun.",
    "tips": "",
    "developer": "X Trench Run was created by MarketJS.",
    "similarGames": []
  },
  "fullContent": "Home› ArcadeX Trench RunBy OnlineGames.ioMake Game Full ScreenX Trench Run is an arcade game where the player navigates a spacecraft and tries to avoid many obstacles and possible collisions. Your role is to be a galactic driver and escape from the obstacles that will appear along the platform. There is a very fast-flowing platform here. You have to rely on your reflexes. Steering a spacecraft through the vastness of space won't be a walk in the park in this running game!How to Play X Trench RunIt will not be easy to move forward with a spacecraft on this platform in space. You will encounter all kinds of obstacles. There are many turrets and laser fields. You will also need to destroy some of the walls in front of you by shooting them with the spacecraft's gun.Turrets on the PlatformBefore you encounter any turrets, you will receive a large warning icon on the game screen indicating where the turret will be located. Keep a safe distance from these areas as much as possible. Turrets can even be positioned on their sides on the edges of the platform.Boss FightEliminating many turrets and walls as you progress through the platform will make some foes very angry.A flame-throwing space jet will be present to prevent your progress. This jet will follow your every move and make attacks that will hit you on your spacecraft.If you come into contact with any flames, you will lose the game.You need to aim well to destroy it. Reduce the health bar of the jet that appears above the screen to zero before the spacecraft encounters any fireballs.Boosters in X Trench RunWhile there will be obstacles throughout the platform, there will also be things that will benefit you. You will encounter blue boosters along the way. Collecting these boosters will enhance your spacecraft's chance of survival.Force Shield: It provides a temporary shield to protect you from collisions.Wall Destroyer: It destroys all walls that may stand in your way.Speed Down: It slows down the speed of your spacecraft, allowing you to proceed more carefully.ControlsTo move, use the WASD keys or the Arrow keys.To shoot, press the Spacebar or use the left mouse button.DeveloperX Trench Run was created by MarketJS.Other Arcade GamesIf you like playing X Trench Run, you may try Electron Dash. It's a fast-paced running game in which you have to go through a blue tunnel in space. You will meet some challenges, such as lasers and gaps between the tunnel sections. You must not fall through these gaps, or you will be defeated.Or, you may look up other free arcade games and avoid games on OnlineGames.io for more options. Please leave any suggestions in the comments area below!This article was updated on January 28, 20253DActionArcadeAvoidEndlessFlyingFreeHTML5MobileShootingSkill",
  "extractedAt": "2025-06-10T05:44:08.240Z",
  "localThumbnail": "X Trench Run_1749534248240.jpg"
}