{
  "url": "https://www.onlinegames.io/xtreme-paintball-wars/",
  "title": "Xtreme Paintball Wars",
  "category": "/t/shooting/",
  "thumbnail": "https://www.onlinegames.io/media/posts/609/Xtreme-Paintball-Wars-Keyboard-Controls.webp",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/609/Xtreme-Paintball-Wars-Keyboard-Controls.webp",
    "srcset": "https://www.onlinegames.io/media/posts/609/responsive/Xtreme-Paintball-Wars-Keyboard-Controls-xs.webp 384w, https://www.onlinegames.io/media/posts/609/responsive/Xtreme-Paintball-Wars-Keyboard-Controls-sm.webp 600w, https://www.onlinegames.io/media/posts/609/responsive/Xtreme-Paintball-Wars-Keyboard-Controls-md.webp 768w, https://www.onlinegames.io/media/posts/609/responsive/Xtreme-Paintball-Wars-Keyboard-Controls-lg.webp 1200w",
    "alt": "Xtreme Paintball Wars Keyboard Controls",
    "width": 750,
    "height": 224,
    "className": "is-loaded",
    "parentClass": "post__image post__image--center is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2023/unity2/xtreme-paintball-wars/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "How to Play Xtreme Paintball Wars"
      },
      {
        "type": "h3",
        "text": "Stylistic Weapons"
      },
      {
        "type": "h3",
        "text": "Game Modes in Xtreme Paintball Wars"
      },
      {
        "type": "h3",
        "text": "Change Your Character"
      },
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "More Games Like This"
      }
    ],
    "controls": [
      "To move, use the WASD or the Arrow keys.To fire, use the Left-Mouse click.To aim, use the Right-Mouse click.To reload, use the R key.To jump, use the Space key.To run, use the Shift key.To switch between weapons, use the number keys 1-9."
    ],
    "howToPlay": "You have two mode options: Multiplayer and Single Player. If you want to compete with online players worldwide, tap the “America” button. It will direct you to the lobby. You will see available servers here.Or, you may create a server for yourself by deciding on options like game map, game mode, number of players, and bots.The other option is Single Player mode. You can fight against bots and challenge your shooting abilities all alone.",
    "tips": "",
    "developer": "Xtreme Paintball Wars is created by FreezeNova.",
    "similarGames": []
  },
  "fullContent": "Home› ShootingXtreme Paintball WarsBy OnlineGames.ioMake Game Full Screen Xtreme Paintball Wars is a 3D shooting game where you will engage in a colorful battle. There are many paintball guns here, each with a unique style. Pick up your favorite one and begin eliminating enemies. Paintball Wars definitely is not one of those same old shooting games. You will fight with cubic creatures by using paints as ammunition. Show your precise aiming skills in the paintball showdown! 🔫How to Play Xtreme Paintball WarsYou have two mode options: Multiplayer and Single Player. If you want to compete with online players worldwide, tap the “America” button. It will direct you to the lobby. You will see available servers here.Or, you may create a server for yourself by deciding on options like game map, game mode, number of players, and bots.The other option is Single Player mode. You can fight against bots and challenge your shooting abilities all alone.Stylistic WeaponsThere are 9 fantastic guns you may enjoy to the fullest. You will have the P22, a chameleon-like weapon, the Scrossbow, and the GRLauncher in the first place. But as you win battles, you will unlock new guns. You may also view the guns in the Weapon Manager section from the lobby. The following are the names of the guns you can find.P22ScrossbowGRLauncherP90MAC 10WildwingAK47MP5Grenade2Game Modes in Xtreme Paintball WarsThe game offers you 5 diverse game mode options. You can play in Deathmatch, Team Deathmatch, and Gungame, as with every shooting game. The Wave Survival and the Zombies modes are the distinctive modes. In The Wave Survival, you will fight with many zombies in wave attacks. When you kill the specified number of zombies, you will move to the new waves. On the other hand, in the Zombies mode you will engage with both bots and zombies.Change Your CharacterYou may get yourself new characters by using your earned XPs. You will see three different character categories: Team 1, Team 2 and Zombies. You have the option to join one of the three categories when you enter any battlefield. There are 20 characters in each category. The hero you choose to play with for each category shows himself according to the team you decide to play.ControlsTo move, use the WASD or the Arrow keys.To fire, use the Left-Mouse click.To aim, use the Right-Mouse click.To reload, use the R key.To jump, use the Space key.To run, use the Shift key.To switch between weapons, use the number keys 1-9.DeveloperXtreme Paintball Wars is created by FreezeNova.More Games Like ThisIf you like playing Xtreme Paintball Wars, you may also like Pixel Battle Royale. It is another shooting game where you can choose your character from 6 different professions. You have the option to play the game in the sandbox or the battle royale mode. Play as you wish!For more options, look for other shooting games online on OnlineGames.io. Please share your gaming experiences with us in the comment section below!This article was updated on May 9, 20243DActionArenaBattleBattle RoyaleBlockColorFirst Person ShooterFreeFunGunMultiplayerShootingUnityWarWeaponZombie",
  "extractedAt": "2025-06-10T05:41:00.345Z",
  "localThumbnail": "Xtreme Paintball Wars_1749534060345.jpg"
}