{
  "url": "https://www.onlinegames.io/zodiac-runner/",
  "title": "Zodiac Runner",
  "category": "/t/running/",
  "thumbnail": "https://www.onlinegames.io/media/posts/726/Zodiac-Runner.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/726/Zodiac-Runner.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/726/responsive/Zodiac-Runner-xs.jpg 384w, https://www.onlinegames.io/media/posts/726/responsive/Zodiac-Runner-sm.jpg 600w, https://www.onlinegames.io/media/posts/726/responsive/Zodiac-Runner-md.jpg 768w, https://www.onlinegames.io/media/posts/726/responsive/Zodiac-Runner-lg.jpg 1200w",
    "alt": "Zodiac Runner Play Online",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2022/unity/zodiac-runner/index.html",
  "content": {
    "headings": [
      {
        "type": "h2",
        "text": "Controls"
      },
      {
        "type": "h2",
        "text": "About Zodiac Runner"
      },
      {
        "type": "h3",
        "text": "The Zodiac Gates"
      },
      {
        "type": "h3",
        "text": "Get the Compatibility Report"
      },
      {
        "type": "h2",
        "text": "Similar Online Games"
      }
    ],
    "controls": [
      "A or Left Arrow: Steer LeftD or Right Arrow: Steer RightOr, you can drag the mouse cursor to steer the girl."
    ],
    "howToPlay": "",
    "tips": "",
    "developer": "",
    "similarGames": [
      {
        "title": "Skater Girl",
        "url": "https://www.onlinegames.io/skater-girl/"
      }
    ]
  },
  "fullContent": "Home› RunningZodiac RunnerBy OnlineGames.ioMake Game Full ScreenAre you fond of zodiac signs? You'll find all twelve here! Zodiac Runner is a 3D arcade game in which you control a girl walking on a platform full of zodiac signs. Your girl automatically starts to walk, and you only need to steer her from left to right.In this running game, you can choose one of the zodiac signs on your path and collect items related to that specific sign. Try to get the highest score while walking towards a bodyguard!ControlsA or Left Arrow: Steer LeftD or Right Arrow: Steer RightOr, you can drag the mouse cursor to steer the girl.About Zodiac RunnerWhen you enter the platform on the sea, you will see two matching zodiac signs. There are gates belonging to these signs along the path.You must steer your character according to the sign you choose to continue with. Will you choose the workaholic Capricorn or the playful Gemini?By collecting items matching your chosen zodiac sign, you'll earn points. If you collect the other sign's stuff, your score will drop.For example, you must move forward by collecting the Libra symbols on the platform if you pass through the gate of Libra.You must get a certain score to reach the bodyguard at the end of the path. Otherwise, you cannot win the prize!The Zodiac GatesThe walking path has many gates labeled with two zodiac signs. Your job is to get through the right gate. Choose a gate and continue along the platform, collecting items matching the chosen zodiac sign.If you want to reach the finish line, you must gather these symbols. Avoid touching any of the items belonging to the other horoscope. Failing that, you will lose the points you have collected.Get the Compatibility ReportWhen you successfully complete the path, you will receive a compatibility report regarding the two signs on the platform. The report contains information about compatibility between these two zodiac signs.The report will show percentages for friendship, love, and family compatibility. Additionally, a brief explanation is written under the percentage bar. By obtaining information, you can increase your astrology knowledge!Similar Online GamesSkater Girl may also draw your attention. You will move forward on the two-way road with your skateboard. Try not to fall off your skateboard by tripping over the obstacles on the road!For additional game options, look for the online running games on OnlineGames.io. We are constantly trying to expand our game range. Bookmark this website to access new and free online games easily!This article was updated on April 29, 20241 Player3DArcadeAvoidFreeMouseParkourRunningUnity",
  "extractedAt": "2025-06-10T05:51:44.516Z",
  "localThumbnail": "Zodiac Runner_1749534704517.jpg"
}