{
  "url": "https://www.onlinegames.io/zombie-apocalypse-shooter/",
  "title": "Zombie Apocalypse Shooter",
  "category": "/t/action/",
  "thumbnail": "https://www.onlinegames.io/media/posts/807/Zombie-Apocalypse-Shooter.jpg",
  "thumbnailDetails": {
    "src": "https://www.onlinegames.io/media/posts/807/Zombie-Apocalypse-Shooter.jpg",
    "srcset": "https://www.onlinegames.io/media/posts/807/responsive/Zombie-Apocalypse-Shooter-xs.jpg 384w, https://www.onlinegames.io/media/posts/807/responsive/Zombie-Apocalypse-Shooter-sm.jpg 600w, https://www.onlinegames.io/media/posts/807/responsive/Zombie-Apocalypse-Shooter-md.jpg 768w, https://www.onlinegames.io/media/posts/807/responsive/Zombie-Apocalypse-Shooter-lg.jpg 1200w",
    "alt": "Zombie Apocalypse Shooter Free Online Game",
    "width": 256,
    "height": 256,
    "className": "is-loaded",
    "parentClass": "post__featured-image is-loaded"
  },
  "gameFrame": "https://www.onlinegames.io/games/2023/unity2/zombie-apocalypse-shooter/index.html",
  "content": {
    "headings": [
      {
        "type": "h3",
        "text": "Controls"
      },
      {
        "type": "h3",
        "text": "How to Play"
      },
      {
        "type": "h2",
        "text": "Guns"
      },
      {
        "type": "h2",
        "text": "Developer"
      },
      {
        "type": "h2",
        "text": "More Online Zombie Games"
      }
    ],
    "controls": [
      "WASD or arrow keys: MoveLeft shift: RunSpace: Jump1-9 or mouse scroll: Change weaponG: Throw a grenadeLeft mouse click: FireRight mouse click: Aim"
    ],
    "howToPlay": "There are 2 worlds, each with 40 levels in Zombie Apocalypse Shooter.At each level, you'll be tasked with destroying a certain number of zombies using your handy gun.Start looking for the undead; make use of the red arrows on the map to find them.Shoot 'em all and complete the level.When you're hurt, try to find a healing kit to keep fighting.Use the shop section to buy more advanced guns and equipment.The first levels are suitable for players with no FPS experience at all, but things will get crazy as you progress through the second world.",
    "tips": "",
    "developer": "FreezeNova created Zombie Apocalypse Shooter.",
    "similarGames": []
  },
  "fullContent": "Home› ZombieZombie Apocalypse ShooterBy OnlineGames.ioMake Game Full ScreenThe War of the Undead begins soon! Take your position in Zombie Apocalypse Shooter. You are humanity's last hope! Your enemies are not ordinary human beings. They are zombies with no conscience but an insatiable desire for brains.Zombie Apocalypse Shooter is a first-person shooter game where you eliminate zombies and complete missions one by one.ControlsWASD or arrow keys: MoveLeft shift: RunSpace: Jump1-9 or mouse scroll: Change weaponG: Throw a grenadeLeft mouse click: FireRight mouse click: AimHow to PlayThere are 2 worlds, each with 40 levels in Zombie Apocalypse Shooter.At each level, you'll be tasked with destroying a certain number of zombies using your handy gun.Start looking for the undead; make use of the red arrows on the map to find them.Shoot 'em all and complete the level.When you're hurt, try to find a healing kit to keep fighting.Use the shop section to buy more advanced guns and equipment.The first levels are suitable for players with no FPS experience at all, but things will get crazy as you progress through the second world.GunsHandgun: Simple to use firearm. Aim for the head for maximum effect.Cost: FreeSMG: A lightweight automatic firearm designed for close-range combat, it can be fired from the hip or shoulder.Cost: 1000 coinsMachete: A versatile broad blade used either as a chopping tool or in combat as a long knife.Cost: 1100 coinsM14: The M14, a select-fire battle rifle used by the United States, is chambered for 7.62 mm rounds.Cost: 1200 coinsAK-47: The AK-47, also known as the Kalashnikov Model 1947, is a Soviet-designed assault rifle and one of the most widely used shoulder-fired weapons.Cost: 1500 coinsGrenade: An explosive device that is typically thrown by hand.Cost: 2500 coins9mm: A semi-automatic firearm used for personal protection and special services.Cost: 3000 coinsScar-L: A highly accurate and fast-firing machine gun.Cost: 3500 coinsUMG: An enhanced version of the standard machine gun.Cost: 4000 coinsBidenhander: A specialized infantry weapon designed for warfare.Cost: 5000 coinsShotgun: A firearm intended to be fired from the shoulder, commonly used for close-range targets.Cost: 7000 coinsDeveloperFreezeNova created Zombie Apocalypse Shooter.More Online Zombie GamesOh, you like to fight against these brain-eaters, don't you? Go see all your alternatives on Zombie Games Online.For a more detailed game environment with a more difficult gameplay setting, our suggestion is the Realistic Zombie Survival Warfare.This article was updated on July 19, 20241 Player3DActionBattleDestroyFirst Person ShooterFreeGunHorrorShootingSurvivalUnityZombie",
  "extractedAt": "2025-06-10T04:14:45.595Z",
  "localThumbnail": "Zombie Apocalypse Shooter_1749528885595.jpg"
}